{
  "name": "comm",
  "section": 1,
  "title": "comm manual page",
  "description": "The comm utility reads file1 and file2, which should be sorted lexically, and produces three text columns as output: lines only in file1; lines only in file2; and lines in both files.",
  "synopsis": "comm [-123i] file1 file2",
  "category": "User Commands",
  "sections": [
    {
      "id": "name",
      "title": "NAME",
      "content": "macOS 15.5\t\t\t July 27, 2020\t\t\t    macOS 15.5",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     comm – select or reject lines common to two files\n",
        "     comm [-123i] file1 file2\n",
        "     The comm utility reads file1 and file2, which should be sorted lexically,\n     and produces three text columns as output: lines only in file1; lines\n     only in file2; and lines in both files.\n\n     The filename ``-'' means the standard input.\n\n     The following options are available:\n\n     -1      Suppress printing of column 1, lines only in file1.\n\n     -2      Suppress printing of column 2, lines only in file2.\n\n     -3      Suppress printing of column 3, lines common to both.\n\n     -i      Case insensitive comparison of lines.\n\n     Each column will have a number of tab characters prepended to it equal to\n     the number of lower numbered columns that are being printed.  For\n     example, if column number two is being suppressed, lines printed in\n     column number one will not have any tabs preceding them, and lines\n     printed in column number three will have one.\n\n     The comm utility assumes that the files are lexically sorted; all\n     characters participate in line comparisons.\n",
        "     The LANG, LC_ALL, LC_COLLATE, and LC_CTYPE environment variables affect\n     the execution of comm as described in environ(7).\n",
        "     The comm utility exits 0 on success, and >0 if an error occurs.\n",
        "     Assuming a file named example.txt with the following contents:\n\n\t   a\n\t   b\n\t   c\n\t   d\n\n     Show lines only in example.txt, lines only in stdin and common lines:\n\n\t   $ echo -e \"B\\nc\" | comm example.txt -\n\t\t   B\n\t   a\n\t   b\n\t\t\t   c\n\t   d\n\n     Show only common lines doing case insensitive comparisons:\n\n\t   $ echo -e \"B\\nc\" | comm -1 -2 -i example.txt -\n\t   b\n\t   c\n",
        "     cmp(1), diff(1), sort(1), uniq(1)\n",
        "     The comm utility conforms to IEEE Std 1003.2-1992 (“POSIX.2”).\n\n     The -i option is an extension to the POSIX standard.\n",
        "     A comm command appeared in Version 4 AT&T UNIX.\n"
      ]
    }
  ],
  "flags": [
    {
      "flag": "-1",
      "description": "Suppress printing of column 1, lines only in file1."
    },
    {
      "flag": "-2",
      "description": "Suppress printing of column 2, lines only in file2."
    },
    {
      "flag": "-3",
      "description": "Suppress printing of column 3, lines common to both."
    },
    {
      "flag": "-i",
      "description": "Case insensitive comparison of lines. Each column will have a number of tab characters prepended to it equal to the number of lower numbered columns that are being printed.  For example, if column number two is being suppressed, lines printed in column number one will not have any tabs preceding them, and lines printed in column number three will have one. The comm utility assumes that the files are lexically sorted; all characters participate in line comparisons."
    }
  ],
  "examples": [
    {
      "command": "echo -e \"B\\nc\" | comm example.txt -",
      "description": "B",
      "tags": [
        "pipe"
      ],
      "output": "\t\t   B\n\t   a\n\t   b\n\t\t\t   c\n\t   d\n     Show only common lines doing case insensitive comparisons:\n"
    },
    {
      "command": "echo -e \"B\\nc\" | comm -1 -2 -i example.txt -",
      "description": "b",
      "tags": [
        "pipe"
      ],
      "output": "\t   b\n\t   c\nSEE ALSO\n     cmp(1), diff(1), sort(1), uniq(1)\n"
    }
  ],
  "relatedCommands": [
    "cmp",
    "diff",
    "sort",
    "uniq",
    "comm",
    "select",
    "reject",
    "lines",
    "common",
    "file1",
    "file2",
    "utility",
    "reads",
    "which",
    "should"
  ],
  "seeAlso": [
    {
      "name": "cmp",
      "section": 1
    },
    {
      "name": "diff",
      "section": 1
    },
    {
      "name": "sort",
      "section": 1
    },
    {
      "name": "uniq",
      "section": 1
    }
  ],
  "metadata": {},
  "searchContent": "comm comm manual page the comm utility reads file1 and file2 which should be sorted lexically and produces three text columns as output lines only in file1 lines only in file2 and lines in both files comm -123i file1 file2 comm manual page utility reads file1 file2 which should sorted lexically produces text columns output lines only file1 file2 both -1 suppress printing of column 1 lines only in file1 -2 suppress printing of column 2 lines only in file2 -3 suppress printing of column 3 lines common to both -i case insensitive comparison of lines each column will have a number of tab characters prepended to it equal to the number of lower numbered columns that are being printed for example if column number two is being suppressed lines printed in column number one will not have any tabs preceding them and lines printed in column number three will have one the comm utility assumes that the files are lexically sorted all characters participate in line comparisons echo -e b nc comm example txt - b echo -e b nc comm -1 -2 -i example txt - b name macos 15 5 july 27 2020 macos 15 5",
  "keywords": [
    "comm",
    "manual",
    "page",
    "utility",
    "reads",
    "file1",
    "file2,",
    "which",
    "should",
    "sorted",
    "lexically,",
    "produces",
    "text",
    "columns",
    "output:",
    "lines",
    "only",
    "file1;",
    "file2;",
    "both"
  ],
  "complexity": "basic",
  "hash": "981e642b8cdfe86a",
  "parsedAt": "2025-06-17T19:32:27.311Z",
  "parseVersion": "2.0.0",
  "isCommon": false,
  "hasInteractiveExamples": true,
  "hasDiagrams": false
}