{
  "name": "du",
  "section": 1,
  "title": "du manual page",
  "description": "The du utility displays the file system block usage for each file argument and for each directory in the file hierarchy rooted in each directory argument.",
  "synopsis": "du [-Aclnx] [-H | -L | -P] [-g | -h | -k | -m] [-a | -s | -d depth] [-B blocksize] [-I mask] [-t threshold] [file ...]",
  "category": "User Commands",
  "sections": [
    {
      "id": "name",
      "title": "NAME",
      "content": "[-B blocksize] [-I mask] [-t threshold] [file ...]",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     du – display disk usage statistics\n",
        "     du [-Aclnx] [-H | -L | -P] [-g | -h | -k | -m] [-a | -s | -d depth]"
      ]
    },
    {
      "id": "description",
      "title": "DESCRIPTION",
      "content": "-m or --si options are not specified, the block counts will be\n\t\tdisplayed in units of that block size.\tIf BLOCKSIZE is not\n\t\tset, and the -h, -k, -m or --si options are not specified, the\n\t\tblock counts will be displayed in 512-byte blocks.",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     The du utility displays the file system block usage for each file\n     argument and for each directory in the file hierarchy rooted in each\n     directory argument.  If no file is specified, the block usage of the\n     hierarchy rooted in the current directory is displayed.\n\n     The options are as follows:\n\n     -A      Display the apparent size instead of the disk usage.  This can be\n\t     helpful when operating on compressed volumes or sparse files.\n\n     -B blocksize\n\t     Calculate block counts in blocksize byte blocks.  This is\n\t     different from the -h, -k, -m, --si and -g options or setting\n\t     BLOCKSIZE and gives an estimate of how much space the examined\n\t     file hierarchy would require on a filesystem with the given\n\t     blocksize.  Unless in -A mode, blocksize is rounded up to the\n\t     next multiple of 512.\n\n     -H      Symbolic links on the command line are followed, symbolic links\n\t     in file hierarchies are not followed.\n\n     -I mask\n\t     Ignore files and directories matching the specified mask.\n\n     -L      Symbolic links on the command line and in file hierarchies are\n\t     followed.\n\n     -P      No symbolic links are followed.  This is the default.\n\n     -a      Display an entry for each file in a file hierarchy.\n\n     -c      Display a grand total.\n\n     -d depth\n\t     Display an entry for all files and directories depth directories\n\t     deep.\n\n     -g      Display block counts in 1073741824-byte (1 GiB) blocks.\n\n     -h      “Human-readable” output.  Use unit suffixes: Byte, Kilobyte,\n\t     Megabyte, Gigabyte, Terabyte and Petabyte based on powers of\n\t     1024.\n\n     -k      Display block counts in 1024-byte (1 kiB) blocks.\n\n     -l      If a file has multiple hard links, count its size multiple times.\n\t     The default behavior of du is to count files with multiple hard\n\t     links only once.  When the -l option is specified, the hard link\n\t     checks are disabled, and these files are counted (and displayed)\n\t     as many times as they are found.\n\n     -m      Display block counts in 1048576-byte (1 MiB) blocks.\n\n     -n      Ignore files and directories with user “nodump” flag (UF_NODUMP)\n\t     set.\n\n     -r      Generate messages about directories that cannot be read, files\n\t     that cannot be opened, and so on.\tThis is the default case.\n\t     This option exists solely for conformance with X/Open Portability\n\t     Guide Issue 4 (“XPG4”).\n\n     -s      Display an entry for each specified file.\t(Equivalent to -d 0)\n\n     --si    “Human-readable” output.  Use unit suffixes: Byte, Kilobyte,\n\t     Megabyte, Gigabyte, Terabyte and Petabyte based on powers of\n\t     1000.\n\n     -t threshold\n\t     Display only entries for which size exceeds threshold.  If\n\t     threshold is negative, display only entries for which size is\n\t     less than the absolute value of threshold.\n\n     -x      File system mount points are not traversed.\n\n     The du utility counts the storage used by symbolic links and not the\n     files they reference unless the -H or -L option is specified.  If either\n     the -H or -L option is specified, storage used by any symbolic links\n     which are followed is not counted (or displayed).\tThe -H, -L and -P\n     options override each other and the command's actions are determined by\n     the last one specified.\n\n     Files having multiple hard links are counted (and displayed) a single\n     time per du execution.  Directories having multiple hard links (typically\n     Time Machine backups) are counted a single time per du execution.\tThe\n     -h, -k, -m and --si options all override each other; the last one\n     specified determines the block counts used.\n",
        "     BLOCKSIZE\tIf the environment variable BLOCKSIZE is set, and the -h, -k,"
      ]
    },
    {
      "id": "examples",
      "title": "EXAMPLES",
      "content": "macOS 15.5\t\t\tAugust 1, 2019\t\t\t    macOS 15.5",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     Show disk usage for all files in the current directory.  Output is in\n     human-readable form:\n\n\t   # du -ah\n\n     Summarize disk usage in the current directory:\n\n\t   # du -hs\n\n     Summarize disk usage for a specific directory:\n\n\t   # du -hs /home\n\n     Show name and size of all C files in a specific directory.  Also display\n     a grand total at the end:\n\n\t   # du -ch /usr/src/sys/kern/*.c\n",
        "     df(1), chflags(2), fts(3), symlink(7), quot(8)\n",
        "     The du utility is compliant with the IEEE Std 1003.1-2008 (“POSIX.1”)\n     specification.\n\n     The flags [-cdhP], as well as the BLOCKSIZE environment variable, are\n     extensions to that specification.\n\n     The flag [-r] is accepted but ignored, for compatibility with systems\n     implementing the obsolete X/Open Commands and Utilities Issue 5 (“XCU5”)\n     standard.\n",
        "     The du utility and its -a and -s options first appeared in Version 1 AT&T\n     UNIX.\n\n     The -r option first appeared in AT&T System III UNIX and is available\n     since FreeBSD 3.5.  The -k and -x options first appeared in 4.3BSD-Reno\n     and -H in 4.4BSD.\tThe -c and -L options first appeared in the GNU\n     fileutils; -L and -P are available since 4.4BSD-Lite1, -c since\n     FreeBSD 2.2.6.  The -d option first appeared in FreeBSD 2.2, -h first\n     appeared in FreeBSD 4.0.\n",
        "     This version of du was written by Chris Newcomb for 4.3BSD-Reno in 1989.\n"
      ]
    }
  ],
  "flags": [
    {
      "flag": "-A",
      "description": "Display the apparent size instead of the disk usage.  This can be helpful when operating on compressed volumes or sparse files."
    },
    {
      "flag": "-B",
      "description": " Calculate block counts in blocksize byte blocks.  This is different from the -h, -k, -m, --si and -g options or setting BLOCKSIZE and gives an estimate of how much space the examined file hierarchy would require on a filesystem with the given blocksize.  Unless in -A mode, blocksize is rounded up to the next multiple of 512.",
      "optional": true
    },
    {
      "flag": "-H",
      "description": " in file hierarchies are not followed.",
      "optional": true
    },
    {
      "flag": "-I",
      "description": " Ignore files and directories matching the specified mask.",
      "optional": true
    },
    {
      "flag": "-L",
      "description": " followed.",
      "optional": false
    },
    {
      "flag": "-P",
      "description": "",
      "optional": false
    },
    {
      "flag": "-a",
      "description": "",
      "optional": true
    },
    {
      "flag": "-c",
      "description": "Display a grand total."
    },
    {
      "flag": "-d",
      "description": " Display an entry for all files and directories depth directories deep.",
      "optional": false
    },
    {
      "flag": "-g",
      "description": "",
      "optional": true
    },
    {
      "flag": "-h",
      "description": " Megabyte, Gigabyte, Terabyte and Petabyte based on powers of 1024. specified determines the block counts used.",
      "optional": false
    },
    {
      "flag": "-k",
      "description": "",
      "optional": false
    },
    {
      "flag": "-l",
      "description": "If a file has multiple hard links, count its size multiple times. The default behavior of du is to count files with multiple hard links only once.  When the -l option is specified, the hard link checks are disabled, and these files are counted (and displayed) as many times as they are found."
    },
    {
      "flag": "-m",
      "description": "",
      "optional": false
    },
    {
      "flag": "-n",
      "description": "Ignore files and directories with user “nodump” flag (UF_NODUMP) set."
    },
    {
      "flag": "-r",
      "description": "Generate messages about directories that cannot be read, files that cannot be opened, and so on.\tThis is the default case. This option exists solely for conformance with X/Open Portability Guide Issue 4 (“XPG4”)."
    },
    {
      "flag": "--si",
      "description": "“Human-readable” output.  Use unit suffixes: Byte, Kilobyte, Megabyte, Gigabyte, Terabyte and Petabyte based on powers of 1000.",
      "shortFlag": "-s"
    },
    {
      "flag": "-t",
      "description": " Display only entries for which size exceeds threshold.  If threshold is negative, display only entries for which size is less than the absolute value of threshold.",
      "optional": true
    },
    {
      "flag": "-x",
      "description": "File system mount points are not traversed. The du utility counts the storage used by symbolic links and not the files they reference unless the -H or -L option is specified.  If either the -H or -L option is specified, storage used by any symbolic links which are followed is not counted (or displayed).\tThe -H, -L and -P options override each other and the command's actions are determined by the last one specified. Files having multiple hard links are counted (and displayed) a single time per du execution.  Directories having multiple hard links (typically Time Machine backups) are counted a single time per du execution.\tThe"
    },
    {
      "flag": "-h",
      "description": " Megabyte, Gigabyte, Terabyte and Petabyte based on powers of 1024. specified determines the block counts used.",
      "optional": false
    }
  ],
  "examples": [],
  "relatedCommands": [
    "df",
    "chflags",
    "fts",
    "symlink",
    "quot",
    "display",
    "disk",
    "usage",
    "statistics",
    "depth",
    "blocksize",
    "mask",
    "threshold",
    "utility",
    "displays"
  ],
  "seeAlso": [
    {
      "name": "df",
      "section": 1
    },
    {
      "name": "chflags",
      "section": 2
    },
    {
      "name": "fts",
      "section": 3
    },
    {
      "name": "symlink",
      "section": 7
    },
    {
      "name": "quot",
      "section": 8
    }
  ],
  "metadata": {},
  "searchContent": "du du manual page the du utility displays the file system block usage for each file argument and for each directory in the file hierarchy rooted in each directory argument du -aclnx -h -l -p -g -h -k -m -a -s -d depth -b blocksize -i mask -t threshold file du manual page utility displays block usage each argument directory hierarchy rooted argument -a display the apparent size instead of the disk usage this can be helpful when operating on compressed volumes or sparse files -b calculate block counts in blocksize byte blocks this is different from the -h -k -m --si and -g options or setting blocksize and gives an estimate of how much space the examined file hierarchy would require on a filesystem with the given blocksize unless in -a mode blocksize is rounded up to the next multiple of 512 -h in file hierarchies are not followed -i ignore files and directories matching the specified mask -l followed -p -a -c display a grand total -d display an entry for all files and directories depth directories deep -g -h megabyte gigabyte terabyte and petabyte based on powers of 1024 specified determines the block counts used -k -l if a file has multiple hard links count its size multiple times the default behavior of du is to count files with multiple hard links only once when the -l option is specified the hard link checks are disabled and these files are counted and displayed as many times as they are found -m -n ignore files and directories with user nodump flag uf nodump set -r generate messages about directories that cannot be read files that cannot be opened and so on this is the default case this option exists solely for conformance with x open portability guide issue 4 xpg4 --si human-readable output use unit suffixes byte kilobyte megabyte gigabyte terabyte and petabyte based on powers of 1000 -t display only entries for which size exceeds threshold if threshold is negative display only entries for which size is less than the absolute value of threshold -x file system mount points are not traversed the du utility counts the storage used by symbolic links and not the files they reference unless the -h or -l option is specified if either the -h or -l option is specified storage used by any symbolic links which are followed is not counted or displayed the -h -l and -p options override each other and the command s actions are determined by the last one specified files having multiple hard links are counted and displayed a single time per du execution directories having multiple hard links typically time machine backups are counted a single time per du execution the -h megabyte gigabyte terabyte and petabyte based on powers of 1024 specified determines the block counts used name -b blocksize -i mask -t threshold file description -m or --si options are not specified the block counts will be displayed in units of that block size if blocksize is not set and the -h -k -m or --si options are not specified the block cou examples macos 15 5 august 1 2019 macos 15 5",
  "keywords": [
    "du",
    "manual",
    "page",
    "utility",
    "displays",
    "block",
    "usage",
    "each",
    "argument",
    "directory",
    "hierarchy",
    "rooted",
    "argument."
  ],
  "complexity": "intermediate",
  "hash": "e9c5bc8c7fbbb60f",
  "parsedAt": "2025-06-17T19:31:58.588Z",
  "parseVersion": "2.0.0",
  "isCommon": false,
  "hasInteractiveExamples": false,
  "hasDiagrams": false
}