{
  "name": "pr",
  "section": 1,
  "title": "pr manual page",
  "description": "The pr utility is a printing and pagination filter for text files.",
  "synopsis": "pr [+page] [-column] [-adFfmprt] [[-e] [char] [gap]] [-L locale] [-h header] [[-i] [char] [gap]] [-l lines] [-o offset] [[-s] [char]] [[-n] [char] [width]] [-w width] [-] [file ...]",
  "category": "User Commands",
  "sections": [
    {
      "id": "name",
      "title": "NAME",
      "content": "[-h header] [[-i] [char] [gap]] [-l lines] [-o offset] [[-s] [char]]\n\t[[-n] [char] [width]] [-w width] [-] [file ...]",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     pr – print files\n",
        "     pr [+page] [-column] [-adFfmprt] [[-e] [char] [gap]] [-L locale]"
      ]
    },
    {
      "id": "description",
      "title": "DESCRIPTION",
      "content": "macOS 15.5\t\t\t July 3, 2004\t\t\t    macOS 15.5",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     The pr utility is a printing and pagination filter for text files.  When\n     multiple input files are specified, each is read, formatted, and written\n     to standard output.  By default, the input is separated into 66-line\n     pages, each with\n\n     •\t A 5-line header with the page number, date, time, and the pathname of",
        "     •\t A 5-line trailer consisting of blank lines.\n\n     If standard output is associated with a terminal, diagnostic messages are\n     suppressed until the pr utility has completed processing.\n\n     When multiple column output is specified, text columns are of equal\n     width.  By default text columns are separated by at least one <blank>.\n     Input lines that do not fit into a text column are truncated.  Lines are\n     not truncated under single column output.\n",
        "     In the following option descriptions, column, lines, offset, page, and\n     width are positive decimal integers and gap is a nonnegative decimal\n     integer.\n\n     +page\n\t   Begin output at page number page of the formatted input.\n\n     -column\n\t   Produce output that is columns wide (default is 1) that is written\n\t   vertically down each column in the order in which the text is\n\t   received from the input file.  The options -e and -i are assumed.\n\t   This option should not be used with -m.  When used with -t, the\n\t   minimum number of lines is used to display the output.  (To\n\t   columnify and reshape text files more generally and without\n\t   additional formatting, see the rs(1) utility.)\n\n     -a    Modify the effect of the -column option so that the columns are\n\t   filled across the page in a round-robin order (e.g., when column is\n\t   2, the first input line heads column 1, the second heads column 2,\n\t   the third is the second line in column 1, etc.).  This option\n\t   requires the use of the -column option.\n\n     -d    Produce output that is double spaced.  An extra <newline> character\n\t   is output following every <newline> found in the input.\n\n     -e [char][gap]\n\t   Expand each input <tab> to the next greater column position\n\t   specified by the formula n*gap+1, where n is an integer > 0.  If\n\t   gap is zero or is omitted the default is 8.\tAll <tab> characters\n\t   in the input are expanded into the appropriate number of <space>s.\n\t   If any nondigit character, char, is specified, it is used as the\n\t   input tab character.\n\n     -F    Use a <form-feed> character for new pages, instead of the default\n\t   behavior that uses a sequence of <newline> characters.\n\n     -f    Same as -F but pause before beginning the first page if standard\n\t   output is a terminal.\n\n     -h header\n\t   Use the string header to replace the file name in the header line.\n\n     -i [char][gap]\n\t   In output, replace multiple <space>s with <tab>s whenever two or\n\t   more adjacent <space>s reach column positions gap+1, 2*gap+1, etc.\n\t   If gap is zero or omitted, default <tab> settings at every eighth\n\t   column position is used.  If any nondigit character, char, is\n\t   specified, it is used as the output <tab> character.\n\n     -L locale\n\t   Use locale specified as argument instead of one found in\n\t   environment.  Use \"C\" to reset locale to default.\n\n     -l lines\n\t   Override the 66 line default and reset the page length to lines.\n\t   If lines is not greater than the sum of both the header and trailer\n\t   depths (in lines), the pr utility suppresses output of both the\n\t   header and trailer, as if the -t option were in effect.\n\n     -m    Merge the contents of multiple files.  One line from each file\n\t   specified by a file operand is written side by side into text\n\t   columns of equal fixed widths, in terms of the number of column\n\t   positions.  The number of text columns depends on the number of\n\t   file operands successfully opened.  The maximum number of files\n\t   merged depends on page width and the per process open file limit.\n\t   The options -e and -i are assumed.\n\n     -n [char][width]\n\t   Provide width digit line numbering.\tThe default for width, if not\n\t   specified, is 5.  The number occupies the first width column\n\t   positions of each text column or each line of -m output.  If char\n\t   (any nondigit character) is given, it is appended to the line\n\t   number to separate it from whatever follows.  The default for char\n\t   is a <tab>.\tLine numbers longer than width columns are truncated.\n\n     -o offset\n\t   Each line of output is preceded by offset <spaces>s.  If the -o\n\t   option is not specified, the default is zero.  The space taken is\n\t   in addition to the output line width.\n\n     -p    Pause before each page if the standard output is a terminal.  pr\n\t   will write an alert character to standard error and wait for a\n\t   carriage return to be read on the terminal.\n\n     -r    Write no diagnostic reports on failure to open a file.\n\n     -s char\n\t   Separate text columns by the single character char instead of by\n\t   the appropriate number of <space>s (default for char is the <tab>\n\t   character).\n\n     -t    Print neither the five-line identifying header nor the five-line\n\t   trailer usually supplied for each page.  Quit printing after the\n\t   last line of each file without spacing to the end of the page.\n\n     -w width\n\t   Set the width of the line to width column positions for multiple\n\t   text-column output only.  If the -w option is not specified and the\n\t   -s option is not specified, the default width is 72.  If the -w\n\t   option is not specified and the -s option is specified, the default\n\t   width is 512.\n\n     file  A pathname of a file to be printed.\tIf no file operands are\n\t   specified, or if a file operand is ‘-’, the standard input is used.\n\t   The standard input is used only if no file operands are specified,\n\t   or if a file operand is ‘-’.\n\n     The -s option does not allow the option letter to be separated from its\n     argument, and the options -e, -i, and -n require that both arguments, if\n     present, not be separated from the option letter.\n",
        "     The pr utility exits 0 on success, and >0 if an error occurs.\n",
        "     If pr receives an interrupt while printing to a terminal, it flushes all\n     accumulated error messages to the screen before terminating.\n\n     Error messages are written to standard error during the printing process\n     (if output is redirected) or after all successful file printing is\n     complete (when printing to a terminal).\n",
        "     The last space before the tab stop is replaced with a tab character.  In\n     legacy mode, it is not.\n\n     For more information about legacy mode, see compat(5).\n",
        "     cat(1), more(1), rs(1), compat(5)\n",
        "     The pr utility is IEEE Std 1003.1-2001 (“POSIX.1”) compatible.\n",
        "     A pr command appeared in Version 1 AT&T UNIX.\n",
        "     The pr utility does not recognize multibyte characters.\n"
      ]
    }
  ],
  "flags": [
    {
      "flag": "-column",
      "description": " Produce output that is columns wide (default is 1) that is written vertically down each column in the order in which the text is received from the input file.  The options -e and -i are assumed. This option should not be used with -m.  When used with -t, the minimum number of lines is used to display the output.  (To columnify and reshape text files more generally and without additional formatting, see the rs(1) utility.)",
      "optional": true
    },
    {
      "flag": "-a",
      "description": "Modify the effect of the -column option so that the columns are filled across the page in a round-robin order (e.g., when column is 2, the first input line heads column 1, the second heads column 2, the third is the second line in column 1, etc.).  This option requires the use of the -column option."
    },
    {
      "flag": "-d",
      "description": "Produce output that is double spaced.  An extra <newline> character is output following every <newline> found in the input."
    },
    {
      "flag": "-e",
      "description": " Expand each input <tab> to the next greater column position specified by the formula n*gap+1, where n is an integer > 0.  If gap is zero or is omitted the default is 8.\tAll <tab> characters in the input are expanded into the appropriate number of <space>s. If any nondigit character, char, is specified, it is used as the input tab character.",
      "optional": true
    },
    {
      "flag": "-F",
      "description": "Use a <form-feed> character for new pages, instead of the default behavior that uses a sequence of <newline> characters."
    },
    {
      "flag": "-f",
      "description": "Same as -F but pause before beginning the first page if standard output is a terminal."
    },
    {
      "flag": "-h",
      "description": " Use the string header to replace the file name in the header line.",
      "optional": true
    },
    {
      "flag": "-i",
      "description": " In output, replace multiple <space>s with <tab>s whenever two or more adjacent <space>s reach column positions gap+1, 2*gap+1, etc. If gap is zero or omitted, default <tab> settings at every eighth column position is used.  If any nondigit character, char, is specified, it is used as the output <tab> character.",
      "optional": true
    },
    {
      "flag": "-L",
      "description": " Use locale specified as argument instead of one found in environment.  Use \"C\" to reset locale to default.",
      "optional": true
    },
    {
      "flag": "-l",
      "description": " Override the 66 line default and reset the page length to lines. If lines is not greater than the sum of both the header and trailer depths (in lines), the pr utility suppresses output of both the header and trailer, as if the -t option were in effect.",
      "optional": true
    },
    {
      "flag": "-m",
      "description": "Merge the contents of multiple files.  One line from each file specified by a file operand is written side by side into text columns of equal fixed widths, in terms of the number of column positions.  The number of text columns depends on the number of file operands successfully opened.  The maximum number of files merged depends on page width and the per process open file limit. The options -e and -i are assumed."
    },
    {
      "flag": "-n",
      "description": " Provide width digit line numbering.\tThe default for width, if not specified, is 5.  The number occupies the first width column positions of each text column or each line of -m output.  If char (any nondigit character) is given, it is appended to the line number to separate it from whatever follows.  The default for char is a <tab>.\tLine numbers longer than width columns are truncated.",
      "optional": true
    },
    {
      "flag": "-o",
      "description": " Each line of output is preceded by offset <spaces>s.  If the -o option is not specified, the default is zero.  The space taken is in addition to the output line width.",
      "optional": true
    },
    {
      "flag": "-p",
      "description": "Pause before each page if the standard output is a terminal.  pr will write an alert character to standard error and wait for a carriage return to be read on the terminal."
    },
    {
      "flag": "-r",
      "description": "Write no diagnostic reports on failure to open a file."
    },
    {
      "flag": "-s",
      "description": " Separate text columns by the single character char instead of by the appropriate number of <space>s (default for char is the <tab> character). option is not specified and the -s option is specified, the default width is 512. file  A pathname of a file to be printed.\tIf no file operands are specified, or if a file operand is ‘-’, the standard input is used. The standard input is used only if no file operands are specified, or if a file operand is ‘-’. The -s option does not allow the option letter to be separated from its argument, and the options -e, -i, and -n require that both arguments, if present, not be separated from the option letter. EXIT STATUS The pr utility exits 0 on success, and >0 if an error occurs.",
      "optional": true
    },
    {
      "flag": "-t",
      "description": "Print neither the five-line identifying header nor the five-line trailer usually supplied for each page.  Quit printing after the last line of each file without spacing to the end of the page."
    },
    {
      "flag": "-w",
      "description": " Set the width of the line to width column positions for multiple text-column output only.  If the -w option is not specified and the",
      "optional": true
    },
    {
      "flag": "-s",
      "description": " Separate text columns by the single character char instead of by the appropriate number of <space>s (default for char is the <tab> character). option is not specified and the -s option is specified, the default width is 512. file  A pathname of a file to be printed.\tIf no file operands are specified, or if a file operand is ‘-’, the standard input is used. The standard input is used only if no file operands are specified, or if a file operand is ‘-’. The -s option does not allow the option letter to be separated from its argument, and the options -e, -i, and -n require that both arguments, if present, not be separated from the option letter. EXIT STATUS The pr utility exits 0 on success, and >0 if an error occurs.",
      "optional": true
    }
  ],
  "examples": [],
  "relatedCommands": [
    "cat",
    "more",
    "rs",
    "compat",
    "print",
    "page",
    "column",
    "char",
    "gap",
    "locale",
    "header",
    "lines",
    "offset",
    "width",
    "utility"
  ],
  "seeAlso": [
    {
      "name": "cat",
      "section": 1
    },
    {
      "name": "more",
      "section": 1
    },
    {
      "name": "rs",
      "section": 1
    },
    {
      "name": "compat",
      "section": 5
    }
  ],
  "metadata": {},
  "searchContent": "pr pr manual page the pr utility is a printing and pagination filter for text files pr page -column -adffmprt -e char gap -l locale -h header -i char gap -l lines -o offset -s char -n char width -w width - file pr manual page utility printing pagination filter text files -column produce output that is columns wide default is 1 that is written vertically down each column in the order in which the text is received from the input file the options -e and -i are assumed this option should not be used with -m when used with -t the minimum number of lines is used to display the output to columnify and reshape text files more generally and without additional formatting see the rs 1 utility -a modify the effect of the -column option so that the columns are filled across the page in a round-robin order e g when column is 2 the first input line heads column 1 the second heads column 2 the third is the second line in column 1 etc this option requires the use of the -column option -d produce output that is double spaced an extra newline character is output following every newline found in the input -e expand each input tab to the next greater column position specified by the formula n gap 1 where n is an integer 0 if gap is zero or is omitted the default is 8 all tab characters in the input are expanded into the appropriate number of space s if any nondigit character char is specified it is used as the input tab character -f use a form-feed character for new pages instead of the default behavior that uses a sequence of newline characters -f same as -f but pause before beginning the first page if standard output is a terminal -h use the string header to replace the file name in the header line -i in output replace multiple space s with tab s whenever two or more adjacent space s reach column positions gap 1 2 gap 1 etc if gap is zero or omitted default tab settings at every eighth column position is used if any nondigit character char is specified it is used as the output tab character -l use locale specified as argument instead of one found in environment use c to reset locale to default -l override the 66 line default and reset the page length to lines if lines is not greater than the sum of both the header and trailer depths in lines the pr utility suppresses output of both the header and trailer as if the -t option were in effect -m merge the contents of multiple files one line from each file specified by a file operand is written side by side into text columns of equal fixed widths in terms of the number of column positions the number of text columns depends on the number of file operands successfully opened the maximum number of files merged depends on page width and the per process open file limit the options -e and -i are assumed -n provide width digit line numbering the default for width if not specified is 5 the number occupies the first width column positions of each text column or each line of -m output if char any nondigit character is given it is appended to the line number to separate it from whatever follows the default for char is a tab line numbers longer than width columns are truncated -o each line of output is preceded by offset spaces s if the -o option is not specified the default is zero the space taken is in addition to the output line width -p pause before each page if the standard output is a terminal pr will write an alert character to standard error and wait for a carriage return to be read on the terminal -r write no diagnostic reports on failure to open a file -s separate text columns by the single character char instead of by the appropriate number of space s default for char is the tab character option is not specified and the -s option is specified the default width is 512 file a pathname of a file to be printed if no file operands are specified or if a file operand is - the standard input is used the standard input is used only if no file operands are specified or if a file operand is - the -s option does not allow the option letter to be separated from its argument and the options -e -i and -n require that both arguments if present not be separated from the option letter exit status the pr utility exits 0 on success and 0 if an error occurs -t print neither the five-line identifying header nor the five-line trailer usually supplied for each page quit printing after the last line of each file without spacing to the end of the page -w set the width of the line to width column positions for multiple text-column output only if the -w option is not specified and the -s separate text columns by the single character char instead of by the appropriate number of space s default for char is the tab character option is not specified and the -s option is specified the default width is 512 file a pathname of a file to be printed if no file operands are specified or if a file operand is - the standard input is used the standard input is used only if no file operands are specified or if a file operand is - the -s option does not allow the option letter to be separated from its argument and the options -e -i and -n require that both arguments if present not be separated from the option letter exit status the pr utility exits 0 on success and 0 if an error occurs name -h header -i char gap -l lines -o offset -s char -n char width -w width - file description macos 15 5 july 3 2004 macos 15 5",
  "keywords": [
    "pr",
    "manual",
    "page",
    "utility",
    "printing",
    "pagination",
    "filter",
    "text",
    "files."
  ],
  "complexity": "intermediate",
  "hash": "e17c7a9687a345dd",
  "parsedAt": "2025-06-17T19:32:29.884Z",
  "parseVersion": "2.0.0",
  "isCommon": false,
  "hasInteractiveExamples": false,
  "hasDiagrams": false
}