{
  "name": "top",
  "section": 1,
  "title": "top manual page",
  "description": "The top program periodically displays a sorted list of system processes.",
  "synopsis": "top [-a | -d | -e | -c mode] [-F | -f] [-h] [-i interval] [-l samples] [-ncols columns] [-o key | -O skey] [-R | -r] [-S] [-s delay-secs] [-n nprocs] [-stats keys] [-pid processid] [-user username] [-U username] [-u]",
  "category": "User Commands",
  "sections": [
    {
      "id": "name",
      "title": "NAME",
      "content": "[-F | -f]\n\t [-h]\n\t [-i interval]\n\t [-l samples]\n\t [-ncols columns]\n\t [-o key | -O skey]\n\t [-R | -r]\n\t [-S]\n\t [-s delay-secs]\n\t [-n nprocs]\n\t [-stats keys]\n\t [-pid processid]\n\t [-user username]\n\t [-U username]\n\t [-u]",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     top – display sorted information about processes\n",
        "     top [-a | -d | -e | -c mode]"
      ]
    },
    {
      "id": "description",
      "title": "DESCRIPTION",
      "content": "Darwin\t\t\t       February 10, 2020\t\t\tDarwin",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     The top program periodically displays a sorted list of system processes.\n     The default sorting key is pid, but other keys can be used instead.\n     Various output options are available.\n",
        "     Command line option specifications are processed from left to right.\n     Options can be specified more than once.  If conflicting options are\n     specified, later specifications override earlier ones.  This makes it\n     viable to create a shell alias for top with preferred defaults specified,\n     then override those preferred defaults as desired on the command line.\n\n     -a      Equivalent to -c a.\n\n     -c mode\n\t     Set event counting mode to mode.  The supported modes are\n\n\t     a\t     Accumulative mode.  Count events cumulatively, starting\n\t\t     at the launch of top.  Calculate CPU usage and CPU time\n\t\t     since the launch of top.\n\n\t     d\t     Delta mode.  Count events relative to the previous\n\t\t     sample.  Calculate CPU usage since the previous sample.\n\t\t     This mode by default disables the memory object map\n\t\t     reporting.  The memory object map reporting may be re-\n\t\t     enabled with the -r option or the interactive r command.\n\n\t     e\t     Absolute mode.  Count events using absolute counters.\n\n\t     n\t     Non-event mode (default).\tCalculate CPU usage since the\n\t\t     previous sample.\n\n     -d      Equivalent to -c d.\n\n     -e      Equivalent to -c e.\n\n     -F      Do not calculate statistics on shared libraries, also known as\n\t     frameworks.\n\n     -f      Calculate statistics on shared libraries, also known as\n\t     frameworks (default).\n\n     -h      Print command line usage information and exit.\n\n     -i interval\n\t     Update framework (-f) info every interval samples; see the\n\t     PERFORMANCE/ACCURACY TRADEOFF section for more details.\n\n     -l samples\n\t     Use logging mode and display samples samples, even if standard\n\t     output is a terminal.  0 is treated as infinity.  Rather than\n\t     redisplaying, output is periodically printed in raw form.\tNote\n\t     that the first sample displayed will have an invalid %CPU\n\t     displayed for each process, as it is calculated using the delta\n\t     between samples.\n\n     -ncols columns\n\t     Display columns when using logging mode.  The default is\n\t     infinite.\tThe number must be > 0 or an error will occur.\n\n     -n nprocs\n\t     Only display up to nprocs processes.\n\n     -O skey\n\t     Use skey as a secondary key when ordering the process display.\n\t     See -o for key names (pid is the default).\n\n     -o key  Order the process display by sorting on key in descending order.\n\t     A + or - can be prefixed to the key name to specify ascending or\n\t     descending order, respectively.  The supported keys are:\n\n\t     pid     Process ID\n\n\t     command\n\t\t     Command name.\n\n\t     cpu     CPU usage.  (default).\n\n\t     cpu_me  CPU time charged to me by other processes.\n\n\t     cpu_others\n\t\t     CPU time charged to other processes by me.\n\n\t     csw     The number of context switches.\n\n\t     time    Execution time.\n\n\t     threads\n\t\t     alias: th\n\t\t     Number of threads (total/running).\n\n\t     ports   alias: prt\n\t\t     Number of Mach ports.\n\n\t     mregion\n\t\t     alias: mreg, reg\n\t\t     Number of memory regions.\n\n\t     mem     Physical memory footprint of the process.\n\n\t     rprvt   Resident private address space size.\n\n\t     purg    Purgeable memory size.\n\n\t     vsize   Total memory size.\n\n\t     vprvt   Private address space size.\n\n\t     kprvt   Private kernel memory size.\n\n\t     kshrd   Shared kernel memory size.\n\n\t     pgrp    Process group ID.\n\n\t     ppid    Parent process ID.\n\n\t     state   alias: pstate\n\t\t     Process state.\n\t\t     One of \"zombie\", \"running\", \"stuck\" (i.e. uninterruptible\n\t\t     sleep),  \"sleeping\", \"idle\", \"stopped\", \"halted\", or\n\t\t     \"unknown\".\n\n\t     uid     User ID.\n\n\t     wq      alias: #wq, workqueue\n\t\t     The workqueue total/running.\n\n\t     faults  alias: fault\n\t\t     The number of page faults.\n\n\t     cow     alias: cow_faults\n\t\t     The copy-on-write faults.\n\n\t     user    alias: username\n\t\t     Username.\n\n\t     msgsent\n\t\t     Total number of Mach messages sent.\n\n\t     msgrecv\n\t\t     Total number of Mach messages received.\n\n\t     sysbsd  Total BSD syscalls.\n\n\t     sysmach\n\t\t     Total Mach syscalls.\n\n\t     pageins\n\t\t     Total pageins.\n\n\t     boosts  The number of boosts held by the process.\tThis is\n\t\t     followed by the number of times the process has\n\t\t     transitioned from unboosted to boosted in brackets.  An\n\t\t     asterisk before the value indicates that the process was\n\t\t     able to send boosts at some point since the previous\n\t\t     update.  For more information about boosts, see\n\t\t     xpc_transaction_begin(3).\n\n\t     instrs  The number of instructions retired by the process in both\n\t\t     user space and the kernel.\n\n\t     cycles  The number of cycles spent executing instructions in the\n\t\t     process in both user space and the kernel.\n\n\t     jetpri  Jetsam priority of the process.\n\n     -R      Do not traverse and report the memory object map for each process\n\t     (default).\n\n     -r      Traverse and report the memory object map for each process.\n\n     -S      Display the global statistics for swap and purgeable memory.\n\n     -s delay-secs\n\t     Set the delay between updates to delay-secs seconds.  The default\n\t     delay between updates is 1 second.\n\n     -stats keys\n\t     Only display the comma separated statistics.  See the -o flag for\n\t     the valid keys.\n\n     -pid processid\n\t     Only display processid in top.  This option may be specified\n\t     multiple times.\n\n     -user user\n\t     Only display processes owned by user\n\n     -U user\n\t     This is an alias for -user.\n\n     -u      This is an alias equivalent to: -o cpu -O time\n",
        "     The first several lines of the top display show various global state.\n     All of the information is labeled.  Following is an alphabetical list of\n     global state fields and their descriptions.\n\n     CPU\t Percentage of processor usage, broken into user, system, and",
        "     Disks\t Number and total size of disk reads and writes.\n\n     LoadAvg\t Load average over 1, 5, and 15 minutes.  The load average is",
        "     MemRegions  Number and total size of memory regions, and total size of",
        "     Networks\t Number and total size of input and output network packets.\n\n     PhysMem\t Physical memory usage, broken into wired, active, inactive,",
        "     Procs\t Total number of processes and number of processes in each",
        "     SharedLibs  Resident sizes of code and data segments, and link editor",
        "     Threads\t Number of threads.\n\n     Time\t Time, in H:MM:SS format.  When running in logging mode, Time",
        "     VirtMem\t Total virtual memory, virtual memory consumed by shared",
        "     Swap\t Swap usage: total size of swap areas, amount of swap space in",
        "     Purgeable\t Number of pages purged and number of pages currently",
        "     Below the global state fields, a list of processes is displayed.  The\n     fields that are displayed depend on the options that are set.  The pid\n     field displays the following for the architecture:\n\n     + for 64-bit native architecture, or - for 32-bit native architecture, or\n     * for a non-native architecture.\n",
        "     When top is run in interactive (non-logging) mode, it is possible to\n     control the output of top, as well as interactively send signals to\n     processes.  The interactive command syntax is terse.  Each command is one\n     character, followed by 0 to 2 arguments.  Commands that take arguments\n     prompt interactively for the arguments, and where applicable, the default\n     value is shown in square brackets.  The default value can be selected by\n     leaving the input field blank and pressing enter.\t^G escapes the\n     interactive argument prompt, and has the same effect as leaving the input\n     field blank and pressing enter.\n\n     The following commands are supported:\n\n     ?\t     Display the help screen.  Any character exits help screen mode.\n\t     This command always works, even in the middle of a command.\n\n     ^L      Redraw the screen.\n\n     cmode   Set output mode to mode.  See the -c option for descriptions of\n\t     the allowed modes.\n\n     Oskey   Use skey as a secondary key when ordering the process display.\n\t     See the -o option for key names.\n\n     okey    Order the process display by sorting on key in descending order.\n\t     A + or - can be prefixed to the key name to specify ascending or\n\t     descending order, respectively.  The supported keys and alises\n\t     are listed with the -o option above.\n\n     q\t     Quit.\n\n     r\t     Toggle traversal and reporting of the memory object map for each\n\t     process.\n\n     Ssignalpid\n\t     Send signal signal to pid.  signal can be specified either as a\n\t     number or as a name (for example, HUP).  The default signal\n\t     starts out as TERM.  Each time a signal is successfully sent, the\n\t     default signal is updated to be that signal.  pid is a process\n\t     id.\n\n     s delay-secs\n\t     Set the delay between updates to delay-secs seconds.\n\n     U user  Only display processes owned by user. Either the username or uid\n\t     number can be specified.  To display all processes, press enter\n\t     without entering a username or uid number.\n",
        "     Calculating detailed memory statistics is fundamentally resource-\n     intensive.  To reduce the CPU usage in top, the -i option has been\n     introduced to allow the user to tune this tradeoff.  With the default\n     value of 10, framework stats will be updated once every 10 samples.\n     Specifying -i 1 will result in the most accurate display, at the expense\n     of system resources.\n",
        "     When N/A occurs in a stat, it's caused by the memory object map reporting\n     being disabled.  Memory object map reporting is disabled by default in\n     delta mode, but may be optionally enabled via -r or the interactive r\n     command.  To enable the -r option, use it after any -c mode options.\n",
        "     top -o cpu -O +rsize -s 5 -n 20\n\t     Sort the processes according to CPU usage (descending) and\n\t     resident memory size (ascending), sample and update the display\n\t     at 5 second intervals, and limit the display to 20 processes.\n\n     top -c d\n\t     Run top in delta mode.\n\n     top -stats pid,command,cpu,th,pstate,time\n\t     Display only the specified statistics, regardless of any growth\n\t     of the terminal.  If the terminal is too small, only the\n\t     statistics that fit will be displayed.\n",
        "     taskinfo(1), vm_stat(1), vmmap(1), kill(2), signal(3)\n"
      ]
    }
  ],
  "flags": [],
  "examples": [],
  "relatedCommands": [
    "taskinfo",
    "vm_stat",
    "vmmap",
    "kill",
    "signal",
    "top",
    "display",
    "sorted",
    "information",
    "about",
    "processes",
    "mode",
    "interval",
    "samples",
    "ncols"
  ],
  "seeAlso": [
    {
      "name": "taskinfo",
      "section": 1
    },
    {
      "name": "vm_stat",
      "section": 1
    },
    {
      "name": "vmmap",
      "section": 1
    },
    {
      "name": "kill",
      "section": 2
    },
    {
      "name": "signal",
      "section": 3
    }
  ],
  "metadata": {},
  "searchContent": "top top manual page the top program periodically displays a sorted list of system processes top -a -d -e -c mode -f -f -h -i interval -l samples -ncols columns -o key -o skey -r -r -s -s delay-secs -n nprocs -stats keys -pid processid -user username -u username -u top manual page program periodically displays sorted list processes name -f -f -h -i interval -l samples -ncols columns -o key -o skey -r -r -s -s delay-secs -n nprocs -stats keys -pid processid -user username -u u description darwin february 10 2020 darwin",
  "keywords": [
    "top",
    "manual",
    "page",
    "program",
    "periodically",
    "displays",
    "sorted",
    "list",
    "processes."
  ],
  "complexity": "basic",
  "hash": "74b4152339e27303",
  "parsedAt": "2025-06-17T19:31:59.850Z",
  "parseVersion": "2.0.0",
  "isCommon": false,
  "hasInteractiveExamples": false,
  "hasDiagrams": false
}