{
  "name": "od",
  "section": 1,
  "title": "od manual page",
  "description": "The od utility is a filter which displays the specified files, or standard input if no files are specified, in a user specified format.",
  "synopsis": "od [-aBbcDdeFfHhIiLlOosvXx] [-A base] [-j skip] [-N length] [-t type] [[+]offset[.][Bb]] [file ...]",
  "category": "User Commands",
  "sections": [
    {
      "id": "name",
      "title": "NAME",
      "content": "[[+]offset[.][Bb]] [file ...]",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     od – octal, decimal, hex, ASCII dump\n",
        "     od [-aBbcDdeFfHhIiLlOosvXx] [-A base] [-j skip] [-N length] [-t type]"
      ]
    },
    {
      "id": "description",
      "title": "DESCRIPTION",
      "content": "macOS 15.5\t\t       December 22, 2011\t\t    macOS 15.5",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     The od utility is a filter which displays the specified files, or\n     standard input if no files are specified, in a user specified format.\n\n     The options are as follows:\n\n     -A base\t    Specify the input address base.  The argument base may be\n\t\t    one of d, o, x or n, which specify decimal, octal,\n\t\t    hexadecimal addresses or no address, respectively.\n\n     -a \t    Output named characters.  Equivalent to -t a.\n\n     -B, -o\t    Output octal shorts.  Equivalent to -t o2.\n\n     -b \t    Output octal bytes.  Equivalent to -t o1.\n\n     -c \t    Output C-style escaped characters.\tEquivalent to -t c.\n\n     -D \t    Output unsigned decimal ints.  Equivalent to -t u4.\n\n     -d \t    Output unsigned decimal shorts.  Equivalent to -t u2.\n\n     -e, -F\t    Output double-precision floating point numbers.\n\t\t    Equivalent to -t fD.\n\n     -f \t    Output single-precision floating point numbers.\n\t\t    Equivalent to -t fF.\n\n     -H, -X\t    Output hexadecimal ints.  Equivalent to -t x4.\n\n     -h, -x\t    Output hexadecimal shorts.\tEquivalent to -t x2.\n\n     -I, -L, -l     Output signed decimal longs.  Equivalent to -t dL.\n\n     -i \t    Output signed decimal ints.  Equivalent to -t dI.\n\n     -j skip\t    Skip skip bytes of the combined input before dumping.  The\n\t\t    number may be followed by one of b, k, m or g which\n\t\t    specify the units of the number as blocks (512 bytes),\n\t\t    kilobytes, megabytes and gigabytes, respectively.\n\n     -N length\t    Dump at most length bytes of input.\n\n     -O \t    Output octal ints.\tEquivalent to -t o4.\n\n     -s \t    Output signed decimal shorts.  Equivalent to -t d2.\n\n     -t type\t    Specify the output format.\tThe type argument is a string\n\t\t    containing one or more of the following kinds of type\n\t\t    specifiers:\n\n\t\t    a\t    Named characters (ASCII).  Control characters are\n\t\t\t    displayed using the following names:\n\n\t\t\t    000 NUL 001 SOH 002 STX 003 ETX 004 EOT 005 ENQ\n\t\t\t    006 ACK 007 BEL 008 BS  009 HT  00A NL  00B VT\n\t\t\t    00C FF  00D CR  00E SO  00F SI  010 DLE 011 DC1\n\t\t\t    012 DC2 013 DC3 014 DC4 015 NAK 016 SYN 017 ETB\n\t\t\t    018 CAN 019 EM  01A SUB 01B ESC 01C FS  01D GS\n\t\t\t    01E RS  01F US  020 SP  07F DEL\n\n\t\t    c\t    Characters in the default character set.  Non-\n\t\t\t    printing characters are represented as 3-digit\n\t\t\t    octal character codes, except the following\n\t\t\t    characters, which are represented as C escapes:\n\n\t\t\t    NUL \t     \\0\n\t\t\t    alert\t     \\a\n\t\t\t    backspace\t     \\b\n\t\t\t    newline\t     \\n\n\t\t\t    carriage-return  \\r\n\t\t\t    tab \t     \\t\n\t\t\t    vertical tab     \\v\n\n\t\t\t    Multi-byte characters are displayed in the area\n\t\t\t    corresponding to the first byte of the character.\n\t\t\t    The remaining bytes are shown as ‘**’.\n\n\t\t    [d|o|u|x][C|S|I|L|n]\n\t\t\t    Signed decimal (d), octal (o), unsigned decimal\n\t\t\t    (u) or hexadecimal (x).  Followed by an optional\n\t\t\t    size specifier, which may be either C (char), S\n\t\t\t    (short), I (int), L (long), or a byte count as a\n\t\t\t    decimal integer.\n\n\t\t    f[F|D|L|n]\n\t\t\t    Floating-point number.  Followed by an optional\n\t\t\t    size specifier, which may be either F (float), D\n\t\t\t    (double) or L (long double).\n\n     -v \t    Write all input data, instead of replacing lines of\n\t\t    duplicate values with a ‘*’.\n\n     Multiple options that specify output format may be used; the output will\n     contain one line for each format.\n\n     If no output format is specified, -t oS is assumed.\n",
        "     The LANG, LC_ALL and LC_CTYPE environment variables affect the execution\n     of od as described in environ(7).\n",
        "     The od utility exits 0 on success, and >0 if an error occurs.\n",
        "     Dump stdin and show the output using named characters and C-style escaped\n     characters:\n\n\t   $ echo \"FreeBSD: The power to serve\" | od -a -c\n\t   0000000    F   r   e   e   B   S   D   :  sp   T   h   e  sp   p   o   w\n\t\t      F   r   e   e   B   S   D   :\t  T   h   e\t  p   o   w\n\t   0000020    e   r  sp   t   o  sp   s   e   r   v   e  nl\n\t\t      e   r\t  t   o       s   e   r   v   e  \\n\n\t   0000034\n\n     Dump stdin skipping the first 13 bytes using named characters and dumping\n     no more than 5 bytes:\n\n\t   $ echo \"FreeBSD: The power to serve\" | od -An -a -j 13 -N 5\n\t\t      p   o   w   e   r\n",
        "     The traditional -s option to extract string constants is not supported;\n     consider using strings(1) instead.\n",
        "     hexdump(1), strings(1)\n",
        "     The od utility conforms to IEEE Std 1003.1-2001 (“POSIX.1”).\n",
        "     An od command appeared in Version 1 AT&T UNIX.\n"
      ]
    }
  ],
  "flags": [
    {
      "flag": "-A",
      "description": " one of d, o, x or n, which specify decimal, octal, hexadecimal addresses or no address, respectively.",
      "optional": true
    },
    {
      "flag": "-a",
      "description": "Output named characters.  Equivalent to -t a."
    },
    {
      "flag": "-B",
      "description": ", -o\t    Output octal shorts.  Equivalent to -t o2."
    },
    {
      "flag": "-b",
      "description": "Output octal bytes.  Equivalent to -t o1."
    },
    {
      "flag": "-c",
      "description": "Output C-style escaped characters.\tEquivalent to -t c."
    },
    {
      "flag": "-D",
      "description": "Output unsigned decimal ints.  Equivalent to -t u4."
    },
    {
      "flag": "-d",
      "description": "Output unsigned decimal shorts.  Equivalent to -t u2."
    },
    {
      "flag": "-e",
      "description": ", -F\t    Output double-precision floating point numbers. Equivalent to -t fD."
    },
    {
      "flag": "-f",
      "description": "Output single-precision floating point numbers. Equivalent to -t fF."
    },
    {
      "flag": "-H",
      "description": ", -X\t    Output hexadecimal ints.  Equivalent to -t x4."
    },
    {
      "flag": "-h",
      "description": ", -x\t    Output hexadecimal shorts.\tEquivalent to -t x2."
    },
    {
      "flag": "-I",
      "description": ", -L, -l     Output signed decimal longs.  Equivalent to -t dL."
    },
    {
      "flag": "-i",
      "description": "Output signed decimal ints.  Equivalent to -t dI."
    },
    {
      "flag": "-j",
      "description": " number may be followed by one of b, k, m or g which specify the units of the number as blocks (512 bytes), kilobytes, megabytes and gigabytes, respectively.",
      "optional": true
    },
    {
      "flag": "-N",
      "description": "",
      "optional": true
    },
    {
      "flag": "-O",
      "description": "Output octal ints.\tEquivalent to -t o4."
    },
    {
      "flag": "-s",
      "description": "Output signed decimal shorts.  Equivalent to -t d2."
    },
    {
      "flag": "-t",
      "description": " containing one or more of the following kinds of type specifiers: a\t    Named characters (ASCII).  Control characters are displayed using the following names: 000 NUL 001 SOH 002 STX 003 ETX 004 EOT 005 ENQ 006 ACK 007 BEL 008 BS  009 HT  00A NL  00B VT 00C FF  00D CR  00E SO  00F SI  010 DLE 011 DC1 012 DC2 013 DC3 014 DC4 015 NAK 016 SYN 017 ETB 018 CAN 019 EM  01A SUB 01B ESC 01C FS  01D GS 01E RS  01F US  020 SP  07F DEL c\t    Characters in the default character set.  Non- printing characters are represented as 3-digit octal character codes, except the following characters, which are represented as C escapes: NUL \t     \\0 alert\t     \\a backspace\t     \\b newline\t     \\n carriage-return  \\r tab \t     \\t vertical tab     \\v Multi-byte characters are displayed in the area corresponding to the first byte of the character. The remaining bytes are shown as ‘**’. [d|o|u|x][C|S|I|L|n] Signed decimal (d), octal (o), unsigned decimal (u) or hexadecimal (x).  Followed by an optional size specifier, which may be either C (char), S (short), I (int), L (long), or a byte count as a decimal integer. f[F|D|L|n] Floating-point number.  Followed by an optional size specifier, which may be either F (float), D (double) or L (long double).",
      "optional": true
    },
    {
      "flag": "-v",
      "description": "Write all input data, instead of replacing lines of duplicate values with a ‘*’. Multiple options that specify output format may be used; the output will contain one line for each format. If no output format is specified, -t oS is assumed."
    }
  ],
  "examples": [
    {
      "command": "echo \"FreeBSD: The power to serve\" | od -a -c",
      "description": "0000000    F   r   e   e   B   S   D   :  sp   T   h   e  sp   p   o   w",
      "tags": [
        "pipe"
      ],
      "output": "\t   0000000    F   r   e   e   B   S   D   :  sp   T   h   e  sp   p   o   w\n\t\t      F   r   e   e   B   S   D   :\t  T   h   e\t  p   o   w\n\t   0000020    e   r  sp   t   o  sp   s   e   r   v   e  nl\n\t\t      e   r\t  t   o       s   e   r   v   e  \\n\n\t   0000034\n     Dump stdin skipping the first 13 bytes using named characters and dumping\n     no more than 5 bytes:\n"
    },
    {
      "command": "echo \"FreeBSD: The power to serve\" | od -An -a -j 13 -N 5",
      "description": "p   o   w   e   r",
      "tags": [
        "pipe"
      ],
      "output": "\t\t      p   o   w   e   r\n"
    }
  ],
  "relatedCommands": [
    "hexdump",
    "strings",
    "octal",
    "decimal",
    "hex",
    "dump",
    "base",
    "skip",
    "length",
    "type",
    "offset",
    "utility",
    "filter",
    "which",
    "displays"
  ],
  "seeAlso": [
    {
      "name": "hexdump",
      "section": 1
    },
    {
      "name": "strings",
      "section": 1
    }
  ],
  "metadata": {},
  "searchContent": "od od manual page the od utility is a filter which displays the specified files or standard input if no files are specified in a user specified format od -abbcddeffhhiilloosvxx -a base -j skip -n length -t type offset bb file od manual page utility filter which displays specified files standard input specified format -a one of d o x or n which specify decimal octal hexadecimal addresses or no address respectively -a output named characters equivalent to -t a -b -o output octal shorts equivalent to -t o2 -b output octal bytes equivalent to -t o1 -c output c-style escaped characters equivalent to -t c -d output unsigned decimal ints equivalent to -t u4 -d output unsigned decimal shorts equivalent to -t u2 -e -f output double-precision floating point numbers equivalent to -t fd -f output single-precision floating point numbers equivalent to -t ff -h -x output hexadecimal ints equivalent to -t x4 -h -x output hexadecimal shorts equivalent to -t x2 -i -l -l output signed decimal longs equivalent to -t dl -i output signed decimal ints equivalent to -t di -j number may be followed by one of b k m or g which specify the units of the number as blocks 512 bytes kilobytes megabytes and gigabytes respectively -n -o output octal ints equivalent to -t o4 -s output signed decimal shorts equivalent to -t d2 -t containing one or more of the following kinds of type specifiers a named characters ascii control characters are displayed using the following names 000 nul 001 soh 002 stx 003 etx 004 eot 005 enq 006 ack 007 bel 008 bs 009 ht 00a nl 00b vt 00c ff 00d cr 00e so 00f si 010 dle 011 dc1 012 dc2 013 dc3 014 dc4 015 nak 016 syn 017 etb 018 can 019 em 01a sub 01b esc 01c fs 01d gs 01e rs 01f us 020 sp 07f del c characters in the default character set non- printing characters are represented as 3-digit octal character codes except the following characters which are represented as c escapes nul 0 alert a backspace b newline n carriage-return r tab t vertical tab v multi-byte characters are displayed in the area corresponding to the first byte of the character the remaining bytes are shown as d o u x c s i l n signed decimal d octal o unsigned decimal u or hexadecimal x followed by an optional size specifier which may be either c char s short i int l long or a byte count as a decimal integer f f d l n floating-point number followed by an optional size specifier which may be either f float d double or l long double -v write all input data instead of replacing lines of duplicate values with a multiple options that specify output format may be used the output will contain one line for each format if no output format is specified -t os is assumed echo freebsd the power to serve od -a -c 0000000 f r e e b s d sp t h e sp p o w echo freebsd the power to serve od -an -a -j 13 -n 5 p o w e r name offset bb file description macos 15 5 december 22 2011 macos 15 5",
  "keywords": [
    "od",
    "manual",
    "page",
    "utility",
    "filter",
    "which",
    "displays",
    "specified",
    "files,",
    "standard",
    "input",
    "specified,",
    "format."
  ],
  "complexity": "intermediate",
  "hash": "bff61b370c5a08ac",
  "parsedAt": "2025-06-17T19:41:57.820Z",
  "parseVersion": "2.0.0",
  "isCommon": false,
  "hasInteractiveExamples": true,
  "hasDiagrams": false
}