{
  "name": "sleep",
  "section": 1,
  "title": "sleep manual page",
  "description": "The sleep command suspends execution for a minimum of number seconds (the default, or unit s), minutes (unit m), hours (unit h), or days (unit d).",
  "synopsis": "sleep number[unit] [...]",
  "category": "User Commands",
  "sections": [
    {
      "id": "name",
      "title": "NAME",
      "content": "macOS 15.5\t\t\tMarch 22, 2024\t\t\t    macOS 15.5",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     sleep – suspend execution for an interval of time\n",
        "     sleep number[unit] [...]\n",
        "     The sleep command suspends execution for a minimum of number seconds (the\n     default, or unit s), minutes (unit m), hours (unit h), or days (unit d).\n     Intervals can be written in any form allowed by strtod(3).  If multiple\n     intervals are given, they are added together.  If the final sum is zero\n     or negative, sleep exits immediately.\n\n     If the sleep command receives a signal, it takes the standard action.\n     When the SIGINFO signal is received, the estimate of the amount of\n     seconds left to sleep is printed on the standard output.\n",
        "     The SIGALRM signal is not handled specially by this implementation.\n",
        "     The sleep utility exits 0 on success, and >0 if an error occurs.\n",
        "     To run a command after half an hour:\n\n\t   (sleep 0.5h; sh command_file >out 2>err)&\n\n     This incantation would wait half an hour before running the script\n     command_file.  See the at(1) utility for another way to do this.\n\n     To reiteratively run a command:\n\n\t   while :; do\n\t\t   if ! [ -r zzz.rawdata ] ; then\n\t\t\t   sleep 5m\n\t\t   else\n\t\t\t   for i in *.rawdata ; do\n\t\t\t\t   sleep 70\n\t\t\t\t   awk -f collapse_data \"$i\"\n\t\t\t   done >results\n\t\t\t   break\n\t\t   fi\n\t   done\n\n     The scenario for a script such as this might be: a program currently\n     running is taking longer than expected to process a series of files, and\n     it would be nice to have another program start processing the files\n     created by the first program as soon as it is finished (when zzz.rawdata\n     is created).  The script checks every five minutes for the file\n     zzz.rawdata, when the file is found, then another portion processing is\n     done courteously by sleeping for 70 seconds in between each awk(1) job.\n",
        "     nanosleep(2), sleep(3)\n",
        "     The sleep command is expected to be IEEE Std 1003.2 (“POSIX.2”)\n     compatible.\n\n     Support for non-integer intervals, units other than seconds, and multiple\n     intervals which are added together are non-portable extensions first\n     introduced in GNU sh-utils 2.0a (released in 2002).\n",
        "     A sleep command appeared in Version 4 AT&T UNIX.\n"
      ]
    }
  ],
  "flags": [],
  "examples": [],
  "relatedCommands": [
    "nanosleep",
    "sleep",
    "suspend",
    "execution",
    "interval",
    "time",
    "number",
    "unit",
    "command",
    "suspends",
    "minimum",
    "seconds",
    "default",
    "minutes",
    "hours"
  ],
  "seeAlso": [
    {
      "name": "nanosleep",
      "section": 2
    },
    {
      "name": "sleep",
      "section": 3
    }
  ],
  "metadata": {},
  "searchContent": "sleep sleep manual page the sleep command suspends execution for a minimum of number seconds the default or unit s minutes unit m hours unit h or days unit d sleep number unit sleep manual page command suspends execution minimum number seconds the default unit minutes unit hours days name macos 15 5 march 22 2024 macos 15 5",
  "keywords": [
    "sleep",
    "manual",
    "page",
    "command",
    "suspends",
    "execution",
    "minimum",
    "number",
    "seconds",
    "(the",
    "default,",
    "unit",
    "minutes",
    "(unit",
    "hours",
    "days"
  ],
  "complexity": "basic",
  "hash": "f9341ac2355716e2",
  "parsedAt": "2025-06-17T19:42:01.858Z",
  "parseVersion": "2.0.0",
  "isCommon": false,
  "hasInteractiveExamples": false,
  "hasDiagrams": false
}