{
  "name": "wget",
  "section": 1,
  "title": "The non-interactive network downloader.",
  "description": "GNU Wget is a free utility for non-interactive download of files from the Web.",
  "synopsis": "wget [option]... [URL]...",
  "category": "User Commands",
  "sections": [
    {
      "id": "name",
      "title": "NAME",
      "content": "GNU Wget 1.25.0 \t\t  2024-11-10\t\t\t       WGET(1)",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "       Wget - The non-interactive network downloader.\n",
        "       wget [option]... [URL]...\n",
        "       GNU Wget is a free utility for non-interactive download of files from\n       the Web.  It supports HTTP, HTTPS, and FTP protocols, as well as\n       retrieval through HTTP proxies.\n\n       Wget is non-interactive, meaning that it can work in the background,\n       while the user is not logged on.  This allows you to start a retrieval\n       and disconnect from the system, letting Wget finish the work.  By\n       contrast, most of the Web browsers require constant user's presence,\n       which can be a great hindrance when transferring a lot of data.\n\n       Wget can follow links in HTML, XHTML, and CSS pages, to create local\n       versions of remote web sites, fully recreating the directory structure\n       of the original site.  This is sometimes referred to as \"recursive\n       downloading.\"  While doing that, Wget respects the Robot Exclusion\n       Standard (/robots.txt).\tWget can be instructed to convert the links in\n       downloaded files to point at the local files, for offline viewing.\n\n       Wget has been designed for robustness over slow or unstable network\n       connections; if a download fails due to a network problem, it will keep\n       retrying until the whole file has been retrieved.  If the server\n       supports regetting, it will instruct the server to continue the\n       download from where it left off.\n",
        "       Since Wget uses GNU getopt to process command-line arguments, every\n       option has a long form along with the short one.  Long options are more\n       convenient to remember, but take time to type.  You may freely mix\n       different option styles, or specify options after the command-line\n       arguments.  Thus you may write:\n\n\t       wget -r --tries=10 http://fly.srk.fer.hr/ -o log\n\n       The space between the option accepting an argument and the argument may\n       be omitted.  Instead of -o log you can write -olog.\n\n       You may put several options that do not require arguments together,\n       like:\n\n\t       wget -drc <URL>\n\n       This is completely equivalent to:\n\n\t       wget -d -r -c <URL>\n\n       Since the options can be specified after the arguments, you may\n       terminate them with --.\tSo the following will try to download URL -x,\n       reporting failure to log:\n\n\t       wget -o log -- -x\n\n       The options that accept comma-separated lists all respect the\n       convention that specifying an empty list clears its value.  This can be\n       useful to clear the .wgetrc settings.  For instance, if your .wgetrc\n       sets \"exclude_directories\" to /cgi-bin, the following example will\n       first reset it, and then set it to exclude /~nobody and /~somebody.\n       You can also clear the lists in .wgetrc.\n\n\t       wget -X \"\" -X /~nobody,/~somebody\n\n       Most options that do not accept arguments are boolean options, so named\n       because their state can be captured with a yes-or-no (\"boolean\")\n       variable.  For example, --follow-ftp tells Wget to follow FTP links\n       from HTML files and, on the other hand, --no-glob tells it not to\n       perform file globbing on FTP URLs.  A boolean option is either\n       affirmative or negative (beginning with --no).  All such options share\n       several properties.\n\n       Unless stated otherwise, it is assumed that the default behavior is the\n       opposite of what the option accomplishes.  For example, the documented\n       existence of --follow-ftp assumes that the default is to not follow FTP\n       links from HTML pages.\n\n       Affirmative options can be negated by prepending the --no- to the\n       option name; negative options can be negated by omitting the --no-\n       prefix.\tThis might seem superfluous---if the default for an\n       affirmative option is to not do something, then why provide a way to\n       explicitly turn it off?\tBut the startup file may in fact change the\n       default.  For instance, using \"follow_ftp = on\" in .wgetrc makes Wget\n       follow FTP links by default, and using --no-follow-ftp is the only way\n       to restore the factory default from the command line.\n",
        "       -V\n       --version\n\t   Display the version of Wget.\n\n       -h\n       --help\n\t   Print a help message describing all of Wget's command-line options.\n\n       -b\n       --background\n\t   Go to background immediately after startup.\tIf no output file is\n\t   specified via the -o, output is redirected to wget-log.\n\n       -e command\n       --execute command\n\t   Execute command as if it were a part of .wgetrc.  A command thus\n\t   invoked will be executed after the commands in .wgetrc, thus taking\n\t   precedence over them.  If you need to specify more than one wgetrc\n\t   command, use multiple instances of -e.\n",
        "       -o logfile\n       --output-file=logfile\n\t   Log all messages to logfile.  The messages are normally reported to\n\t   standard error.\n\n       -a logfile\n       --append-output=logfile\n\t   Append to logfile.  This is the same as -o, only it appends to\n\t   logfile instead of overwriting the old log file.  If logfile does\n\t   not exist, a new file is created.\n\n       -d\n       --debug\n\t   Turn on debug output, meaning various information important to the\n\t   developers of Wget if it does not work properly.  Your system\n\t   administrator may have chosen to compile Wget without debug\n\t   support, in which case -d will not work.  Please note that\n\t   compiling with debug support is always safe---Wget compiled with\n\t   the debug support will not print any debug info unless requested\n\t   with -d.\n\n       -q\n       --quiet\n\t   Turn off Wget's output.\n\n       -v\n       --verbose\n\t   Turn on verbose output, with all the available data.  The default\n\t   output is verbose.\n\n       -nv\n       --no-verbose\n\t   Turn off verbose without being completely quiet (use -q for that),\n\t   which means that error messages and basic information still get\n\t   printed.\n\n       --report-speed=type\n\t   Output bandwidth as type.  The only accepted value is bits.\n\n       -i file\n       --input-file=file\n\t   Read URLs from a local or external file.  If - is specified as\n\t   file, URLs are read from the standard input.  (Use ./- to read from\n\t   a file literally named -.)\n\n\t   If this function is used, no URLs need be present on the command\n\t   line.  If there are URLs both on the command line and in an input\n\t   file, those on the command lines will be the first ones to be\n\t   retrieved.  If --force-html is not specified, then file should\n\t   consist of a series of URLs, one per line.\n\n\t   However, if you specify --force-html, the document will be regarded\n\t   as html.  In that case you may have problems with relative links,\n\t   which you can solve either by adding \"<base href=\"url\">\" to the\n\t   documents or by specifying --base=url on the command line.\n\n\t   If the file is an external one, the document will be automatically\n\t   treated as html if the Content-Type matches text/html.\n\t   Furthermore, the file's location will be implicitly used as base\n\t   href if none was specified.\n\n\t   If the file is a local file, on systems that support it, it will be\n\t   opened with the \"O_NONBLOCK\" flag to allow non-blocking reads from\n\t   the file. Wget will attempt to continue reading from the file until\n\t   EOF is reached or it is closed. This allows one to stream a list of\n\t   files for retrieval where the list is dynamically generated during\n\t   the execution of the process. Currently, this feature is not\n\t   available on Windows platforms.\n\n       --input-metalink=file\n\t   Downloads files covered in local Metalink file. Metalink version 3\n\t   and 4 are supported.\n\n       --keep-badhash\n\t   Keeps downloaded Metalink's files with a bad hash. It appends\n\t   .badhash to the name of Metalink's files which have a checksum\n\t   mismatch, except without overwriting existing files.\n\n       --metalink-over-http\n\t   Issues HTTP HEAD request instead of GET and extracts Metalink\n\t   metadata from response headers. Then it switches to Metalink\n\t   download.  If no valid Metalink metadata is found, it falls back to\n\t   ordinary HTTP download.  Enables Content-Type:\n\t   application/metalink4+xml files download/processing.\n\n       --metalink-index=number\n\t   Set the Metalink application/metalink4+xml metaurl ordinal NUMBER.\n\t   From 1 to the total number of \"application/metalink4+xml\"\n\t   available.  Specify 0 or inf to choose the first good one.\n\t   Metaurls, such as those from a --metalink-over-http, may have been\n\t   sorted by priority key's value; keep this in mind to choose the\n\t   right NUMBER.\n\n       --preferred-location\n\t   Set preferred location for Metalink resources. This has effect if\n\t   multiple resources with same priority are available.\n\n       --xattr\n\t   Enable use of file system's extended attributes to save the\n\t   original URL and the Referer HTTP header value if used.\n\n\t   Be aware that the URL might contain private information like access\n\t   tokens or credentials.\n\n       -F\n       --force-html\n\t   When input is read from a file, force it to be treated as an HTML\n\t   file.  This enables you to retrieve relative links from existing\n\t   HTML files on your local disk, by adding \"<base href=\"url\">\" to\n\t   HTML, or using the --base command-line option.\n\n       -B URL\n       --base=URL\n\t   Resolves relative links using URL as the point of reference, when\n\t   reading links from an HTML file specified via the -i/--input-file\n\t   option (together with --force-html, or when the input file was\n\t   fetched remotely from a server describing it as HTML). This is\n\t   equivalent to the presence of a \"BASE\" tag in the HTML input file,\n\t   with URL as the value for the \"href\" attribute.\n\n\t   For instance, if you specify http://foo/bar/a.html for URL, and\n\t   Wget reads ../baz/b.html from the input file, it would be resolved\n\t   to http://foo/baz/b.html.\n\n       --config=FILE\n\t   Specify the location of a startup file you wish to use instead of\n\t   the default one(s). Use --no-config to disable reading of config\n\t   files.  If both --config and --no-config are given, --no-config is\n\t   ignored.\n\n       --rejected-log=logfile\n\t   Logs all URL rejections to logfile as comma separated values.  The\n\t   values include the reason of rejection, the URL and the parent URL\n\t   it was found in.\n",
        "       --bind-address=ADDRESS\n\t   When making client TCP/IP connections, bind to ADDRESS on the local\n\t   machine.  ADDRESS may be specified as a hostname or IP address.\n\t   This option can be useful if your machine is bound to multiple IPs.\n\n       --bind-dns-address=ADDRESS\n\t   [libcares only] This address overrides the route for DNS requests.\n\t   If you ever need to circumvent the standard settings from\n\t   /etc/resolv.conf, this option together with --dns-servers is your\n\t   friend.  ADDRESS must be specified either as IPv4 or IPv6 address.\n\t   Wget needs to be built with libcares for this option to be\n\t   available.\n\n       --dns-servers=ADDRESSES\n\t   [libcares only] The given address(es) override the standard\n\t   nameserver addresses,  e.g. as configured in /etc/resolv.conf.\n\t   ADDRESSES may be specified either as IPv4 or IPv6 addresses, comma-\n\t   separated.  Wget needs to be built with libcares for this option to\n\t   be available.\n\n       -t number\n       --tries=number\n\t   Set number of tries to number. Specify 0 or inf for infinite\n\t   retrying.  The default is to retry 20 times, with the exception of\n\t   fatal errors like \"connection refused\" or \"not found\" (404), which\n\t   are not retried.\n\n       -O file\n       --output-document=file\n\t   The documents will not be written to the appropriate files, but all\n\t   will be concatenated together and written to file.  If - is used as\n\t   file, documents will be printed to standard output, disabling link\n\t   conversion.\t(Use ./- to print to a file literally named -.)\n\n\t   Use of -O is not intended to mean simply \"use the name file instead\n\t   of the one in the URL;\" rather, it is analogous to shell\n\t   redirection: wget -O file http://foo is intended to work like wget\n\t   -O - http://foo > file; file will be truncated immediately, and all\n\t   downloaded content will be written there.\n\n\t   For this reason, -N (for timestamp-checking) is not supported in\n\t   combination with -O: since file is always newly created, it will\n\t   always have a very new timestamp. A warning will be issued if this\n\t   combination is used.\n\n\t   Similarly, using -r or -p with -O may not work as you expect: Wget\n\t   won't just download the first file to file and then download the\n\t   rest to their normal names: all downloaded content will be placed\n\t   in file. This was disabled in version 1.11, but has been reinstated\n\t   (with a warning) in 1.11.2, as there are some cases where this\n\t   behavior can actually have some use.\n\n\t   A combination with -nc is only accepted if the given output file\n\t   does not exist.\n\n\t   Note that a combination with -k is only permitted when downloading\n\t   a single document, as in that case it will just convert all\n\t   relative URIs to external ones; -k makes no sense for multiple URIs\n\t   when they're all being downloaded to a single file; -k can be used\n\t   only when the output is a regular file.\n\n       -nc\n       --no-clobber\n\t   If a file is downloaded more than once in the same directory,\n\t   Wget's behavior depends on a few options, including -nc.  In\n\t   certain cases, the local file will be clobbered, or overwritten,\n\t   upon repeated download.  In other cases it will be preserved.\n\n\t   When running Wget without -N, -nc, -r, or -p, downloading the same\n\t   file in the same directory will result in the original copy of file\n\t   being preserved and the second copy being named file.1.  If that\n\t   file is downloaded yet again, the third copy will be named file.2,\n\t   and so on.  (This is also the behavior with -nd, even if -r or -p\n\t   are in effect.)  When -nc is specified, this behavior is\n\t   suppressed, and Wget will refuse to download newer copies of file.\n\t   Therefore, \"\"no-clobber\"\" is actually a misnomer in this\n\t   mode---it's not clobbering that's prevented (as the numeric\n\t   suffixes were already preventing clobbering), but rather the\n\t   multiple version saving that's prevented.\n\n\t   When running Wget with -r or -p, but without -N, -nd, or -nc, re-\n\t   downloading a file will result in the new copy simply overwriting\n\t   the old.  Adding -nc will prevent this behavior, instead causing\n\t   the original version to be preserved and any newer copies on the\n\t   server to be ignored.\n\n\t   When running Wget with -N, with or without -r or -p, the decision\n\t   as to whether or not to download a newer copy of a file depends on\n\t   the local and remote timestamp and size of the file.  -nc may not\n\t   be specified at the same time as -N.\n\n\t   A combination with -O/--output-document is only accepted if the\n\t   given output file does not exist.\n\n\t   Note that when -nc is specified, files with the suffixes .html or\n\t   .htm will be loaded from the local disk and parsed as if they had\n\t   been retrieved from the Web.\n\n       --backups=backups\n\t   Before (over)writing a file, back up an existing file by adding a\n\t   .1 suffix (_1 on VMS) to the file name.  Such backup files are\n\t   rotated to .2, .3, and so on, up to backups (and lost beyond that).\n\n       --no-netrc\n\t   Do not try to obtain credentials from .netrc file. By default\n\t   .netrc file is searched for credentials in case none have been\n\t   passed on command line and authentication is required.\n\n       -c\n       --continue\n\t   Continue getting a partially-downloaded file.  This is useful when\n\t   you want to finish up a download started by a previous instance of\n\t   Wget, or by another program.  For instance:\n\n\t\t   wget -c ftp://sunsite.doc.ic.ac.uk/ls-lR.Z\n\n\t   If there is a file named ls-lR.Z in the current directory, Wget\n\t   will assume that it is the first portion of the remote file, and\n\t   will ask the server to continue the retrieval from an offset equal\n\t   to the length of the local file.\n\n\t   Note that you don't need to specify this option if you just want\n\t   the current invocation of Wget to retry downloading a file should\n\t   the connection be lost midway through.  This is the default\n\t   behavior.  -c only affects resumption of downloads started prior to\n\t   this invocation of Wget, and whose local files are still sitting\n\t   around.\n\n\t   Without -c, the previous example would just download the remote\n\t   file to ls-lR.Z.1, leaving the truncated ls-lR.Z file alone.\n\n\t   If you use -c on a non-empty file, and the server does not support\n\t   continued downloading, Wget will restart the download from scratch\n\t   and overwrite the existing file entirely.\n\n\t   Beginning with Wget 1.7, if you use -c on a file which is of equal\n\t   size as the one on the server, Wget will refuse to download the\n\t   file and print an explanatory message.  The same happens when the\n\t   file is smaller on the server than locally (presumably because it\n\t   was changed on the server since your last download\n\t   attempt)---because \"continuing\" is not meaningful, no download\n\t   occurs.\n\n\t   On the other side of the coin, while using -c, any file that's\n\t   bigger on the server than locally will be considered an incomplete\n\t   download and only \"(length(remote) - length(local))\" bytes will be\n\t   downloaded and tacked onto the end of the local file.  This\n\t   behavior can be desirable in certain cases---for instance, you can\n\t   use wget -c to download just the new portion that's been appended\n\t   to a data collection or log file.\n\n\t   However, if the file is bigger on the server because it's been\n\t   changed, as opposed to just appended to, you'll end up with a\n\t   garbled file.  Wget has no way of verifying that the local file is\n\t   really a valid prefix of the remote file.  You need to be\n\t   especially careful of this when using -c in conjunction with -r,\n\t   since every file will be considered as an \"incomplete download\"\n\t   candidate.\n\n\t   Another instance where you'll get a garbled file if you try to use\n\t   -c is if you have a lame HTTP proxy that inserts a \"transfer\n\t   interrupted\" string into the local file.  In the future a\n\t   \"rollback\" option may be added to deal with this case.\n\n\t   Note that -c only works with FTP servers and with HTTP servers that\n\t   support the \"Range\" header.\n\n       --start-pos=OFFSET\n\t   Start downloading at zero-based position OFFSET.  Offset may be\n\t   expressed in bytes, kilobytes with the `k' suffix, or megabytes\n\t   with the `m' suffix, etc.\n\n\t   --start-pos has higher precedence over --continue.  When\n\t   --start-pos and --continue are both specified, wget will emit a\n\t   warning then proceed as if --continue was absent.\n\n\t   Server support for continued download is required, otherwise\n\t   --start-pos cannot help.  See -c for details.\n\n       --progress=type\n\t   Select the type of the progress indicator you wish to use.  Legal\n\t   indicators are \"dot\" and \"bar\".\n\n\t   The \"bar\" indicator is used by default.  It draws an ASCII progress\n\t   bar graphics (a.k.a \"thermometer\" display) indicating the status of\n\t   retrieval.  If the output is not a TTY, the \"dot\" bar will be used\n\t   by default.\n\n\t   Use --progress=dot to switch to the \"dot\" display.  It traces the\n\t   retrieval by printing dots on the screen, each dot representing a\n\t   fixed amount of downloaded data.\n\n\t   The progress type can also take one or more parameters.  The\n\t   parameters vary based on the type selected.\tParameters to type are\n\t   passed by appending them to the type sperated by a colon (:) like\n\t   this: --progress=type:parameter1:parameter2.\n\n\t   When using the dotted retrieval, you may set the style by\n\t   specifying the type as dot:style.  Different styles assign\n\t   different meaning to one dot.  With the \"default\" style each dot\n\t   represents 1K, there are ten dots in a cluster and 50 dots in a\n\t   line.  The \"binary\" style has a more \"computer\"-like\n\t   orientation---8K dots, 16-dots clusters and 48 dots per line (which\n\t   makes for 384K lines).  The \"mega\" style is suitable for\n\t   downloading large files---each dot represents 64K retrieved, there\n\t   are eight dots in a cluster, and 48 dots on each line (so each line\n\t   contains 3M).  If \"mega\" is not enough then you can use the \"giga\"\n\t   style---each dot represents 1M retrieved, there are eight dots in a\n\t   cluster, and 32 dots on each line (so each line contains 32M).\n\n\t   With --progress=bar, there are currently two possible parameters,\n\t   force and noscroll.\n\n\t   When the output is not a TTY, the progress bar always falls back to\n\t   \"dot\", even if --progress=bar was passed to Wget during invocation.\n\t   This behaviour can be overridden and the \"bar\" output forced by\n\t   using the \"force\" parameter as --progress=bar:force.\n\n\t   By default, the bar style progress bar scroll the name of the file\n\t   from left to right for the file being downloaded if the filename\n\t   exceeds the maximum length allotted for its display.  In certain\n\t   cases, such as with --progress=bar:force, one may not want the\n\t   scrolling filename in the progress bar.  By passing the \"noscroll\"\n\t   parameter, Wget can be forced to display as much of the filename as\n\t   possible without scrolling through it.\n\n\t   Note that you can set the default style using the \"progress\"\n\t   command in .wgetrc.\tThat setting may be overridden from the\n\t   command line.  For example, to force the bar output without\n\t   scrolling, use --progress=bar:force:noscroll.\n\n       --show-progress\n\t   Force wget to display the progress bar in any verbosity.\n\n\t   By default, wget only displays the progress bar in verbose mode.\n\t   One may however, want wget to display the progress bar on screen in\n\t   conjunction with any other verbosity modes like --no-verbose or\n\t   --quiet.  This is often a desired a property when invoking wget to\n\t   download several small/large files.\tIn such a case, wget could\n\t   simply be invoked with this parameter to get a much cleaner output\n\t   on the screen.\n\n\t   This option will also force the progress bar to be printed to\n\t   stderr when used alongside the --output-file option.\n\n       -N\n       --timestamping\n\t   Turn on time-stamping.\n\n       --no-if-modified-since\n\t   Do not send If-Modified-Since header in -N mode. Send preliminary\n\t   HEAD request instead. This has only effect in -N mode.\n\n       --no-use-server-timestamps\n\t   Don't set the local file's timestamp by the one on the server.\n\n\t   By default, when a file is downloaded, its timestamps are set to\n\t   match those from the remote file. This allows the use of\n\t   --timestamping on subsequent invocations of wget. However, it is\n\t   sometimes useful to base the local file's timestamp on when it was\n\t   actually downloaded; for that purpose, the\n\t   --no-use-server-timestamps option has been provided.\n\n       -S\n       --server-response\n\t   Print the headers sent by HTTP servers and responses sent by FTP\n\t   servers.\n\n       --spider\n\t   When invoked with this option, Wget will behave as a Web spider,\n\t   which means that it will not download the pages, just check that\n\t   they are there.  For example, you can use Wget to check your\n\t   bookmarks:\n\n\t\t   wget --spider --force-html -i bookmarks.html\n\n\t   This feature needs much more work for Wget to get close to the\n\t   functionality of real web spiders.\n\n       -T seconds\n       --timeout=seconds\n\t   Set the network timeout to seconds seconds.\tThis is equivalent to\n\t   specifying --dns-timeout, --connect-timeout, and --read-timeout,\n\t   all at the same time.\n\n\t   When interacting with the network, Wget can check for timeout and\n\t   abort the operation if it takes too long.  This prevents anomalies\n\t   like hanging reads and infinite connects.  The only timeout enabled\n\t   by default is a 900-second read timeout.  Setting a timeout to 0\n\t   disables it altogether.  Unless you know what you are doing, it is\n\t   best not to change the default timeout settings.\n\n\t   All timeout-related options accept decimal values, as well as\n\t   subsecond values.  For example, 0.1 seconds is a legal (though\n\t   unwise) choice of timeout.  Subsecond timeouts are useful for\n\t   checking server response times or for testing network latency.\n\n       --dns-timeout=seconds\n\t   Set the DNS lookup timeout to seconds seconds.  DNS lookups that\n\t   don't complete within the specified time will fail.\tBy default,\n\t   there is no timeout on DNS lookups, other than that implemented by\n\t   system libraries.\n\n       --connect-timeout=seconds\n\t   Set the connect timeout to seconds seconds.\tTCP connections that\n\t   take longer to establish will be aborted.  By default, there is no\n\t   connect timeout, other than that implemented by system libraries.\n\n       --read-timeout=seconds\n\t   Set the read (and write) timeout to seconds seconds.  The \"time\" of\n\t   this timeout refers to idle time: if, at any point in the download,\n\t   no data is received for more than the specified number of seconds,\n\t   reading fails and the download is restarted.  This option does not\n\t   directly affect the duration of the entire download.\n\n\t   Of course, the remote server may choose to terminate the connection\n\t   sooner than this option requires.  The default read timeout is 900\n\t   seconds.\n\n       --limit-rate=amount\n\t   Limit the download speed to amount bytes per second.  Amount may be\n\t   expressed in bytes, kilobytes with the k suffix, or megabytes with\n\t   the m suffix.  For example, --limit-rate=20k will limit the\n\t   retrieval rate to 20KB/s.  This is useful when, for whatever\n\t   reason, you don't want Wget to consume the entire available\n\t   bandwidth.\n\n\t   This option allows the use of decimal numbers, usually in\n\t   conjunction with power suffixes; for example, --limit-rate=2.5k is\n\t   a legal value.\n\n\t   Note that Wget implements the limiting by sleeping the appropriate\n\t   amount of time after a network read that took less time than\n\t   specified by the rate.  Eventually this strategy causes the TCP\n\t   transfer to slow down to approximately the specified rate.\n\t   However, it may take some time for this balance to be achieved, so\n\t   don't be surprised if limiting the rate doesn't work well with very\n\t   small files.\n\n       -w seconds\n       --wait=seconds\n\t   Wait the specified number of seconds between the retrievals.  Use\n\t   of this option is recommended, as it lightens the server load by\n\t   making the requests less frequent.  Instead of in seconds, the time\n\t   can be specified in minutes using the \"m\" suffix, in hours using\n\t   \"h\" suffix, or in days using \"d\" suffix.\n\n\t   Specifying a large value for this option is useful if the network\n\t   or the destination host is down, so that Wget can wait long enough\n\t   to reasonably expect the network error to be fixed before the\n\t   retry.  The waiting interval specified by this function is\n\t   influenced by \"--random-wait\", which see.\n\n       --waitretry=seconds\n\t   If you don't want Wget to wait between every retrieval, but only\n\t   between retries of failed downloads, you can use this option.  Wget\n\t   will use linear backoff, waiting 1 second after the first failure\n\t   on a given file, then waiting 2 seconds after the second failure on\n\t   that file, up to the maximum number of seconds you specify.\n\n\t   By default, Wget will assume a value of 10 seconds.\n\n       --random-wait\n\t   Some web sites may perform log analysis to identify retrieval\n\t   programs such as Wget by looking for statistically significant\n\t   similarities in the time between requests. This option causes the\n\t   time between requests to vary between 0.5 and 1.5 * wait seconds,\n\t   where wait was specified using the --wait option, in order to mask\n\t   Wget's presence from such analysis.\n\n\t   A 2001 article in a publication devoted to development on a popular\n\t   consumer platform provided code to perform this analysis on the\n\t   fly.  Its author suggested blocking at the class C address level to\n\t   ensure automated retrieval programs were blocked despite changing\n\t   DHCP-supplied addresses.\n\n\t   The --random-wait option was inspired by this ill-advised\n\t   recommendation to block many unrelated users from a web site due to\n\t   the actions of one.\n\n       --no-proxy\n\t   Don't use proxies, even if the appropriate *_proxy environment\n\t   variable is defined.\n\n       -Q quota\n       --quota=quota\n\t   Specify download quota for automatic retrievals.  The value can be\n\t   specified in bytes (default), kilobytes (with k suffix), or\n\t   megabytes (with m suffix).\n\n\t   Note that quota will never affect downloading a single file.  So if\n\t   you specify wget -Q10k https://example.com/ls-lR.gz, all of the\n\t   ls-lR.gz will be downloaded.  The same goes even when several URLs\n\t   are specified on the command-line.  The quota is checked only at\n\t   the end of each downloaded file, so it will never result in a\n\t   partially downloaded file. Thus you may safely type wget -Q2m -i\n\t   sites---download will be aborted after the file that exhausts the\n\t   quota is completely downloaded.\n\n\t   Setting quota to 0 or to inf unlimits the download quota.\n\n       --no-dns-cache\n\t   Turn off caching of DNS lookups.  Normally, Wget remembers the IP\n\t   addresses it looked up from DNS so it doesn't have to repeatedly\n\t   contact the DNS server for the same (typically small) set of hosts\n\t   it retrieves from.  This cache exists in memory only; a new Wget\n\t   run will contact DNS again.\n\n\t   However, it has been reported that in some situations it is not\n\t   desirable to cache host names, even for the duration of a short-\n\t   running application like Wget.  With this option Wget issues a new\n\t   DNS lookup (more precisely, a new call to \"gethostbyname\" or\n\t   \"getaddrinfo\") each time it makes a new connection.\tPlease note\n\t   that this option will not affect caching that might be performed by\n\t   the resolving library or by an external caching layer, such as\n\t   NSCD.\n\n\t   If you don't understand exactly what this option does, you probably\n\t   won't need it.\n\n       --restrict-file-names=modes\n\t   Change which characters found in remote URLs must be escaped during\n\t   generation of local filenames.  Characters that are restricted by\n\t   this option are escaped, i.e. replaced with %HH, where HH is the\n\t   hexadecimal number that corresponds to the restricted character.\n\t   This option may also be used to force all alphabetical cases to be\n\t   either lower- or uppercase.\n\n\t   By default, Wget escapes the characters that are not valid or safe\n\t   as part of file names on your operating system, as well as control\n\t   characters that are typically unprintable.  This option is useful\n\t   for changing these defaults, perhaps because you are downloading to\n\t   a non-native partition, or because you want to disable escaping of\n\t   the control characters, or you want to further restrict characters\n\t   to only those in the ASCII range of values.\n\n\t   The modes are a comma-separated set of text values. The acceptable\n\t   values are unix, windows, nocontrol, ascii, lowercase, and\n\t   uppercase. The values unix and windows are mutually exclusive (one\n\t   will override the other), as are lowercase and uppercase. Those\n\t   last are special cases, as they do not change the set of characters\n\t   that would be escaped, but rather force local file paths to be\n\t   converted either to lower- or uppercase.\n\n\t   When \"unix\" is specified, Wget escapes the character / and the\n\t   control characters in the ranges 0--31 and 128--159.  This is the\n\t   default on Unix-like operating systems.\n\n\t   When \"windows\" is given, Wget escapes the characters \\, |, /, :, ?,\n\t   \", *, <, >, and the control characters in the ranges 0--31 and\n\t   128--159.  In addition to this, Wget in Windows mode uses + instead\n\t   of : to separate host and port in local file names, and uses @\n\t   instead of ? to separate the query portion of the file name from\n\t   the rest.  Therefore, a URL that would be saved as\n\t   www.xemacs.org:4300/search.pl?input=blah in Unix mode would be\n\t   saved as www.xemacs.org+4300/search.pl@input=blah in Windows mode.\n\t   This mode is the default on Windows.\n\n\t   If you specify nocontrol, then the escaping of the control\n\t   characters is also switched off. This option may make sense when\n\t   you are downloading URLs whose names contain UTF-8 characters, on a\n\t   system which can save and display filenames in UTF-8 (some possible\n\t   byte values used in UTF-8 byte sequences fall in the range of\n\t   values designated by Wget as \"controls\").\n\n\t   The ascii mode is used to specify that any bytes whose values are\n\t   outside the range of ASCII characters (that is, greater than 127)\n\t   shall be escaped. This can be useful when saving filenames whose\n\t   encoding does not match the one used locally.\n\n       -4\n       --inet4-only\n       -6\n       --inet6-only\n\t   Force connecting to IPv4 or IPv6 addresses.\tWith --inet4-only or\n\t   -4, Wget will only connect to IPv4 hosts, ignoring AAAA records in\n\t   DNS, and refusing to connect to IPv6 addresses specified in URLs.\n\t   Conversely, with --inet6-only or -6, Wget will only connect to IPv6\n\t   hosts and ignore A records and IPv4 addresses.\n\n\t   Neither options should be needed normally.  By default, an\n\t   IPv6-aware Wget will use the address family specified by the host's\n\t   DNS record.\tIf the DNS responds with both IPv4 and IPv6 addresses,\n\t   Wget will try them in sequence until it finds one it can connect\n\t   to.\t(Also see \"--prefer-family\" option described below.)\n\n\t   These options can be used to deliberately force the use of IPv4 or\n\t   IPv6 address families on dual family systems, usually to aid\n\t   debugging or to deal with broken network configuration.  Only one\n\t   of --inet6-only and --inet4-only may be specified at the same time.\n\t   Neither option is available in Wget compiled without IPv6 support.\n\n       --prefer-family=none/IPv4/IPv6\n\t   When given a choice of several addresses, connect to the addresses\n\t   with specified address family first.  The address order returned by\n\t   DNS is used without change by default.\n\n\t   This avoids spurious errors and connect attempts when accessing\n\t   hosts that resolve to both IPv6 and IPv4 addresses from IPv4\n\t   networks.  For example, www.kame.net resolves to\n\t   2001:200:0:8002:203:47ff:fea5:3085 and to 203.178.141.194.  When\n\t   the preferred family is \"IPv4\", the IPv4 address is used first;\n\t   when the preferred family is \"IPv6\", the IPv6 address is used\n\t   first; if the specified value is \"none\", the address order returned\n\t   by DNS is used without change.\n\n\t   Unlike -4 and -6, this option doesn't inhibit access to any address\n\t   family, it only changes the order in which the addresses are\n\t   accessed.  Also note that the reordering performed by this option\n\t   is stable---it doesn't affect order of addresses of the same\n\t   family.  That is, the relative order of all IPv4 addresses and of\n\t   all IPv6 addresses remains intact in all cases.\n\n       --retry-connrefused\n\t   Consider \"connection refused\" a transient error and try again.\n\t   Normally Wget gives up on a URL when it is unable to connect to the\n\t   site because failure to connect is taken as a sign that the server\n\t   is not running at all and that retries would not help.  This option\n\t   is for mirroring unreliable sites whose servers tend to disappear\n\t   for short periods of time.\n\n       --user=user\n       --password=password\n\t   Specify the username user and password password for both FTP and\n\t   HTTP file retrieval.  These parameters can be overridden using the\n\t   --ftp-user and --ftp-password options for FTP connections and the\n\t   --http-user and --http-password options for HTTP connections.\n\n       --ask-password\n\t   Prompt for a password for each connection established. Cannot be\n\t   specified when --password is being used, because they are mutually\n\t   exclusive.\n\n       --use-askpass=command\n\t   Prompt for a user and password using the specified command.\tIf no\n\t   command is specified then the command in the environment variable\n\t   WGET_ASKPASS is used.  If WGET_ASKPASS is not set then the command\n\t   in the environment variable SSH_ASKPASS is used.\n\n\t   You can set the default command for use-askpass in the .wgetrc.\n\t   That setting may be overridden from the command line.\n\n       --no-iri\n\t   Turn off internationalized URI (IRI) support. Use --iri to turn it\n\t   on. IRI support is activated by default.\n\n\t   You can set the default state of IRI support using the \"iri\"\n\t   command in .wgetrc. That setting may be overridden from the command\n\t   line.\n\n       --local-encoding=encoding\n\t   Force Wget to use encoding as the default system encoding. That\n\t   affects how Wget converts URLs specified as arguments from locale\n\t   to UTF-8 for IRI support.\n\n\t   Wget use the function \"nl_langinfo()\" and then the \"CHARSET\"\n\t   environment variable to get the locale. If it fails, ASCII is used.\n\n\t   You can set the default local encoding using the \"local_encoding\"\n\t   command in .wgetrc. That setting may be overridden from the command\n\t   line.\n\n       --remote-encoding=encoding\n\t   Force Wget to use encoding as the default remote server encoding.\n\t   That affects how Wget converts URIs found in files from remote\n\t   encoding to UTF-8 during a recursive fetch. This options is only\n\t   useful for IRI support, for the interpretation of non-ASCII\n\t   characters.\n\n\t   For HTTP, remote encoding can be found in HTTP \"Content-Type\"\n\t   header and in HTML \"Content-Type http-equiv\" meta tag.\n\n\t   You can set the default encoding using the \"remoteencoding\" command\n\t   in .wgetrc. That setting may be overridden from the command line.\n\n       --unlink\n\t   Force Wget to unlink file instead of clobbering existing file. This\n\t   option is useful for downloading to the directory with hardlinks.\n",
        "       -nd\n       --no-directories\n\t   Do not create a hierarchy of directories when retrieving\n\t   recursively.  With this option turned on, all files will get saved\n\t   to the current directory, without clobbering (if a name shows up\n\t   more than once, the filenames will get extensions .n).\n\n       -x\n       --force-directories\n\t   The opposite of -nd---create a hierarchy of directories, even if\n\t   one would not have been created otherwise.  E.g. wget -x\n\t   http://fly.srk.fer.hr/robots.txt will save the downloaded file to\n\t   fly.srk.fer.hr/robots.txt.\n\n       -nH\n       --no-host-directories\n\t   Disable generation of host-prefixed directories.  By default,\n\t   invoking Wget with -r http://fly.srk.fer.hr/ will create a\n\t   structure of directories beginning with fly.srk.fer.hr/.  This\n\t   option disables such behavior.\n\n       --protocol-directories\n\t   Use the protocol name as a directory component of local file names.\n\t   For example, with this option, wget -r http://host will save to\n\t   http/host/... rather than just to host/....\n\n       --cut-dirs=number\n\t   Ignore number directory components.\tThis is useful for getting a\n\t   fine-grained control over the directory where recursive retrieval\n\t   will be saved.\n\n\t   Take, for example, the directory at\n\t   ftp://ftp.xemacs.org/pub/xemacs/.  If you retrieve it with -r, it\n\t   will be saved locally under ftp.xemacs.org/pub/xemacs/.  While the\n\t   -nH option can remove the ftp.xemacs.org/ part, you are still stuck\n\t   with pub/xemacs.  This is where --cut-dirs comes in handy; it makes\n\t   Wget not \"see\" number remote directory components.  Here are\n\t   several examples of how --cut-dirs option works.\n\n\t\t   No options\t     -> ftp.xemacs.org/pub/xemacs/\n\t\t   -nH\t\t     -> pub/xemacs/\n\t\t   -nH --cut-dirs=1  -> xemacs/\n\t\t   -nH --cut-dirs=2  -> .\n\n\t\t   --cut-dirs=1      -> ftp.xemacs.org/xemacs/\n\t\t   ...\n\n\t   If you just want to get rid of the directory structure, this option\n\t   is similar to a combination of -nd and -P.  However, unlike -nd,\n\t   --cut-dirs does not lose with subdirectories---for instance, with\n\t   -nH --cut-dirs=1, a beta/ subdirectory will be placed to\n\t   xemacs/beta, as one would expect.\n\n       -P prefix\n       --directory-prefix=prefix\n\t   Set directory prefix to prefix.  The directory prefix is the\n\t   directory where all other files and subdirectories will be saved\n\t   to, i.e. the top of the retrieval tree.  The default is . (the\n\t   current directory).\n",
        "       --default-page=name\n\t   Use name as the default file name when it isn't known (i.e., for\n\t   URLs that end in a slash), instead of index.html.\n\n       -E\n       --adjust-extension\n\t   If a file of type application/xhtml+xml or text/html is downloaded\n\t   and the URL does not end with the regexp \\.[Hh][Tt][Mm][Ll]?, this\n\t   option will cause the suffix .html to be appended to the local\n\t   filename.  This is useful, for instance, when you're mirroring a\n\t   remote site that uses .asp pages, but you want the mirrored pages\n\t   to be viewable on your stock Apache server.\tAnother good use for\n\t   this is when you're downloading CGI-generated materials.  A URL\n\t   like http://site.com/article.cgi?25 will be saved as\n\t   article.cgi?25.html.\n\n\t   Note that filenames changed in this way will be re-downloaded every\n\t   time you re-mirror a site, because Wget can't tell that the local\n\t   X.html file corresponds to remote URL X (since it doesn't yet know\n\t   that the URL produces output of type text/html or\n\t   application/xhtml+xml.\n\n\t   As of version 1.12, Wget will also ensure that any downloaded files\n\t   of type text/css end in the suffix .css, and the option was renamed\n\t   from --html-extension, to better reflect its new behavior. The old\n\t   option name is still acceptable, but should now be considered\n\t   deprecated.\n\n\t   As of version 1.19.2, Wget will also ensure that any downloaded\n\t   files with a \"Content-Encoding\" of br, compress, deflate or gzip\n\t   end in the suffix .br, .Z, .zlib and .gz respectively.\n\n\t   At some point in the future, this option may well be expanded to\n\t   include suffixes for other types of content, including content\n\t   types that are not parsed by Wget.\n\n       --http-user=user\n       --http-password=password\n\t   Specify the username user and password password on an HTTP server.\n\t   According to the type of the challenge, Wget will encode them using\n\t   either the \"basic\" (insecure), the \"digest\", or the Windows \"NTLM\"\n\t   authentication scheme.\n\n\t   Another way to specify username and password is in the URL itself.\n\t   Either method reveals your password to anyone who bothers to run\n\t   \"ps\".  To prevent the passwords from being seen, use the\n\t   --use-askpass or store them in .wgetrc or .netrc, and make sure to\n\t   protect those files from other users with \"chmod\".  If the\n\t   passwords are really important, do not leave them lying in those\n\t   files either---edit the files and delete them after Wget has\n\t   started the download.\n\n       --no-http-keep-alive\n\t   Turn off the \"keep-alive\" feature for HTTP downloads.  Normally,\n\t   Wget asks the server to keep the connection open so that, when you\n\t   download more than one document from the same server, they get\n\t   transferred over the same TCP connection.  This saves time and at\n\t   the same time reduces the load on the server.\n\n\t   This option is useful when, for some reason, persistent (keep-\n\t   alive) connections don't work for you, for example due to a server\n\t   bug or due to the inability of server-side scripts to cope with the\n\t   connections.\n\n       --no-cache\n\t   Disable server-side cache.  In this case, Wget will send the remote\n\t   server appropriate directives (Cache-Control: no-cache and Pragma:\n\t   no-cache) to get the file from the remote service, rather than\n\t   returning the cached version. This is especially useful for\n\t   retrieving and flushing out-of-date documents on proxy servers.\n\n\t   Caching is allowed by default.\n\n       --no-cookies\n\t   Disable the use of cookies.\tCookies are a mechanism for\n\t   maintaining server-side state.  The server sends the client a\n\t   cookie using the \"Set-Cookie\" header, and the client responds with\n\t   the same cookie upon further requests.  Since cookies allow the\n\t   server owners to keep track of visitors and for sites to exchange\n\t   this information, some consider them a breach of privacy.  The\n\t   default is to use cookies; however, storing cookies is not on by\n\t   default.\n\n       --load-cookies file\n\t   Load cookies from file before the first HTTP retrieval.  file is a\n\t   textual file in the format originally used by Netscape's\n\t   cookies.txt file.\n\n\t   You will typically use this option when mirroring sites that\n\t   require that you be logged in to access some or all of their\n\t   content.  The login process typically works by the web server\n\t   issuing an HTTP cookie upon receiving and verifying your\n\t   credentials.  The cookie is then resent by the browser when\n\t   accessing that part of the site, and so proves your identity.\n\n\t   Mirroring such a site requires Wget to send the same cookies your\n\t   browser sends when communicating with the site.  This is achieved\n\t   by --load-cookies---simply point Wget to the location of the\n\t   cookies.txt file, and it will send the same cookies your browser\n\t   would send in the same situation.  Different browsers keep textual\n\t   cookie files in different locations:\n\n\t   \"Netscape 4.x.\"\n\t       The cookies are in ~/.netscape/cookies.txt.\n\n\t   \"Mozilla and Netscape 6.x.\"\n\t       Mozilla's cookie file is also named cookies.txt, located\n\t       somewhere under ~/.mozilla, in the directory of your profile.\n\t       The full path usually ends up looking somewhat like\n\t       ~/.mozilla/default/some-weird-string/cookies.txt.\n\n\t   \"Internet Explorer.\"\n\t       You can produce a cookie file Wget can use by using the File\n\t       menu, Import and Export, Export Cookies.  This has been tested\n\t       with Internet Explorer 5; it is not guaranteed to work with\n\t       earlier versions.\n\n\t   \"Other browsers.\"\n\t       If you are using a different browser to create your cookies,\n\t       --load-cookies will only work if you can locate or produce a\n\t       cookie file in the Netscape format that Wget expects.\n\n\t   If you cannot use --load-cookies, there might still be an\n\t   alternative.  If your browser supports a \"cookie manager\", you can\n\t   use it to view the cookies used when accessing the site you're\n\t   mirroring.  Write down the name and value of the cookie, and\n\t   manually instruct Wget to send those cookies, bypassing the\n\t   \"official\" cookie support:\n\n\t\t   wget --no-cookies --header \"Cookie: <name>=<value>\"\n\n       --save-cookies file\n\t   Save cookies to file before exiting.  This will not save cookies\n\t   that have expired or that have no expiry time (so-called \"session\n\t   cookies\"), but also see --keep-session-cookies.\n\n       --keep-session-cookies\n\t   When specified, causes --save-cookies to also save session cookies.\n\t   Session cookies are normally not saved because they are meant to be\n\t   kept in memory and forgotten when you exit the browser.  Saving\n\t   them is useful on sites that require you to log in or to visit the\n\t   home page before you can access some pages.\tWith this option,\n\t   multiple Wget runs are considered a single browser session as far\n\t   as the site is concerned.\n\n\t   Since the cookie file format does not normally carry session\n\t   cookies, Wget marks them with an expiry timestamp of 0.  Wget's\n\t   --load-cookies recognizes those as session cookies, but it might\n\t   confuse other browsers.  Also note that cookies so loaded will be\n\t   treated as other session cookies, which means that if you want\n\t   --save-cookies to preserve them again, you must use\n\t   --keep-session-cookies again.\n\n       --ignore-length\n\t   Unfortunately, some HTTP servers (CGI programs, to be more precise)\n\t   send out bogus \"Content-Length\" headers, which makes Wget go wild,\n\t   as it thinks not all the document was retrieved.  You can spot this\n\t   syndrome if Wget retries getting the same document again and again,\n\t   each time claiming that the (otherwise normal) connection has\n\t   closed on the very same byte.\n\n\t   With this option, Wget will ignore the \"Content-Length\" header---as\n\t   if it never existed.\n\n       --header=header-line\n\t   Send header-line along with the rest of the headers in each HTTP\n\t   request.  The supplied header is sent as-is, which means it must\n\t   contain name and value separated by colon, and must not contain\n\t   newlines.\n\n\t   You may define more than one additional header by specifying\n\t   --header more than once.\n\n\t\t   wget --header='Accept-Charset: iso-8859-2' \\",
        "\t\t\t  http://fly.srk.fer.hr/\n\n\t   Specification of an empty string as the header value will clear all\n\t   previous user-defined headers.\n\n\t   As of Wget 1.10, this option can be used to override headers\n\t   otherwise generated automatically.  This example instructs Wget to\n\t   connect to localhost, but to specify foo.bar in the \"Host\" header:\n\n\t\t   wget --header=\"Host: foo.bar\" http://localhost/\n\n\t   In versions of Wget prior to 1.10 such use of --header caused\n\t   sending of duplicate headers.\n\n       --compression=type\n\t   Choose the type of compression to be used.  Legal values are auto,\n\t   gzip and none.\n\n\t   If auto or gzip are specified, Wget asks the server to compress the\n\t   file using the gzip compression format. If the server compresses\n\t   the file and responds with the \"Content-Encoding\" header field set\n\t   appropriately, the file will be decompressed automatically.\n\n\t   If none is specified, wget will not ask the server to compress the\n\t   file and will not decompress any server responses. This is the\n\t   default.\n\n\t   Compression support is currently experimental. In case it is turned\n\t   on, please report any bugs to \"bug-wget@gnu.org\".\n\n       --max-redirect=number\n\t   Specifies the maximum number of redirections to follow for a\n\t   resource.  The default is 20, which is usually far more than\n\t   necessary. However, on those occasions where you want to allow more\n\t   (or fewer), this is the option to use.\n\n       --proxy-user=user\n       --proxy-password=password\n\t   Specify the username user and password password for authentication\n\t   on a proxy server.  Wget will encode them using the \"basic\"\n\t   authentication scheme.\n\n\t   Security considerations similar to those with --http-password\n\t   pertain here as well.\n\n       --referer=url\n\t   Include `Referer: url' header in HTTP request.  Useful for\n\t   retrieving documents with server-side processing that assume they\n\t   are always being retrieved by interactive web browsers and only\n\t   come out properly when Referer is set to one of the pages that\n\t   point to them.\n\n       --save-headers\n\t   Save the headers sent by the HTTP server to the file, preceding the\n\t   actual contents, with an empty line as the separator.\n\n       -U agent-string\n       --user-agent=agent-string\n\t   Identify as agent-string to the HTTP server.\n\n\t   The HTTP protocol allows the clients to identify themselves using a\n\t   \"User-Agent\" header field.  This enables distinguishing the WWW\n\t   software, usually for statistical purposes or for tracing of\n\t   protocol violations.  Wget normally identifies as Wget/version,\n\t   version being the current version number of Wget.\n\n\t   However, some sites have been known to impose the policy of\n\t   tailoring the output according to the \"User-Agent\"-supplied\n\t   information.  While this is not such a bad idea in theory, it has\n\t   been abused by servers denying information to clients other than\n\t   (historically) Netscape or, more frequently, Microsoft Internet\n\t   Explorer.  This option allows you to change the \"User-Agent\" line\n\t   issued by Wget.  Use of this option is discouraged, unless you\n\t   really know what you are doing.\n\n\t   Specifying empty user agent with --user-agent=\"\" instructs Wget not\n\t   to send the \"User-Agent\" header in HTTP requests.\n\n       --post-data=string\n       --post-file=file\n\t   Use POST as the method for all HTTP requests and send the specified\n\t   data in the request body.  --post-data sends string as data,\n\t   whereas --post-file sends the contents of file.  Other than that,\n\t   they work in exactly the same way. In particular, they both expect\n\t   content of the form \"key1=value1&key2=value2\", with percent-\n\t   encoding for special characters; the only difference is that one\n\t   expects its content as a command-line parameter and the other\n\t   accepts its content from a file. In particular, --post-file is not\n\t   for transmitting files as form attachments: those must appear as\n\t   \"key=value\" data (with appropriate percent-coding) just like\n\t   everything else. Wget does not currently support\n\t   \"multipart/form-data\" for transmitting POST data; only\n\t   \"application/x-www-form-urlencoded\". Only one of --post-data and\n\t   --post-file should be specified.\n\n\t   Please note that wget does not require the content to be of the\n\t   form \"key1=value1&key2=value2\", and neither does it test for it.\n\t   Wget will simply transmit whatever data is provided to it. Most\n\t   servers however expect the POST data to be in the above format when\n\t   processing HTML Forms.\n\n\t   When sending a POST request using the --post-file option, Wget\n\t   treats the file as a binary file and will send every character in\n\t   the POST request without stripping trailing newline or formfeed\n\t   characters. Any other control characters in the text will also be\n\t   sent as-is in the POST request.\n\n\t   Please be aware that Wget needs to know the size of the POST data\n\t   in advance.\tTherefore the argument to \"--post-file\" must be a\n\t   regular file; specifying a FIFO or something like /dev/stdin won't\n\t   work.  It's not quite clear how to work around this limitation\n\t   inherent in HTTP/1.0.  Although HTTP/1.1 introduces chunked\n\t   transfer that doesn't require knowing the request length in\n\t   advance, a client can't use chunked unless it knows it's talking to\n\t   an HTTP/1.1 server.\tAnd it can't know that until it receives a\n\t   response, which in turn requires the request to have been completed\n\t   -- a chicken-and-egg problem.\n\n\t   Note: As of version 1.15 if Wget is redirected after the POST\n\t   request is completed, its behaviour will depend on the response\n\t   code returned by the server.  In case of a 301 Moved Permanently,\n\t   302 Moved Temporarily or 307 Temporary Redirect, Wget will, in\n\t   accordance with RFC2616, continue to send a POST request.  In case\n\t   a server wants the client to change the Request method upon\n\t   redirection, it should send a 303 See Other response code.\n\n\t   This example shows how to log in to a server using POST and then\n\t   proceed to download the desired pages, presumably only accessible\n\t   to authorized users:\n\n\t\t   # Log in to the server.  This can be done only once.\n\t\t   wget --save-cookies cookies.txt \\",
        "\t\t   # Now grab the page or pages we care about.\n\t\t   wget --load-cookies cookies.txt \\",
        "\t   If the server is using session cookies to track user\n\t   authentication, the above will not work because --save-cookies will\n\t   not save them (and neither will browsers) and the cookies.txt file\n\t   will be empty.  In that case use --keep-session-cookies along with\n\t   --save-cookies to force saving of session cookies.\n\n       --method=HTTP-Method\n\t   For the purpose of RESTful scripting, Wget allows sending of other\n\t   HTTP Methods without the need to explicitly set them using\n\t   --header=Header-Line.  Wget will use whatever string is passed to\n\t   it after --method as the HTTP Method to the server.\n\n       --body-data=Data-String\n       --body-file=Data-File\n\t   Must be set when additional data needs to be sent to the server\n\t   along with the Method specified using --method.  --body-data sends\n\t   string as data, whereas --body-file sends the contents of file.\n\t   Other than that, they work in exactly the same way.\n\n\t   Currently, --body-file is not for transmitting files as a whole.\n\t   Wget does not currently support \"multipart/form-data\" for\n\t   transmitting data; only \"application/x-www-form-urlencoded\". In the\n\t   future, this may be changed so that wget sends the --body-file as a\n\t   complete file instead of sending its contents to the server. Please\n\t   be aware that Wget needs to know the contents of BODY Data in\n\t   advance, and hence the argument to --body-file should be a regular\n\t   file. See --post-file for a more detailed explanation.  Only one of\n\t   --body-data and --body-file should be specified.\n\n\t   If Wget is redirected after the request is completed, Wget will\n\t   suspend the current method and send a GET request till the\n\t   redirection is completed.  This is true for all redirection\n\t   response codes except 307 Temporary Redirect which is used to\n\t   explicitly specify that the request method should not change.\n\t   Another exception is when the method is set to \"POST\", in which\n\t   case the redirection rules specified under --post-data are\n\t   followed.\n\n       --content-disposition\n\t   If this is set to on, experimental (not fully-functional) support\n\t   for \"Content-Disposition\" headers is enabled. This can currently\n\t   result in extra round-trips to the server for a \"HEAD\" request, and\n\t   is known to suffer from a few bugs, which is why it is not\n\t   currently enabled by default.\n\n\t   This option is useful for some file-downloading CGI programs that\n\t   use \"Content-Disposition\" headers to describe what the name of a\n\t   downloaded file should be.\n\n\t   When combined with --metalink-over-http and --trust-server-names, a\n\t   Content-Type: application/metalink4+xml file is named using the\n\t   \"Content-Disposition\" filename field, if available.\n\n       --content-on-error\n\t   If this is set to on, wget will not skip the content when the\n\t   server responds with a http status code that indicates error.\n\n       --trust-server-names\n\t   If this is set, on a redirect, the local file name will be based on\n\t   the redirection URL.  By default the local file name is based on\n\t   the original URL.  When doing recursive retrieving this can be\n\t   helpful because in many web sites redirected URLs correspond to an\n\t   underlying file structure, while link URLs do not.\n\n       --auth-no-challenge\n\t   If this option is given, Wget will send Basic HTTP authentication\n\t   information (plaintext username and password) for all requests,\n\t   just like Wget 1.10.2 and prior did by default.\n\n\t   Use of this option is not recommended, and is intended only to\n\t   support some few obscure servers, which never send HTTP\n\t   authentication challenges, but accept unsolicited auth info, say,\n\t   in addition to form-based authentication.\n\n       --retry-on-host-error\n\t   Consider host errors, such as \"Temporary failure in name\n\t   resolution\", as non-fatal, transient errors.\n\n       --retry-on-http-error=code[,code,...]\n\t   Consider given HTTP response codes as non-fatal, transient errors.\n\t   Supply a comma-separated list of 3-digit HTTP response codes as\n\t   argument. Useful to work around special circumstances where retries\n\t   are required, but the server responds with an error code normally\n\t   not retried by Wget. Such errors might be 503 (Service Unavailable)\n\t   and 429 (Too Many Requests). Retries enabled by this option are\n\t   performed subject to the normal retry timing and retry count\n\t   limitations of Wget.\n\n\t   Using this option is intended to support special use cases only and\n\t   is generally not recommended, as it can force retries even in cases\n\t   where the server is actually trying to decrease its load. Please\n\t   use wisely and only if you know what you are doing.\n",
        "       To support encrypted HTTP (HTTPS) downloads, Wget must be compiled with\n       an external SSL library. The current default is GnuTLS.\tIn addition,\n       Wget also supports HSTS (HTTP Strict Transport Security).  If Wget is\n       compiled without SSL support, none of these options are available.\n\n       --secure-protocol=protocol\n\t   Choose the secure protocol to be used.  Legal values are auto,\n\t   SSLv2, SSLv3, TLSv1, TLSv1_1, TLSv1_2, TLSv1_3 and PFS.  If auto is\n\t   used, the SSL library is given the liberty of choosing the\n\t   appropriate protocol automatically, which is achieved by sending a\n\t   TLSv1 greeting. This is the default.\n\n\t   Specifying SSLv2, SSLv3, TLSv1, TLSv1_1, TLSv1_2 or TLSv1_3 forces\n\t   the use of the corresponding protocol.  This is useful when talking\n\t   to old and buggy SSL server implementations that make it hard for\n\t   the underlying SSL library to choose the correct protocol version.\n\t   Fortunately, such servers are quite rare.\n\n\t   Specifying PFS enforces the use of the so-called Perfect Forward\n\t   Security cipher suites. In short, PFS adds security by creating a\n\t   one-time key for each SSL connection. It has a bit more CPU impact\n\t   on client and server.  We use known to be secure ciphers (e.g. no\n\t   MD4) and the TLS protocol. This mode also explicitly excludes non-\n\t   PFS key exchange methods, such as RSA.\n\n       --https-only\n\t   When in recursive mode, only HTTPS links are followed.\n\n       --ciphers\n\t   Set the cipher list string. Typically this string sets the cipher\n\t   suites and other SSL/TLS options that the user wish should be used,\n\t   in a set order of preference (GnuTLS calls it 'priority string').\n\t   This string will be fed verbatim to the SSL/TLS engine (OpenSSL or\n\t   GnuTLS) and hence its format and syntax is dependent on that. Wget\n\t   will not process or manipulate it in any way. Refer to the OpenSSL\n\t   or GnuTLS documentation for more information.\n\n       --no-check-certificate\n\t   Don't check the server certificate against the available\n\t   certificate authorities.  Also don't require the URL host name to\n\t   match the common name presented by the certificate.\n\n\t   As of Wget 1.10, the default is to verify the server's certificate\n\t   against the recognized certificate authorities, breaking the SSL\n\t   handshake and aborting the download if the verification fails.\n\t   Although this provides more secure downloads, it does break\n\t   interoperability with some sites that worked with previous Wget\n\t   versions, particularly those using self-signed, expired, or\n\t   otherwise invalid certificates.  This option forces an \"insecure\"\n\t   mode of operation that turns the certificate verification errors\n\t   into warnings and allows you to proceed.\n\n\t   If you encounter \"certificate verification\" errors or ones saying\n\t   that \"common name doesn't match requested host name\", you can use\n\t   this option to bypass the verification and proceed with the\n\t   download.  Only use this option if you are otherwise convinced of\n\t   the site's authenticity, or if you really don't care about the\n\t   validity of its certificate.  It is almost always a bad idea not to\n\t   check the certificates when transmitting confidential or important\n\t   data.  For self-signed/internal certificates, you should download\n\t   the certificate and verify against that instead of forcing this\n\t   insecure mode.  If you are really sure of not desiring any\n\t   certificate verification, you can specify --check-certificate=quiet\n\t   to tell wget to not print any warning about invalid certificates,\n\t   albeit in most cases this is the wrong thing to do.\n\n       --certificate=file\n\t   Use the client certificate stored in file.  This is needed for\n\t   servers that are configured to require certificates from the\n\t   clients that connect to them.  Normally a certificate is not\n\t   required and this switch is optional.\n\n       --certificate-type=type\n\t   Specify the type of the client certificate.\tLegal values are PEM\n\t   (assumed by default) and DER, also known as ASN1.\n\n       --private-key=file\n\t   Read the private key from file.  This allows you to provide the\n\t   private key in a file separate from the certificate.\n\n       --private-key-type=type\n\t   Specify the type of the private key.  Accepted values are PEM (the\n\t   default) and DER.\n\n       --ca-certificate=file\n\t   Use file as the file with the bundle of certificate authorities\n\t   (\"CA\") to verify the peers.\tThe certificates must be in PEM\n\t   format.\n\n\t   Without this option Wget looks for CA certificates at the system-\n\t   specified locations, chosen at OpenSSL installation time.\n\n       --ca-directory=directory\n\t   Specifies directory containing CA certificates in PEM format.  Each\n\t   file contains one CA certificate, and the file name is based on a\n\t   hash value derived from the certificate.  This is achieved by\n\t   processing a certificate directory with the \"c_rehash\" utility\n\t   supplied with OpenSSL.  Using --ca-directory is more efficient than\n\t   --ca-certificate when many certificates are installed because it\n\t   allows Wget to fetch certificates on demand.\n\n\t   Without this option Wget looks for CA certificates at the system-\n\t   specified locations, chosen at OpenSSL installation time.\n\n       --crl-file=file\n\t   Specifies a CRL file in file.  This is needed for certificates that\n\t   have been revocated by the CAs.\n\n       --pinnedpubkey=file/hashes\n\t   Tells wget to use the specified public key file (or hashes) to\n\t   verify the peer.  This can be a path to a file which contains a\n\t   single public key in PEM or DER format, or any number of base64\n\t   encoded sha256 hashes preceded by \"sha256//\" and separated by \";\"\n\n\t   When negotiating a TLS or SSL connection, the server sends a\n\t   certificate indicating its identity. A public key is extracted from\n\t   this certificate and if it does not exactly match the public key(s)\n\t   provided to this option, wget will abort the connection before\n\t   sending or receiving any data.\n\n       --random-file=file\n\t   [OpenSSL and LibreSSL only] Use file as the source of random data\n\t   for seeding the pseudo-random number generator on systems without\n\t   /dev/urandom.\n\n\t   On such systems the SSL library needs an external source of\n\t   randomness to initialize.  Randomness may be provided by EGD (see\n\t   --egd-file below) or read from an external source specified by the\n\t   user.  If this option is not specified, Wget looks for random data\n\t   in $RANDFILE or, if that is unset, in $HOME/.rnd.\n\n\t   If you're getting the \"Could not seed OpenSSL PRNG; disabling SSL.\"\n\t   error, you should provide random data using some of the methods\n\t   described above.\n\n       --egd-file=file\n\t   [OpenSSL only] Use file as the EGD socket.  EGD stands for Entropy\n\t   Gathering Daemon, a user-space program that collects data from\n\t   various unpredictable system sources and makes it available to\n\t   other programs that might need it.  Encryption software, such as\n\t   the SSL library, needs sources of non-repeating randomness to seed\n\t   the random number generator used to produce cryptographically\n\t   strong keys.\n\n\t   OpenSSL allows the user to specify his own source of entropy using\n\t   the \"RAND_FILE\" environment variable.  If this variable is unset,\n\t   or if the specified file does not produce enough randomness,\n\t   OpenSSL will read random data from EGD socket specified using this\n\t   option.\n\n\t   If this option is not specified (and the equivalent startup command\n\t   is not used), EGD is never contacted.  EGD is not needed on modern\n\t   Unix systems that support /dev/urandom.\n\n       --no-hsts\n\t   Wget supports HSTS (HTTP Strict Transport Security, RFC 6797) by\n\t   default.  Use --no-hsts to make Wget act as a non-HSTS-compliant\n\t   UA. As a consequence, Wget would ignore all the\n\t   \"Strict-Transport-Security\" headers, and would not enforce any\n\t   existing HSTS policy.\n\n       --hsts-file=file\n\t   By default, Wget stores its HSTS database in ~/.wget-hsts.  You can\n\t   use --hsts-file to override this. Wget will use the supplied file\n\t   as the HSTS database. Such file must conform to the correct HSTS\n\t   database format used by Wget. If Wget cannot parse the provided\n\t   file, the behaviour is unspecified.\n\n\t   The Wget's HSTS database is a plain text file. Each line contains\n\t   an HSTS entry (ie. a site that has issued a\n\t   \"Strict-Transport-Security\" header and that therefore has specified\n\t   a concrete HSTS policy to be applied). Lines starting with a dash\n\t   (\"#\") are ignored by Wget. Please note that in spite of this\n\t   convenient human-readability hand-hacking the HSTS database is\n\t   generally not a good idea.\n\n\t   An HSTS entry line consists of several fields separated by one or\n\t   more whitespace:\n\n\t   \"<hostname> SP [<port>] SP <include subdomains> SP <created> SP\n\t   <max-age>\"\n\n\t   The hostname and port fields indicate the hostname and port to\n\t   which the given HSTS policy applies. The port field may be zero,\n\t   and it will, in most of the cases. That means that the port number\n\t   will not be taken into account when deciding whether such HSTS\n\t   policy should be applied on a given request (only the hostname will\n\t   be evaluated). When port is different to zero, both the target\n\t   hostname and the port will be evaluated and the HSTS policy will\n\t   only be applied if both of them match. This feature has been\n\t   included for testing/development purposes only.  The Wget testsuite\n\t   (in testenv/) creates HSTS databases with explicit ports with the\n\t   purpose of ensuring Wget's correct behaviour. Applying HSTS\n\t   policies to ports other than the default ones is discouraged by RFC\n\t   6797 (see Appendix B \"Differences between HSTS Policy and Same-\n\t   Origin Policy\"). Thus, this functionality should not be used in\n\t   production environments and port will typically be zero. The last\n\t   three fields do what they are expected to. The field\n\t   include_subdomains can either be 1 or 0 and it signals whether the\n\t   subdomains of the target domain should be part of the given HSTS\n\t   policy as well. The created and max-age fields hold the timestamp\n\t   values of when such entry was created (first seen by Wget) and the\n\t   HSTS-defined value 'max-age', which states how long should that\n\t   HSTS policy remain active, measured in seconds elapsed since the\n\t   timestamp stored in created. Once that time has passed, that HSTS\n\t   policy will no longer be valid and will eventually be removed from\n\t   the database.\n\n\t   If you supply your own HSTS database via --hsts-file, be aware that\n\t   Wget may modify the provided file if any change occurs between the\n\t   HSTS policies requested by the remote servers and those in the\n\t   file. When Wget exits, it effectively updates the HSTS database by\n\t   rewriting the database file with the new entries.\n\n\t   If the supplied file does not exist, Wget will create one. This\n\t   file will contain the new HSTS entries. If no HSTS entries were\n\t   generated (no \"Strict-Transport-Security\" headers were sent by any\n\t   of the servers) then no file will be created, not even an empty\n\t   one. This behaviour applies to the default database file\n\t   (~/.wget-hsts) as well: it will not be created until some server\n\t   enforces an HSTS policy.\n\n\t   Care is taken not to override possible changes made by other Wget\n\t   processes at the same time over the HSTS database. Before dumping\n\t   the updated HSTS entries on the file, Wget will re-read it and\n\t   merge the changes.\n\n\t   Using a custom HSTS database and/or modifying an existing one is\n\t   discouraged.  For more information about the potential security\n\t   threats arose from such practice, see section 14 \"Security\n\t   Considerations\" of RFC 6797, specially section 14.9 \"Creative\n\t   Manipulation of HSTS Policy Store\".\n\n       --warc-file=file\n\t   Use file as the destination WARC file.\n\n       --warc-header=string\n\t   Use string into as the warcinfo record.\n\n       --warc-max-size=size\n\t   Set the maximum size of the WARC files to size.\n\n       --warc-cdx\n\t   Write CDX index files.\n\n       --warc-dedup=file\n\t   Do not store records listed in this CDX file.\n\n       --no-warc-compression\n\t   Do not compress WARC files with GZIP.\n\n       --no-warc-digests\n\t   Do not calculate SHA1 digests.\n\n       --no-warc-keep-log\n\t   Do not store the log file in a WARC record.\n\n       --warc-tempdir=dir\n\t   Specify the location for temporary files created by the WARC\n\t   writer.\n",
        "       --ftp-user=user\n       --ftp-password=password\n\t   Specify the username user and password password on an FTP server.\n\t   Without this, or the corresponding startup option, the password\n\t   defaults to -wget@, normally used for anonymous FTP.\n\n\t   Another way to specify username and password is in the URL itself.\n\t   Either method reveals your password to anyone who bothers to run\n\t   \"ps\".  To prevent the passwords from being seen, store them in\n\t   .wgetrc or .netrc, and make sure to protect those files from other\n\t   users with \"chmod\".\tIf the passwords are really important, do not\n\t   leave them lying in those files either---edit the files and delete\n\t   them after Wget has started the download.\n\n       --no-remove-listing\n\t   Don't remove the temporary .listing files generated by FTP\n\t   retrievals.\tNormally, these files contain the raw directory\n\t   listings received from FTP servers.\tNot removing them can be\n\t   useful for debugging purposes, or when you want to be able to\n\t   easily check on the contents of remote server directories (e.g. to\n\t   verify that a mirror you're running is complete).\n\n\t   Note that even though Wget writes to a known filename for this\n\t   file, this is not a security hole in the scenario of a user making\n\t   .listing a symbolic link to /etc/passwd or something and asking\n\t   \"root\" to run Wget in his or her directory.\tDepending on the\n\t   options used, either Wget will refuse to write to .listing, making\n\t   the globbing/recursion/time-stamping operation fail, or the\n\t   symbolic link will be deleted and replaced with the actual .listing\n\t   file, or the listing will be written to a .listing.number file.\n\n\t   Even though this situation isn't a problem, though, \"root\" should\n\t   never run Wget in a non-trusted user's directory.  A user could do\n\t   something as simple as linking index.html to /etc/passwd and asking\n\t   \"root\" to run Wget with -N or -r so the file will be overwritten.\n\n       --no-glob\n\t   Turn off FTP globbing.  Globbing refers to the use of shell-like\n\t   special characters (wildcards), like *, ?, [ and ] to retrieve more\n\t   than one file from the same directory at once, like:\n\n\t\t   wget ftp://gnjilux.srk.fer.hr/*.msg\n\n\t   By default, globbing will be turned on if the URL contains a\n\t   globbing character.\tThis option may be used to turn globbing on or\n\t   off permanently.\n\n\t   You may have to quote the URL to protect it from being expanded by\n\t   your shell.\tGlobbing makes Wget look for a directory listing,\n\t   which is system-specific.  This is why it currently works only with\n\t   Unix FTP servers (and the ones emulating Unix \"ls\" output).\n\n       --no-passive-ftp\n\t   Disable the use of the passive FTP transfer mode.  Passive FTP\n\t   mandates that the client connect to the server to establish the\n\t   data connection rather than the other way around.\n\n\t   If the machine is connected to the Internet directly, both passive\n\t   and active FTP should work equally well.  Behind most firewall and\n\t   NAT configurations passive FTP has a better chance of working.\n\t   However, in some rare firewall configurations, active FTP actually\n\t   works when passive FTP doesn't.  If you suspect this to be the\n\t   case, use this option, or set \"passive_ftp=off\" in your init file.\n\n       --preserve-permissions\n\t   Preserve remote file permissions instead of permissions set by\n\t   umask.\n\n       --retr-symlinks\n\t   By default, when retrieving FTP directories recursively and a\n\t   symbolic link is encountered, the symbolic link is traversed and\n\t   the pointed-to files are retrieved.\tCurrently, Wget does not\n\t   traverse symbolic links to directories to download them\n\t   recursively, though this feature may be added in the future.\n\n\t   When --retr-symlinks=no is specified, the linked-to file is not\n\t   downloaded.\tInstead, a matching symbolic link is created on the\n\t   local file system.  The pointed-to file will not be retrieved\n\t   unless this recursive retrieval would have encountered it\n\t   separately and downloaded it anyway.  This option poses a security\n\t   risk where a malicious FTP Server may cause Wget to write to files\n\t   outside of the intended directories through a specially crafted\n\t   .LISTING file.\n\n\t   Note that when retrieving a file (not a directory) because it was\n\t   specified on the command-line, rather than because it was recursed\n\t   to, this option has no effect.  Symbolic links are always traversed\n\t   in this case.\n",
        "       --ftps-implicit\n\t   This option tells Wget to use FTPS implicitly. Implicit FTPS\n\t   consists of initializing SSL/TLS from the very beginning of the\n\t   control connection. This option does not send an \"AUTH TLS\"\n\t   command: it assumes the server speaks FTPS and directly starts an\n\t   SSL/TLS connection. If the attempt is successful, the session\n\t   continues just like regular FTPS (\"PBSZ\" and \"PROT\" are sent,\n\t   etc.).  Implicit FTPS is no longer a requirement for FTPS\n\t   implementations, and thus many servers may not support it. If\n\t   --ftps-implicit is passed and no explicit port number specified,\n\t   the default port for implicit FTPS, 990, will be used, instead of\n\t   the default port for the \"normal\" (explicit) FTPS which is the same\n\t   as that of FTP, 21.\n\n       --no-ftps-resume-ssl\n\t   Do not resume the SSL/TLS session in the data channel. When\n\t   starting a data connection, Wget tries to resume the SSL/TLS\n\t   session previously started in the control connection.  SSL/TLS\n\t   session resumption avoids performing an entirely new handshake by\n\t   reusing the SSL/TLS parameters of a previous session. Typically,\n\t   the FTPS servers want it that way, so Wget does this by default.\n\t   Under rare circumstances however, one might want to start an\n\t   entirely new SSL/TLS session in every data connection.  This is\n\t   what --no-ftps-resume-ssl is for.\n\n       --ftps-clear-data-connection\n\t   All the data connections will be in plain text. Only the control\n\t   connection will be under SSL/TLS. Wget will send a \"PROT C\" command\n\t   to achieve this, which must be approved by the server.\n\n       --ftps-fallback-to-ftp\n\t   Fall back to FTP if FTPS is not supported by the target server. For\n\t   security reasons, this option is not asserted by default. The\n\t   default behaviour is to exit with an error.\tIf a server does not\n\t   successfully reply to the initial \"AUTH TLS\" command, or in the\n\t   case of implicit FTPS, if the initial SSL/TLS connection attempt is\n\t   rejected, it is considered that such server does not support FTPS.\n",
        "       -r\n       --recursive\n\t   Turn on recursive retrieving.    The default maximum depth is 5.\n\n       -l depth\n       --level=depth\n\t   Set the maximum number of subdirectories that Wget will recurse\n\t   into to depth.  In order to prevent one from accidentally\n\t   downloading very large websites when using recursion this is\n\t   limited to a depth of 5 by default, i.e., it will traverse at most\n\t   5 directories deep starting from the provided URL. Set -l 0 or -l\n\t   inf for infinite recursion depth.\n\n\t\t   wget -r -l 0 http://<site>/1.html\n\n\t   Ideally, one would expect this to download just 1.html.  but\n\t   unfortunately this is not the case, because -l 0 is equivalent to\n\t   -l inf---that is, infinite recursion.  To download a single HTML\n\t   page (or a handful of them), specify them all on the command line\n\t   and leave away -r and -l. To download the essential items to view a\n\t   single HTML page, see page requisites.\n\n       --delete-after\n\t   This option tells Wget to delete every single file it downloads,\n\t   after having done so.  It is useful for pre-fetching popular pages\n\t   through a proxy, e.g.:\n\n\t\t   wget -r -nd --delete-after http://whatever.com/~popular/page/\n\n\t   The -r option is to retrieve recursively, and -nd to not create\n\t   directories.\n\n\t   Note that --delete-after deletes files on the local machine.  It\n\t   does not issue the DELE command to remote FTP sites, for instance.\n\t   Also note that when --delete-after is specified, --convert-links is\n\t   ignored, so .orig files are simply not created in the first place.\n\n       -k\n       --convert-links\n\t   After the download is complete, convert the links in the document\n\t   to make them suitable for local viewing.  This affects not only the\n\t   visible hyperlinks, but any part of the document that links to\n\t   external content, such as embedded images, links to style sheets,\n\t   hyperlinks to non-HTML content, etc.\n\n\t   Each link will be changed in one of the two ways:\n\n\t      The links to files that have been downloaded by Wget will be\n\t       changed to refer to the file they point to as a relative link.\n\n\t       Example: if the downloaded file /foo/doc.html links to\n\t       /bar/img.gif, also downloaded, then the link in doc.html will\n\t       be modified to point to ../bar/img.gif.\tThis kind of\n\t       transformation works reliably for arbitrary combinations of\n\t       directories.\n\n\t      The links to files that have not been downloaded by Wget will\n\t       be changed to include host name and absolute path of the\n\t       location they point to.\n\n\t       Example: if the downloaded file /foo/doc.html links to\n\t       /bar/img.gif (or to ../bar/img.gif), then the link in doc.html\n\t       will be modified to point to http://hostname/bar/img.gif.\n\n\t   Because of this, local browsing works reliably: if a linked file\n\t   was downloaded, the link will refer to its local name; if it was\n\t   not downloaded, the link will refer to its full Internet address\n\t   rather than presenting a broken link.  The fact that the former\n\t   links are converted to relative links ensures that you can move the\n\t   downloaded hierarchy to another directory.\n\n\t   Note that only at the end of the download can Wget know which links\n\t   have been downloaded.  Because of that, the work done by -k will be\n\t   performed at the end of all the downloads.\n\n       --convert-file-only\n\t   This option converts only the filename part of the URLs, leaving\n\t   the rest of the URLs untouched. This filename part is sometimes\n\t   referred to as the \"basename\", although we avoid that term here in\n\t   order not to cause confusion.\n\n\t   It works particularly well in conjunction with --adjust-extension,\n\t   although this coupling is not enforced. It proves useful to\n\t   populate Internet caches with files downloaded from different\n\t   hosts.\n\n\t   Example: if some link points to //foo.com/bar.cgi?xyz with\n\t   --adjust-extension asserted and its local destination is intended\n\t   to be ./foo.com/bar.cgi?xyz.css, then the link would be converted\n\t   to //foo.com/bar.cgi?xyz.css. Note that only the filename part has\n\t   been modified. The rest of the URL has been left untouched,\n\t   including the net path (\"//\") which would otherwise be processed by\n\t   Wget and converted to the effective scheme (ie. \"http://\").\n\n       -K\n       --backup-converted\n\t   When converting a file, back up the original version with a .orig\n\t   suffix.  Affects the behavior of -N.\n\n       -m\n       --mirror\n\t   Turn on options suitable for mirroring.  This option turns on\n\t   recursion and time-stamping, sets infinite recursion depth and\n\t   keeps FTP directory listings.  It is currently equivalent to -r -N\n\t   -l inf --no-remove-listing.\n\n       -p\n       --page-requisites\n\t   This option causes Wget to download all the files that are\n\t   necessary to properly display a given HTML page.  This includes\n\t   such things as inlined images, sounds, and referenced stylesheets.\n\n\t   Ordinarily, when downloading a single HTML page, any requisite\n\t   documents that may be needed to display it properly are not\n\t   downloaded.\tUsing -r together with -l can help, but since Wget\n\t   does not ordinarily distinguish between external and inlined\n\t   documents, one is generally left with \"leaf documents\" that are\n\t   missing their requisites.\n\n\t   For instance, say document 1.html contains an \"<IMG>\" tag\n\t   referencing 1.gif and an \"<A>\" tag pointing to external document\n\t   2.html.  Say that 2.html is similar but that its image is 2.gif and\n\t   it links to 3.html.\tSay this continues up to some arbitrarily high\n\t   number.\n\n\t   If one executes the command:\n\n\t\t   wget -r -l 2 http://<site>/1.html\n\n\t   then 1.html, 1.gif, 2.html, 2.gif, and 3.html will be downloaded.\n\t   As you can see, 3.html is without its requisite 3.gif because Wget\n\t   is simply counting the number of hops (up to 2) away from 1.html in\n\t   order to determine where to stop the recursion.  However, with this\n\t   command:\n\n\t\t   wget -r -l 2 -p http://<site>/1.html\n\n\t   all the above files and 3.html's requisite 3.gif will be\n\t   downloaded.\tSimilarly,\n\n\t\t   wget -r -l 1 -p http://<site>/1.html\n\n\t   will cause 1.html, 1.gif, 2.html, and 2.gif to be downloaded.  One\n\t   might think that:\n\n\t\t   wget -r -l 0 -p http://<site>/1.html\n\n\t   would download just 1.html and 1.gif, but unfortunately this is not\n\t   the case, because -l 0 is equivalent to -l inf---that is, infinite\n\t   recursion.  To download a single HTML page (or a handful of them,\n\t   all specified on the command-line or in a -i URL input file) and\n\t   its (or their) requisites, simply leave off -r and -l:\n\n\t\t   wget -p http://<site>/1.html\n\n\t   Note that Wget will behave as if -r had been specified, but only\n\t   that single page and its requisites will be downloaded.  Links from\n\t   that page to external documents will not be followed.  Actually, to\n\t   download a single page and all its requisites (even if they exist\n\t   on separate websites), and make sure the lot displays properly\n\t   locally, this author likes to use a few options in addition to -p:\n\n\t\t   wget -E -H -k -K -p http://<site>/<document>\n\n\t   To finish off this topic, it's worth knowing that Wget's idea of an\n\t   external document link is any URL specified in an \"<A>\" tag, an\n\t   \"<AREA>\" tag, or a \"<LINK>\" tag other than \"<LINK\n\t   REL=\"stylesheet\">\".\n\n       --strict-comments\n\t   Turn on strict parsing of HTML comments.  The default is to\n\t   terminate comments at the first occurrence of -->.\n\n\t   According to specifications, HTML comments are expressed as SGML\n\t   declarations.  Declaration is special markup that begins with <!\n\t   and ends with >, such as <!DOCTYPE ...>, that may contain comments\n\t   between a pair of -- delimiters.  HTML comments are \"empty\n\t   declarations\", SGML declarations without any non-comment text.\n\t   Therefore, <!--foo--> is a valid comment, and so is <!--one--\n\t   --two-->, but <!--1--2--> is not.\n\n\t   On the other hand, most HTML writers don't perceive comments as\n\t   anything other than text delimited with <!-- and -->, which is not\n\t   quite the same.  For example, something like <!------------> works\n\t   as a valid comment as long as the number of dashes is a multiple of\n\t   four (!).  If not, the comment technically lasts until the next --,\n\t   which may be at the other end of the document.  Because of this,\n\t   many popular browsers completely ignore the specification and\n\t   implement what users have come to expect: comments delimited with\n\t   <!-- and -->.\n\n\t   Until version 1.9, Wget interpreted comments strictly, which\n\t   resulted in missing links in many web pages that displayed fine in\n\t   browsers, but had the misfortune of containing non-compliant\n\t   comments.  Beginning with version 1.9, Wget has joined the ranks of\n\t   clients that implements \"naive\" comments, terminating each comment\n\t   at the first occurrence of -->.\n\n\t   If, for whatever reason, you want strict comment parsing, use this\n\t   option to turn it on.\n",
        "       -A acclist --accept acclist\n       -R rejlist --reject rejlist\n\t   Specify comma-separated lists of file name suffixes or patterns to\n\t   accept or reject. Note that if any of the wildcard characters, *,\n\t   ?, [ or ], appear in an element of acclist or rejlist, it will be\n\t   treated as a pattern, rather than a suffix.\tIn this case, you have\n\t   to enclose the pattern into quotes to prevent your shell from\n\t   expanding it, like in -A \"*.mp3\" or -A '*.mp3'.\n\n       --accept-regex urlregex\n       --reject-regex urlregex\n\t   Specify a regular expression to accept or reject the complete URL.\n\n       --regex-type regextype\n\t   Specify the regular expression type.  Possible types are posix or\n\t   pcre.  Note that to be able to use pcre type, wget has to be\n\t   compiled with libpcre support.\n\n       -D domain-list\n       --domains=domain-list\n\t   Set domains to be followed.\tdomain-list is a comma-separated list\n\t   of domains.\tNote that it does not turn on -H.\n\n       --exclude-domains domain-list\n\t   Specify the domains that are not to be followed.\n\n       --follow-ftp\n\t   Follow FTP links from HTML documents.  Without this option, Wget\n\t   will ignore all the FTP links.\n\n       --follow-tags=list\n\t   Wget has an internal table of HTML tag / attribute pairs that it\n\t   considers when looking for linked documents during a recursive\n\t   retrieval.  If a user wants only a subset of those tags to be\n\t   considered, however, he or she should be specify such tags in a\n\t   comma-separated list with this option.\n\n       --ignore-tags=list\n\t   This is the opposite of the --follow-tags option.  To skip certain\n\t   HTML tags when recursively looking for documents to download,\n\t   specify them in a comma-separated list.\n\n\t   In the past, this option was the best bet for downloading a single\n\t   page and its requisites, using a command-line like:\n\n\t\t   wget --ignore-tags=a,area -H -k -K -r http://<site>/<document>\n\n\t   However, the author of this option came across a page with tags\n\t   like \"<LINK REL=\"home\" HREF=\"/\">\" and came to the realization that\n\t   specifying tags to ignore was not enough.  One can't just tell Wget\n\t   to ignore \"<LINK>\", because then stylesheets will not be\n\t   downloaded.\tNow the best bet for downloading a single page and its\n\t   requisites is the dedicated --page-requisites option.\n\n       --ignore-case\n\t   Ignore case when matching files and directories.  This influences\n\t   the behavior of -R, -A, -I, and -X options, as well as globbing\n\t   implemented when downloading from FTP sites.  For example, with\n\t   this option, -A \"*.txt\" will match file1.txt, but also file2.TXT,\n\t   file3.TxT, and so on.  The quotes in the example are to prevent the\n\t   shell from expanding the pattern.\n\n       -H\n       --span-hosts\n\t   Enable spanning across hosts when doing recursive retrieving.\n\n       -L\n       --relative\n\t   Follow relative links only.\tUseful for retrieving a specific home\n\t   page without any distractions, not even those from the same hosts.\n\n       -I list\n       --include-directories=list\n\t   Specify a comma-separated list of directories you wish to follow\n\t   when downloading.  Elements of list may contain wildcards.\n\n       -X list\n       --exclude-directories=list\n\t   Specify a comma-separated list of directories you wish to exclude\n\t   from download.  Elements of list may contain wildcards.\n\n       -np\n       --no-parent\n\t   Do not ever ascend to the parent directory when retrieving\n\t   recursively.  This is a useful option, since it guarantees that\n\t   only the files below a certain hierarchy will be downloaded.\n",
        "       Wget supports proxies for both HTTP and FTP retrievals.\tThe standard\n       way to specify proxy location, which Wget recognizes, is using the\n       following environment variables:\n\n       http_proxy\n       https_proxy\n\t   If set, the http_proxy and https_proxy variables should contain the\n\t   URLs of the proxies for HTTP and HTTPS connections respectively.\n\n       ftp_proxy\n\t   This variable should contain the URL of the proxy for FTP\n\t   connections.  It is quite common that http_proxy and ftp_proxy are\n\t   set to the same URL.\n\n       no_proxy\n\t   This variable should contain a comma-separated list of domain\n\t   extensions proxy should not be used for.  For instance, if the\n\t   value of no_proxy is .mit.edu, proxy will not be used to retrieve\n\t   documents from MIT.\n",
        "       Wget may return one of several error codes if it encounters problems.\n\n       0   No problems occurred.\n\n       1   Generic error code.\n\n       2   Parse error---for instance, when parsing command-line options, the\n\t   .wgetrc or .netrc...\n\n       3   File I/O error.\n\n       4   Network failure.\n\n       5   SSL verification failure.\n\n       6   Username/password authentication failure.\n\n       7   Protocol errors.\n\n       8   Server issued an error response.\n\n       With the exceptions of 0 and 1, the lower-numbered exit codes take\n       precedence over higher-numbered ones, when multiple types of errors are\n       encountered.\n\n       In versions of Wget prior to 1.12, Wget's exit status tended to be\n       unhelpful and inconsistent. Recursive downloads would virtually always\n       return 0 (success), regardless of any issues encountered, and non-\n       recursive fetches only returned the status corresponding to the most\n       recently-attempted download.\n",
        "       /usr/local/etc/wgetrc\n\t   Default location of the global startup file.\n\n       .wgetrc\n\t   User startup file.\n",
        "       You are welcome to submit bug reports via the GNU Wget bug tracker (see\n       <https://savannah.gnu.org/bugs/?func=additem&group=wget>) or to our\n       mailing list <bug-wget@gnu.org>.\n\n       Visit <https://lists.gnu.org/mailman/listinfo/bug-wget> to get more\n       info (how to subscribe, list archives, ...).\n\n       Before actually submitting a bug report, please try to follow a few\n       simple guidelines.\n\n       1.  Please try to ascertain that the behavior you see really is a bug.\n\t   If Wget crashes, it's a bug.  If Wget does not behave as\n\t   documented, it's a bug.  If things work strange, but you are not\n\t   sure about the way they are supposed to work, it might well be a\n\t   bug, but you might want to double-check the documentation and the\n\t   mailing lists.\n\n       2.  Try to repeat the bug in as simple circumstances as possible.  E.g.\n\t   if Wget crashes while downloading wget -rl0 -kKE -t5 --no-proxy\n\t   http://example.com -o /tmp/log, you should try to see if the crash\n\t   is repeatable, and if will occur with a simpler set of options.\n\t   You might even try to start the download at the page where the\n\t   crash occurred to see if that page somehow triggered the crash.\n\n\t   Also, while I will probably be interested to know the contents of\n\t   your .wgetrc file, just dumping it into the debug message is\n\t   probably a bad idea.  Instead, you should first try to see if the\n\t   bug repeats with .wgetrc moved out of the way.  Only if it turns\n\t   out that .wgetrc settings affect the bug, mail me the relevant\n\t   parts of the file.\n\n       3.  Please start Wget with -d option and send us the resulting output\n\t   (or relevant parts thereof).  If Wget was compiled without debug\n\t   support, recompile it---it is much easier to trace bugs with debug\n\t   support on.\n\n\t   Note: please make sure to remove any potentially sensitive\n\t   information from the debug log before sending it to the bug\n\t   address.  The \"-d\" won't go out of its way to collect sensitive\n\t   information, but the log will contain a fairly complete transcript\n\t   of Wget's communication with the server, which may include\n\t   passwords and pieces of downloaded data.  Since the bug address is\n\t   publicly archived, you may assume that all bug reports are visible\n\t   to the public.\n\n       4.  If Wget has crashed, try to run it in a debugger, e.g. \"gdb `which\n\t   wget` core\" and type \"where\" to get the backtrace.  This may not\n\t   work if the system administrator has disabled core files, but it is\n\t   safe to try.\n",
        "       This is not the complete manual for GNU Wget.  For more complete\n       information, including more detailed explanations of some of the\n       options, and a number of commands available for use with .wgetrc files\n       and the -e option, see the GNU Info entry for wget.\n\n       Also see wget2(1), the updated version of GNU Wget with even better\n       support for recursive downloading and modern protocols like HTTP/2.\n",
        "       Originally written by Hrvoje Niki <hniksic@xemacs.org>.  Currently\n       maintained by Darshit Shah <darnir@gnu.org> and Tim Rhsen\n       <tim.ruehsen@gmx.de>.\n",
        "       Copyright (c) 1996--2011, 2015, 2018--2024 Free Software Foundation,\n       Inc.\n\n       Permission is granted to copy, distribute and/or modify this document\n       under the terms of the GNU Free Documentation License, Version 1.3 or\n       any later version published by the Free Software Foundation; with no\n       Invariant Sections, with no Front-Cover Texts, and with no Back-Cover\n       Texts.  A copy of the license is included in the section entitled \"GNU\n       Free Documentation License\".\n"
      ]
    }
  ],
  "flags": [
    {
      "flag": "--version",
      "description": " Display the version of Wget.",
      "shortFlag": "-V"
    },
    {
      "flag": "--help",
      "description": " Print a help message describing all of Wget's command-line options.",
      "shortFlag": "-h"
    },
    {
      "flag": "--background",
      "description": " Go to background immediately after startup.\tIf no output file is specified via the -o, output is redirected to wget-log.",
      "shortFlag": "-b"
    },
    {
      "flag": "--execute",
      "description": "command Execute command as if it were a part of .wgetrc.  A command thus invoked will be executed after the commands in .wgetrc, thus taking precedence over them.  If you need to specify more than one wgetrc command, use multiple instances of -e. Logging and Input File Options",
      "shortFlag": "-e"
    },
    {
      "flag": "--output-file",
      "description": "=logfile Log all messages to logfile.  The messages are normally reported to standard error.",
      "shortFlag": "-o"
    },
    {
      "flag": "--append-output",
      "description": "=logfile Append to logfile.  This is the same as -o, only it appends to logfile instead of overwriting the old log file.  If logfile does not exist, a new file is created.",
      "shortFlag": "-a"
    },
    {
      "flag": "--debug",
      "description": " Turn on debug output, meaning various information important to the developers of Wget if it does not work properly.  Your system administrator may have chosen to compile Wget without debug support, in which case -d will not work.  Please note that compiling with debug support is always safe---Wget compiled with the debug support will not print any debug info unless requested with -d.",
      "shortFlag": "-d"
    },
    {
      "flag": "--quiet",
      "description": " Turn off Wget's output.",
      "shortFlag": "-q"
    },
    {
      "flag": "--verbose",
      "description": " Turn on verbose output, with all the available data.  The default output is verbose.",
      "shortFlag": "-v"
    },
    {
      "flag": "--no-verbose",
      "description": " Turn off verbose without being completely quiet (use -q for that), which means that error messages and basic information still get printed.",
      "shortFlag": "-nv"
    },
    {
      "flag": "--report-speed",
      "description": "=type Output bandwidth as type.  The only accepted value is bits."
    },
    {
      "flag": "--input-file",
      "description": "=file Read URLs from a local or external file.  If - is specified as file, URLs are read from the standard input.  (Use ./- to read from a file literally named -.) If this function is used, no URLs need be present on the command line.  If there are URLs both on the command line and in an input file, those on the command lines will be the first ones to be retrieved.  If --force-html is not specified, then file should consist of a series of URLs, one per line. However, if you specify --force-html, the document will be regarded as html.  In that case you may have problems with relative links, which you can solve either by adding \"<base href=\"url\">\" to the documents or by specifying --base=url on the command line. If the file is an external one, the document will be automatically treated as html if the Content-Type matches text/html. Furthermore, the file's location will be implicitly used as base href if none was specified. If the file is a local file, on systems that support it, it will be opened with the \"O_NONBLOCK\" flag to allow non-blocking reads from the file. Wget will attempt to continue reading from the file until EOF is reached or it is closed. This allows one to stream a list of files for retrieval where the list is dynamically generated during the execution of the process. Currently, this feature is not available on Windows platforms.",
      "shortFlag": "-i"
    },
    {
      "flag": "--input-metalink",
      "description": "=file Downloads files covered in local Metalink file. Metalink version 3 and 4 are supported."
    },
    {
      "flag": "--keep-badhash",
      "description": " Keeps downloaded Metalink's files with a bad hash. It appends .badhash to the name of Metalink's files which have a checksum mismatch, except without overwriting existing files."
    },
    {
      "flag": "--metalink-over-http",
      "description": " Issues HTTP HEAD request instead of GET and extracts Metalink metadata from response headers. Then it switches to Metalink download.  If no valid Metalink metadata is found, it falls back to ordinary HTTP download.  Enables Content-Type: application/metalink4+xml files download/processing."
    },
    {
      "flag": "--metalink-index",
      "description": "=number Set the Metalink application/metalink4+xml metaurl ordinal NUMBER. From 1 to the total number of \"application/metalink4+xml\" available.  Specify 0 or inf to choose the first good one. Metaurls, such as those from a --metalink-over-http, may have been sorted by priority key's value; keep this in mind to choose the right NUMBER."
    },
    {
      "flag": "--preferred-location",
      "description": " Set preferred location for Metalink resources. This has effect if multiple resources with same priority are available."
    },
    {
      "flag": "--xattr",
      "description": " Enable use of file system's extended attributes to save the original URL and the Referer HTTP header value if used. Be aware that the URL might contain private information like access tokens or credentials."
    },
    {
      "flag": "--force-html",
      "description": " When input is read from a file, force it to be treated as an HTML file.  This enables you to retrieve relative links from existing HTML files on your local disk, by adding \"<base href=\"url\">\" to HTML, or using the --base command-line option.",
      "shortFlag": "-F"
    },
    {
      "flag": "--base",
      "description": "=URL Resolves relative links using URL as the point of reference, when reading links from an HTML file specified via the -i/--input-file option (together with --force-html, or when the input file was fetched remotely from a server describing it as HTML). This is equivalent to the presence of a \"BASE\" tag in the HTML input file, with URL as the value for the \"href\" attribute. For instance, if you specify http://foo/bar/a.html for URL, and Wget reads ../baz/b.html from the input file, it would be resolved to http://foo/baz/b.html.",
      "shortFlag": "-B"
    },
    {
      "flag": "--config",
      "description": "=FILE Specify the location of a startup file you wish to use instead of the default one(s). Use --no-config to disable reading of config files.  If both --config and --no-config are given, --no-config is ignored."
    },
    {
      "flag": "--rejected-log",
      "description": "=logfile Logs all URL rejections to logfile as comma separated values.  The values include the reason of rejection, the URL and the parent URL it was found in. Download Options"
    },
    {
      "flag": "--bind-address",
      "description": "=ADDRESS When making client TCP/IP connections, bind to ADDRESS on the local machine.  ADDRESS may be specified as a hostname or IP address. This option can be useful if your machine is bound to multiple IPs."
    },
    {
      "flag": "--bind-dns-address",
      "description": "=ADDRESS [libcares only] This address overrides the route for DNS requests. If you ever need to circumvent the standard settings from /etc/resolv.conf, this option together with --dns-servers is your friend.  ADDRESS must be specified either as IPv4 or IPv6 address. Wget needs to be built with libcares for this option to be available."
    },
    {
      "flag": "--dns-servers",
      "description": "=ADDRESSES [libcares only] The given address(es) override the standard nameserver addresses,  e.g. as configured in /etc/resolv.conf. ADDRESSES may be specified either as IPv4 or IPv6 addresses, comma- separated.  Wget needs to be built with libcares for this option to be available."
    },
    {
      "flag": "--tries",
      "description": "=number Set number of tries to number. Specify 0 or inf for infinite retrying.  The default is to retry 20 times, with the exception of fatal errors like \"connection refused\" or \"not found\" (404), which are not retried.",
      "shortFlag": "-t"
    },
    {
      "flag": "--output-document",
      "description": "=file The documents will not be written to the appropriate files, but all will be concatenated together and written to file.  If - is used as file, documents will be printed to standard output, disabling link conversion.\t(Use ./- to print to a file literally named -.) Use of -O is not intended to mean simply \"use the name file instead of the one in the URL;\" rather, it is analogous to shell redirection: wget -O file http://foo is intended to work like wget",
      "shortFlag": "-O"
    },
    {
      "flag": "-O",
      "description": "- http://foo > file; file will be truncated immediately, and all downloaded content will be written there. For this reason, -N (for timestamp-checking) is not supported in combination with -O: since file is always newly created, it will always have a very new timestamp. A warning will be issued if this combination is used. Similarly, using -r or -p with -O may not work as you expect: Wget won't just download the first file to file and then download the rest to their normal names: all downloaded content will be placed in file. This was disabled in version 1.11, but has been reinstated (with a warning) in 1.11.2, as there are some cases where this behavior can actually have some use. A combination with -nc is only accepted if the given output file does not exist. Note that a combination with -k is only permitted when downloading a single document, as in that case it will just convert all relative URIs to external ones; -k makes no sense for multiple URIs when they're all being downloaded to a single file; -k can be used only when the output is a regular file."
    },
    {
      "flag": "--no-clobber",
      "description": " If a file is downloaded more than once in the same directory, Wget's behavior depends on a few options, including -nc.  In certain cases, the local file will be clobbered, or overwritten, upon repeated download.  In other cases it will be preserved. When running Wget without -N, -nc, -r, or -p, downloading the same file in the same directory will result in the original copy of file being preserved and the second copy being named file.1.  If that file is downloaded yet again, the third copy will be named file.2, and so on.  (This is also the behavior with -nd, even if -r or -p are in effect.)  When -nc is specified, this behavior is suppressed, and Wget will refuse to download newer copies of file. Therefore, \"\"no-clobber\"\" is actually a misnomer in this mode---it's not clobbering that's prevented (as the numeric suffixes were already preventing clobbering), but rather the multiple version saving that's prevented. When running Wget with -r or -p, but without -N, -nd, or -nc, re- downloading a file will result in the new copy simply overwriting the old.  Adding -nc will prevent this behavior, instead causing the original version to be preserved and any newer copies on the server to be ignored. When running Wget with -N, with or without -r or -p, the decision as to whether or not to download a newer copy of a file depends on the local and remote timestamp and size of the file.  -nc may not be specified at the same time as -N. A combination with -O/--output-document is only accepted if the given output file does not exist. Note that when -nc is specified, files with the suffixes .html or .htm will be loaded from the local disk and parsed as if they had been retrieved from the Web.",
      "shortFlag": "-nc"
    },
    {
      "flag": "--backups",
      "description": "=backups Before (over)writing a file, back up an existing file by adding a .1 suffix (_1 on VMS) to the file name.  Such backup files are rotated to .2, .3, and so on, up to backups (and lost beyond that)."
    },
    {
      "flag": "--no-netrc",
      "description": " Do not try to obtain credentials from .netrc file. By default .netrc file is searched for credentials in case none have been passed on command line and authentication is required."
    },
    {
      "flag": "--continue",
      "description": " Continue getting a partially-downloaded file.  This is useful when you want to finish up a download started by a previous instance of Wget, or by another program.  For instance: wget -c ftp://sunsite.doc.ic.ac.uk/ls-lR.Z If there is a file named ls-lR.Z in the current directory, Wget will assume that it is the first portion of the remote file, and will ask the server to continue the retrieval from an offset equal to the length of the local file. Note that you don't need to specify this option if you just want the current invocation of Wget to retry downloading a file should the connection be lost midway through.  This is the default behavior.  -c only affects resumption of downloads started prior to this invocation of Wget, and whose local files are still sitting around. Without -c, the previous example would just download the remote file to ls-lR.Z.1, leaving the truncated ls-lR.Z file alone. If you use -c on a non-empty file, and the server does not support continued downloading, Wget will restart the download from scratch and overwrite the existing file entirely. Beginning with Wget 1.7, if you use -c on a file which is of equal size as the one on the server, Wget will refuse to download the file and print an explanatory message.  The same happens when the file is smaller on the server than locally (presumably because it was changed on the server since your last download attempt)---because \"continuing\" is not meaningful, no download occurs. On the other side of the coin, while using -c, any file that's bigger on the server than locally will be considered an incomplete download and only \"(length(remote) - length(local))\" bytes will be downloaded and tacked onto the end of the local file.  This behavior can be desirable in certain cases---for instance, you can use wget -c to download just the new portion that's been appended to a data collection or log file. However, if the file is bigger on the server because it's been changed, as opposed to just appended to, you'll end up with a garbled file.  Wget has no way of verifying that the local file is really a valid prefix of the remote file.  You need to be especially careful of this when using -c in conjunction with -r, since every file will be considered as an \"incomplete download\" candidate. Another instance where you'll get a garbled file if you try to use",
      "shortFlag": "-c"
    },
    {
      "flag": "--start-pos",
      "description": "=OFFSET Start downloading at zero-based position OFFSET.  Offset may be expressed in bytes, kilobytes with the `k' suffix, or megabytes with the `m' suffix, etc.",
      "shortFlag": "-c"
    },
    {
      "flag": "--start-pos",
      "description": "has higher precedence over --continue.  When"
    },
    {
      "flag": "--start-pos",
      "description": "and --continue are both specified, wget will emit a warning then proceed as if --continue was absent. Server support for continued download is required, otherwise"
    },
    {
      "flag": "--start-pos",
      "description": "cannot help.  See -c for details."
    },
    {
      "flag": "--progress",
      "description": "=type Select the type of the progress indicator you wish to use.  Legal indicators are \"dot\" and \"bar\". The \"bar\" indicator is used by default.  It draws an ASCII progress bar graphics (a.k.a \"thermometer\" display) indicating the status of retrieval.  If the output is not a TTY, the \"dot\" bar will be used by default. Use --progress=dot to switch to the \"dot\" display.  It traces the retrieval by printing dots on the screen, each dot representing a fixed amount of downloaded data. The progress type can also take one or more parameters.  The parameters vary based on the type selected.\tParameters to type are passed by appending them to the type sperated by a colon (:) like this: --progress=type:parameter1:parameter2. When using the dotted retrieval, you may set the style by specifying the type as dot:style.  Different styles assign different meaning to one dot.  With the \"default\" style each dot represents 1K, there are ten dots in a cluster and 50 dots in a line.  The \"binary\" style has a more \"computer\"-like orientation---8K dots, 16-dots clusters and 48 dots per line (which makes for 384K lines).  The \"mega\" style is suitable for downloading large files---each dot represents 64K retrieved, there are eight dots in a cluster, and 48 dots on each line (so each line contains 3M).  If \"mega\" is not enough then you can use the \"giga\" style---each dot represents 1M retrieved, there are eight dots in a cluster, and 32 dots on each line (so each line contains 32M). With --progress=bar, there are currently two possible parameters, force and noscroll. When the output is not a TTY, the progress bar always falls back to \"dot\", even if --progress=bar was passed to Wget during invocation. This behaviour can be overridden and the \"bar\" output forced by using the \"force\" parameter as --progress=bar:force. By default, the bar style progress bar scroll the name of the file from left to right for the file being downloaded if the filename exceeds the maximum length allotted for its display.  In certain cases, such as with --progress=bar:force, one may not want the scrolling filename in the progress bar.  By passing the \"noscroll\" parameter, Wget can be forced to display as much of the filename as possible without scrolling through it. Note that you can set the default style using the \"progress\" command in .wgetrc.\tThat setting may be overridden from the command line.  For example, to force the bar output without scrolling, use --progress=bar:force:noscroll."
    },
    {
      "flag": "--show-progress",
      "description": " Force wget to display the progress bar in any verbosity. By default, wget only displays the progress bar in verbose mode. One may however, want wget to display the progress bar on screen in conjunction with any other verbosity modes like --no-verbose or"
    },
    {
      "flag": "--quiet",
      "description": ".  This is often a desired a property when invoking wget to download several small/large files.\tIn such a case, wget could simply be invoked with this parameter to get a much cleaner output on the screen. This option will also force the progress bar to be printed to stderr when used alongside the --output-file option."
    },
    {
      "flag": "--timestamping",
      "description": " Turn on time-stamping.",
      "shortFlag": "-N"
    },
    {
      "flag": "--no-if-modified-since",
      "description": " Do not send If-Modified-Since header in -N mode. Send preliminary HEAD request instead. This has only effect in -N mode."
    },
    {
      "flag": "--no-use-server-timestamps",
      "description": " Don't set the local file's timestamp by the one on the server. By default, when a file is downloaded, its timestamps are set to match those from the remote file. This allows the use of"
    },
    {
      "flag": "--timestamping",
      "description": "on subsequent invocations of wget. However, it is sometimes useful to base the local file's timestamp on when it was actually downloaded; for that purpose, the"
    },
    {
      "flag": "--no-use-server-timestamps",
      "description": "option has been provided."
    },
    {
      "flag": "--server-response",
      "description": " Print the headers sent by HTTP servers and responses sent by FTP servers.",
      "shortFlag": "-S"
    },
    {
      "flag": "--spider",
      "description": " When invoked with this option, Wget will behave as a Web spider, which means that it will not download the pages, just check that they are there.  For example, you can use Wget to check your bookmarks: wget --spider --force-html -i bookmarks.html This feature needs much more work for Wget to get close to the functionality of real web spiders."
    },
    {
      "flag": "--timeout",
      "description": "=seconds Set the network timeout to seconds seconds.\tThis is equivalent to specifying --dns-timeout, --connect-timeout, and --read-timeout, all at the same time. When interacting with the network, Wget can check for timeout and abort the operation if it takes too long.  This prevents anomalies like hanging reads and infinite connects.  The only timeout enabled by default is a 900-second read timeout.  Setting a timeout to 0 disables it altogether.  Unless you know what you are doing, it is best not to change the default timeout settings. All timeout-related options accept decimal values, as well as subsecond values.  For example, 0.1 seconds is a legal (though unwise) choice of timeout.  Subsecond timeouts are useful for checking server response times or for testing network latency.",
      "shortFlag": "-T"
    },
    {
      "flag": "--dns-timeout",
      "description": "=seconds Set the DNS lookup timeout to seconds seconds.  DNS lookups that don't complete within the specified time will fail.\tBy default, there is no timeout on DNS lookups, other than that implemented by system libraries."
    },
    {
      "flag": "--connect-timeout",
      "description": "=seconds Set the connect timeout to seconds seconds.\tTCP connections that take longer to establish will be aborted.  By default, there is no connect timeout, other than that implemented by system libraries."
    },
    {
      "flag": "--read-timeout",
      "description": "=seconds Set the read (and write) timeout to seconds seconds.  The \"time\" of this timeout refers to idle time: if, at any point in the download, no data is received for more than the specified number of seconds, reading fails and the download is restarted.  This option does not directly affect the duration of the entire download. Of course, the remote server may choose to terminate the connection sooner than this option requires.  The default read timeout is 900 seconds."
    },
    {
      "flag": "--limit-rate",
      "description": "=amount Limit the download speed to amount bytes per second.  Amount may be expressed in bytes, kilobytes with the k suffix, or megabytes with the m suffix.  For example, --limit-rate=20k will limit the retrieval rate to 20KB/s.  This is useful when, for whatever reason, you don't want Wget to consume the entire available bandwidth. This option allows the use of decimal numbers, usually in conjunction with power suffixes; for example, --limit-rate=2.5k is a legal value. Note that Wget implements the limiting by sleeping the appropriate amount of time after a network read that took less time than specified by the rate.  Eventually this strategy causes the TCP transfer to slow down to approximately the specified rate. However, it may take some time for this balance to be achieved, so don't be surprised if limiting the rate doesn't work well with very small files."
    },
    {
      "flag": "--wait",
      "description": "=seconds Wait the specified number of seconds between the retrievals.  Use of this option is recommended, as it lightens the server load by making the requests less frequent.  Instead of in seconds, the time can be specified in minutes using the \"m\" suffix, in hours using \"h\" suffix, or in days using \"d\" suffix. Specifying a large value for this option is useful if the network or the destination host is down, so that Wget can wait long enough to reasonably expect the network error to be fixed before the retry.  The waiting interval specified by this function is influenced by \"--random-wait\", which see.",
      "shortFlag": "-w"
    },
    {
      "flag": "--waitretry",
      "description": "=seconds If you don't want Wget to wait between every retrieval, but only between retries of failed downloads, you can use this option.  Wget will use linear backoff, waiting 1 second after the first failure on a given file, then waiting 2 seconds after the second failure on that file, up to the maximum number of seconds you specify. By default, Wget will assume a value of 10 seconds."
    },
    {
      "flag": "--random-wait",
      "description": " Some web sites may perform log analysis to identify retrieval programs such as Wget by looking for statistically significant similarities in the time between requests. This option causes the time between requests to vary between 0.5 and 1.5 * wait seconds, where wait was specified using the --wait option, in order to mask Wget's presence from such analysis. A 2001 article in a publication devoted to development on a popular consumer platform provided code to perform this analysis on the fly.  Its author suggested blocking at the class C address level to ensure automated retrieval programs were blocked despite changing DHCP-supplied addresses. The --random-wait option was inspired by this ill-advised recommendation to block many unrelated users from a web site due to the actions of one."
    },
    {
      "flag": "--no-proxy",
      "description": " Don't use proxies, even if the appropriate *_proxy environment variable is defined."
    },
    {
      "flag": "--quota",
      "description": "=quota Specify download quota for automatic retrievals.  The value can be specified in bytes (default), kilobytes (with k suffix), or megabytes (with m suffix). Note that quota will never affect downloading a single file.  So if you specify wget -Q10k https://example.com/ls-lR.gz, all of the ls-lR.gz will be downloaded.  The same goes even when several URLs are specified on the command-line.  The quota is checked only at the end of each downloaded file, so it will never result in a partially downloaded file. Thus you may safely type wget -Q2m -i sites---download will be aborted after the file that exhausts the quota is completely downloaded. Setting quota to 0 or to inf unlimits the download quota.",
      "shortFlag": "-Q"
    },
    {
      "flag": "--no-dns-cache",
      "description": " Turn off caching of DNS lookups.  Normally, Wget remembers the IP addresses it looked up from DNS so it doesn't have to repeatedly contact the DNS server for the same (typically small) set of hosts it retrieves from.  This cache exists in memory only; a new Wget run will contact DNS again. However, it has been reported that in some situations it is not desirable to cache host names, even for the duration of a short- running application like Wget.  With this option Wget issues a new DNS lookup (more precisely, a new call to \"gethostbyname\" or \"getaddrinfo\") each time it makes a new connection.\tPlease note that this option will not affect caching that might be performed by the resolving library or by an external caching layer, such as NSCD. If you don't understand exactly what this option does, you probably won't need it."
    },
    {
      "flag": "--restrict-file-names",
      "description": "=modes Change which characters found in remote URLs must be escaped during generation of local filenames.  Characters that are restricted by this option are escaped, i.e. replaced with %HH, where HH is the hexadecimal number that corresponds to the restricted character. This option may also be used to force all alphabetical cases to be either lower- or uppercase. By default, Wget escapes the characters that are not valid or safe as part of file names on your operating system, as well as control characters that are typically unprintable.  This option is useful for changing these defaults, perhaps because you are downloading to a non-native partition, or because you want to disable escaping of the control characters, or you want to further restrict characters to only those in the ASCII range of values. The modes are a comma-separated set of text values. The acceptable values are unix, windows, nocontrol, ascii, lowercase, and uppercase. The values unix and windows are mutually exclusive (one will override the other), as are lowercase and uppercase. Those last are special cases, as they do not change the set of characters that would be escaped, but rather force local file paths to be converted either to lower- or uppercase. When \"unix\" is specified, Wget escapes the character / and the control characters in the ranges 0--31 and 128--159.  This is the default on Unix-like operating systems. When \"windows\" is given, Wget escapes the characters \\, |, /, :, ?, \", *, <, >, and the control characters in the ranges 0--31 and 128--159.  In addition to this, Wget in Windows mode uses + instead of : to separate host and port in local file names, and uses @ instead of ? to separate the query portion of the file name from the rest.  Therefore, a URL that would be saved as www.xemacs.org:4300/search.pl?input=blah in Unix mode would be saved as www.xemacs.org+4300/search.pl@input=blah in Windows mode. This mode is the default on Windows. If you specify nocontrol, then the escaping of the control characters is also switched off. This option may make sense when you are downloading URLs whose names contain UTF-8 characters, on a system which can save and display filenames in UTF-8 (some possible byte values used in UTF-8 byte sequences fall in the range of values designated by Wget as \"controls\"). The ascii mode is used to specify that any bytes whose values are outside the range of ASCII characters (that is, greater than 127) shall be escaped. This can be useful when saving filenames whose encoding does not match the one used locally."
    },
    {
      "flag": "--inet4-only",
      "description": "",
      "shortFlag": "-4"
    },
    {
      "flag": "--inet6-only",
      "description": " Force connecting to IPv4 or IPv6 addresses.\tWith --inet4-only or",
      "shortFlag": "-6"
    },
    {
      "flag": "--prefer-family",
      "description": "=none/IPv4/IPv6 When given a choice of several addresses, connect to the addresses with specified address family first.  The address order returned by DNS is used without change by default. This avoids spurious errors and connect attempts when accessing hosts that resolve to both IPv6 and IPv4 addresses from IPv4 networks.  For example, www.kame.net resolves to 2001:200:0:8002:203:47ff:fea5:3085 and to 203.178.141.194.  When the preferred family is \"IPv4\", the IPv4 address is used first; when the preferred family is \"IPv6\", the IPv6 address is used first; if the specified value is \"none\", the address order returned by DNS is used without change. Unlike -4 and -6, this option doesn't inhibit access to any address family, it only changes the order in which the addresses are accessed.  Also note that the reordering performed by this option is stable---it doesn't affect order of addresses of the same family.  That is, the relative order of all IPv4 addresses and of all IPv6 addresses remains intact in all cases.",
      "shortFlag": "-4"
    },
    {
      "flag": "--retry-connrefused",
      "description": " Consider \"connection refused\" a transient error and try again. Normally Wget gives up on a URL when it is unable to connect to the site because failure to connect is taken as a sign that the server is not running at all and that retries would not help.  This option is for mirroring unreliable sites whose servers tend to disappear for short periods of time."
    },
    {
      "flag": "--user",
      "description": "=user"
    },
    {
      "flag": "--password",
      "description": "=password Specify the username user and password password for both FTP and HTTP file retrieval.  These parameters can be overridden using the"
    },
    {
      "flag": "--ftp-user",
      "description": "and --ftp-password options for FTP connections and the"
    },
    {
      "flag": "--http-user",
      "description": "and --http-password options for HTTP connections."
    },
    {
      "flag": "--ask-password",
      "description": " Prompt for a password for each connection established. Cannot be specified when --password is being used, because they are mutually exclusive."
    },
    {
      "flag": "--use-askpass",
      "description": "=command Prompt for a user and password using the specified command.\tIf no command is specified then the command in the environment variable WGET_ASKPASS is used.  If WGET_ASKPASS is not set then the command in the environment variable SSH_ASKPASS is used. You can set the default command for use-askpass in the .wgetrc. That setting may be overridden from the command line."
    },
    {
      "flag": "--no-iri",
      "description": " Turn off internationalized URI (IRI) support. Use --iri to turn it on. IRI support is activated by default. You can set the default state of IRI support using the \"iri\" command in .wgetrc. That setting may be overridden from the command line."
    },
    {
      "flag": "--local-encoding",
      "description": "=encoding Force Wget to use encoding as the default system encoding. That affects how Wget converts URLs specified as arguments from locale to UTF-8 for IRI support. Wget use the function \"nl_langinfo()\" and then the \"CHARSET\" environment variable to get the locale. If it fails, ASCII is used. You can set the default local encoding using the \"local_encoding\" command in .wgetrc. That setting may be overridden from the command line."
    },
    {
      "flag": "--remote-encoding",
      "description": "=encoding Force Wget to use encoding as the default remote server encoding. That affects how Wget converts URIs found in files from remote encoding to UTF-8 during a recursive fetch. This options is only useful for IRI support, for the interpretation of non-ASCII characters. For HTTP, remote encoding can be found in HTTP \"Content-Type\" header and in HTML \"Content-Type http-equiv\" meta tag. You can set the default encoding using the \"remoteencoding\" command in .wgetrc. That setting may be overridden from the command line."
    },
    {
      "flag": "--unlink",
      "description": " Force Wget to unlink file instead of clobbering existing file. This option is useful for downloading to the directory with hardlinks. Directory Options"
    },
    {
      "flag": "--no-directories",
      "description": " Do not create a hierarchy of directories when retrieving recursively.  With this option turned on, all files will get saved to the current directory, without clobbering (if a name shows up more than once, the filenames will get extensions .n).",
      "shortFlag": "-nd"
    },
    {
      "flag": "--force-directories",
      "description": " The opposite of -nd---create a hierarchy of directories, even if one would not have been created otherwise.  E.g. wget -x http://fly.srk.fer.hr/robots.txt will save the downloaded file to fly.srk.fer.hr/robots.txt.",
      "shortFlag": "-x"
    },
    {
      "flag": "--no-host-directories",
      "description": " Disable generation of host-prefixed directories.  By default, invoking Wget with -r http://fly.srk.fer.hr/ will create a structure of directories beginning with fly.srk.fer.hr/.  This option disables such behavior.",
      "shortFlag": "-nH"
    },
    {
      "flag": "--protocol-directories",
      "description": " Use the protocol name as a directory component of local file names. For example, with this option, wget -r http://host will save to http/host/... rather than just to host/...."
    },
    {
      "flag": "--cut-dirs",
      "description": "=number Ignore number directory components.\tThis is useful for getting a fine-grained control over the directory where recursive retrieval will be saved. Take, for example, the directory at ftp://ftp.xemacs.org/pub/xemacs/.  If you retrieve it with -r, it will be saved locally under ftp.xemacs.org/pub/xemacs/.  While the"
    },
    {
      "flag": "-nH",
      "description": "option can remove the ftp.xemacs.org/ part, you are still stuck with pub/xemacs.  This is where --cut-dirs comes in handy; it makes Wget not \"see\" number remote directory components.  Here are several examples of how --cut-dirs option works. No options\t     -> ftp.xemacs.org/pub/xemacs/"
    },
    {
      "flag": "-nH",
      "description": "-> pub/xemacs/"
    },
    {
      "flag": "-nH",
      "description": "--cut-dirs=1  -> xemacs/"
    },
    {
      "flag": "--cut-dirs",
      "description": "=1      -> ftp.xemacs.org/xemacs/ ... If you just want to get rid of the directory structure, this option is similar to a combination of -nd and -P.  However, unlike -nd,",
      "shortFlag": "-nH"
    },
    {
      "flag": "--cut-dirs",
      "description": "does not lose with subdirectories---for instance, with"
    },
    {
      "flag": "-nH",
      "description": "--cut-dirs=1, a beta/ subdirectory will be placed to xemacs/beta, as one would expect."
    },
    {
      "flag": "--directory-prefix",
      "description": "=prefix Set directory prefix to prefix.  The directory prefix is the directory where all other files and subdirectories will be saved to, i.e. the top of the retrieval tree.  The default is . (the current directory). HTTP Options",
      "shortFlag": "-P"
    },
    {
      "flag": "--default-page",
      "description": "=name Use name as the default file name when it isn't known (i.e., for URLs that end in a slash), instead of index.html."
    },
    {
      "flag": "--adjust-extension",
      "description": " If a file of type application/xhtml+xml or text/html is downloaded and the URL does not end with the regexp \\.[Hh][Tt][Mm][Ll]?, this option will cause the suffix .html to be appended to the local filename.  This is useful, for instance, when you're mirroring a remote site that uses .asp pages, but you want the mirrored pages to be viewable on your stock Apache server.\tAnother good use for this is when you're downloading CGI-generated materials.  A URL like http://site.com/article.cgi?25 will be saved as article.cgi?25.html. Note that filenames changed in this way will be re-downloaded every time you re-mirror a site, because Wget can't tell that the local X.html file corresponds to remote URL X (since it doesn't yet know that the URL produces output of type text/html or application/xhtml+xml. As of version 1.12, Wget will also ensure that any downloaded files of type text/css end in the suffix .css, and the option was renamed from --html-extension, to better reflect its new behavior. The old option name is still acceptable, but should now be considered deprecated. As of version 1.19.2, Wget will also ensure that any downloaded files with a \"Content-Encoding\" of br, compress, deflate or gzip end in the suffix .br, .Z, .zlib and .gz respectively. At some point in the future, this option may well be expanded to include suffixes for other types of content, including content types that are not parsed by Wget.",
      "shortFlag": "-E"
    },
    {
      "flag": "--http-user",
      "description": "=user"
    },
    {
      "flag": "--http-password",
      "description": "=password Specify the username user and password password on an HTTP server. According to the type of the challenge, Wget will encode them using either the \"basic\" (insecure), the \"digest\", or the Windows \"NTLM\" authentication scheme. Another way to specify username and password is in the URL itself. Either method reveals your password to anyone who bothers to run \"ps\".  To prevent the passwords from being seen, use the"
    },
    {
      "flag": "--use-askpass",
      "description": "or store them in .wgetrc or .netrc, and make sure to protect those files from other users with \"chmod\".  If the passwords are really important, do not leave them lying in those files either---edit the files and delete them after Wget has started the download."
    },
    {
      "flag": "--no-http-keep-alive",
      "description": " Turn off the \"keep-alive\" feature for HTTP downloads.  Normally, Wget asks the server to keep the connection open so that, when you download more than one document from the same server, they get transferred over the same TCP connection.  This saves time and at the same time reduces the load on the server. This option is useful when, for some reason, persistent (keep- alive) connections don't work for you, for example due to a server bug or due to the inability of server-side scripts to cope with the connections."
    },
    {
      "flag": "--no-cache",
      "description": " Disable server-side cache.  In this case, Wget will send the remote server appropriate directives (Cache-Control: no-cache and Pragma: no-cache) to get the file from the remote service, rather than returning the cached version. This is especially useful for retrieving and flushing out-of-date documents on proxy servers. Caching is allowed by default."
    },
    {
      "flag": "--no-cookies",
      "description": " Disable the use of cookies.\tCookies are a mechanism for maintaining server-side state.  The server sends the client a cookie using the \"Set-Cookie\" header, and the client responds with the same cookie upon further requests.  Since cookies allow the server owners to keep track of visitors and for sites to exchange this information, some consider them a breach of privacy.  The default is to use cookies; however, storing cookies is not on by default."
    },
    {
      "flag": "--load-cookies",
      "description": "file Load cookies from file before the first HTTP retrieval.  file is a textual file in the format originally used by Netscape's cookies.txt file. You will typically use this option when mirroring sites that require that you be logged in to access some or all of their content.  The login process typically works by the web server issuing an HTTP cookie upon receiving and verifying your credentials.  The cookie is then resent by the browser when accessing that part of the site, and so proves your identity. Mirroring such a site requires Wget to send the same cookies your browser sends when communicating with the site.  This is achieved by --load-cookies---simply point Wget to the location of the cookies.txt file, and it will send the same cookies your browser would send in the same situation.  Different browsers keep textual cookie files in different locations: \"Netscape 4.x.\" The cookies are in ~/.netscape/cookies.txt. \"Mozilla and Netscape 6.x.\" Mozilla's cookie file is also named cookies.txt, located somewhere under ~/.mozilla, in the directory of your profile. The full path usually ends up looking somewhat like ~/.mozilla/default/some-weird-string/cookies.txt. \"Internet Explorer.\" You can produce a cookie file Wget can use by using the File menu, Import and Export, Export Cookies.  This has been tested with Internet Explorer 5; it is not guaranteed to work with earlier versions. \"Other browsers.\" If you are using a different browser to create your cookies,"
    },
    {
      "flag": "--load-cookies",
      "description": "will only work if you can locate or produce a cookie file in the Netscape format that Wget expects. If you cannot use --load-cookies, there might still be an alternative.  If your browser supports a \"cookie manager\", you can use it to view the cookies used when accessing the site you're mirroring.  Write down the name and value of the cookie, and manually instruct Wget to send those cookies, bypassing the \"official\" cookie support: wget --no-cookies --header \"Cookie: <name>=<value>\""
    },
    {
      "flag": "--save-cookies",
      "description": "file Save cookies to file before exiting.  This will not save cookies that have expired or that have no expiry time (so-called \"session cookies\"), but also see --keep-session-cookies."
    },
    {
      "flag": "--keep-session-cookies",
      "description": " When specified, causes --save-cookies to also save session cookies. Session cookies are normally not saved because they are meant to be kept in memory and forgotten when you exit the browser.  Saving them is useful on sites that require you to log in or to visit the home page before you can access some pages.\tWith this option, multiple Wget runs are considered a single browser session as far as the site is concerned. Since the cookie file format does not normally carry session cookies, Wget marks them with an expiry timestamp of 0.  Wget's"
    },
    {
      "flag": "--load-cookies",
      "description": "recognizes those as session cookies, but it might confuse other browsers.  Also note that cookies so loaded will be treated as other session cookies, which means that if you want"
    },
    {
      "flag": "--save-cookies",
      "description": "to preserve them again, you must use"
    },
    {
      "flag": "--keep-session-cookies",
      "description": "again."
    },
    {
      "flag": "--ignore-length",
      "description": " Unfortunately, some HTTP servers (CGI programs, to be more precise) send out bogus \"Content-Length\" headers, which makes Wget go wild, as it thinks not all the document was retrieved.  You can spot this syndrome if Wget retries getting the same document again and again, each time claiming that the (otherwise normal) connection has closed on the very same byte. With this option, Wget will ignore the \"Content-Length\" header---as if it never existed."
    },
    {
      "flag": "--header",
      "description": "=header-line Send header-line along with the rest of the headers in each HTTP request.  The supplied header is sent as-is, which means it must contain name and value separated by colon, and must not contain newlines. You may define more than one additional header by specifying"
    },
    {
      "flag": "--header",
      "description": "more than once. wget --header='Accept-Charset: iso-8859-2' \\"
    },
    {
      "flag": "--header",
      "description": "='Accept-Language: hr'\t      \\ http://fly.srk.fer.hr/ Specification of an empty string as the header value will clear all previous user-defined headers. As of Wget 1.10, this option can be used to override headers otherwise generated automatically.  This example instructs Wget to connect to localhost, but to specify foo.bar in the \"Host\" header: wget --header=\"Host: foo.bar\" http://localhost/ In versions of Wget prior to 1.10 such use of --header caused sending of duplicate headers."
    },
    {
      "flag": "--compression",
      "description": "=type Choose the type of compression to be used.  Legal values are auto, gzip and none. If auto or gzip are specified, Wget asks the server to compress the file using the gzip compression format. If the server compresses the file and responds with the \"Content-Encoding\" header field set appropriately, the file will be decompressed automatically. If none is specified, wget will not ask the server to compress the file and will not decompress any server responses. This is the default. Compression support is currently experimental. In case it is turned on, please report any bugs to \"bug-wget@gnu.org\"."
    },
    {
      "flag": "--max-redirect",
      "description": "=number Specifies the maximum number of redirections to follow for a resource.  The default is 20, which is usually far more than necessary. However, on those occasions where you want to allow more (or fewer), this is the option to use."
    },
    {
      "flag": "--proxy-user",
      "description": "=user"
    },
    {
      "flag": "--proxy-password",
      "description": "=password Specify the username user and password password for authentication on a proxy server.  Wget will encode them using the \"basic\" authentication scheme. Security considerations similar to those with --http-password pertain here as well."
    },
    {
      "flag": "--referer",
      "description": "=url Include `Referer: url' header in HTTP request.  Useful for retrieving documents with server-side processing that assume they are always being retrieved by interactive web browsers and only come out properly when Referer is set to one of the pages that point to them."
    },
    {
      "flag": "--save-headers",
      "description": " Save the headers sent by the HTTP server to the file, preceding the actual contents, with an empty line as the separator."
    },
    {
      "flag": "--user-agent",
      "description": "=agent-string Identify as agent-string to the HTTP server. The HTTP protocol allows the clients to identify themselves using a \"User-Agent\" header field.  This enables distinguishing the WWW software, usually for statistical purposes or for tracing of protocol violations.  Wget normally identifies as Wget/version, version being the current version number of Wget. However, some sites have been known to impose the policy of tailoring the output according to the \"User-Agent\"-supplied information.  While this is not such a bad idea in theory, it has been abused by servers denying information to clients other than (historically) Netscape or, more frequently, Microsoft Internet Explorer.  This option allows you to change the \"User-Agent\" line issued by Wget.  Use of this option is discouraged, unless you really know what you are doing. Specifying empty user agent with --user-agent=\"\" instructs Wget not to send the \"User-Agent\" header in HTTP requests.",
      "shortFlag": "-U"
    },
    {
      "flag": "--post-data",
      "description": "=string"
    },
    {
      "flag": "--post-file",
      "description": "=file Use POST as the method for all HTTP requests and send the specified data in the request body.  --post-data sends string as data, whereas --post-file sends the contents of file.  Other than that, they work in exactly the same way. In particular, they both expect content of the form \"key1=value1&key2=value2\", with percent- encoding for special characters; the only difference is that one expects its content as a command-line parameter and the other accepts its content from a file. In particular, --post-file is not for transmitting files as form attachments: those must appear as \"key=value\" data (with appropriate percent-coding) just like everything else. Wget does not currently support \"multipart/form-data\" for transmitting POST data; only \"application/x-www-form-urlencoded\". Only one of --post-data and"
    },
    {
      "flag": "--post-file",
      "description": "should be specified. Please note that wget does not require the content to be of the form \"key1=value1&key2=value2\", and neither does it test for it. Wget will simply transmit whatever data is provided to it. Most servers however expect the POST data to be in the above format when processing HTML Forms. When sending a POST request using the --post-file option, Wget treats the file as a binary file and will send every character in the POST request without stripping trailing newline or formfeed characters. Any other control characters in the text will also be sent as-is in the POST request. Please be aware that Wget needs to know the size of the POST data in advance.\tTherefore the argument to \"--post-file\" must be a regular file; specifying a FIFO or something like /dev/stdin won't work.  It's not quite clear how to work around this limitation inherent in HTTP/1.0.  Although HTTP/1.1 introduces chunked transfer that doesn't require knowing the request length in advance, a client can't use chunked unless it knows it's talking to an HTTP/1.1 server.\tAnd it can't know that until it receives a response, which in turn requires the request to have been completed -- a chicken-and-egg problem. Note: As of version 1.15 if Wget is redirected after the POST request is completed, its behaviour will depend on the response code returned by the server.  In case of a 301 Moved Permanently, 302 Moved Temporarily or 307 Temporary Redirect, Wget will, in accordance with RFC2616, continue to send a POST request.  In case a server wants the client to change the Request method upon redirection, it should send a 303 See Other response code. This example shows how to log in to a server using POST and then proceed to download the desired pages, presumably only accessible to authorized users: # Log in to the server.  This can be done only once. wget --save-cookies cookies.txt \\"
    },
    {
      "flag": "--post-data",
      "description": "'user=foo&password=bar' \\ http://example.com/auth.php # Now grab the page or pages we care about. wget --load-cookies cookies.txt \\"
    },
    {
      "flag": "--save-cookies",
      "description": "to force saving of session cookies.",
      "shortFlag": "-p"
    },
    {
      "flag": "--method",
      "description": "=HTTP-Method For the purpose of RESTful scripting, Wget allows sending of other HTTP Methods without the need to explicitly set them using"
    },
    {
      "flag": "--header",
      "description": "=Header-Line.  Wget will use whatever string is passed to it after --method as the HTTP Method to the server."
    },
    {
      "flag": "--body-data",
      "description": "=Data-String"
    },
    {
      "flag": "--body-file",
      "description": "=Data-File Must be set when additional data needs to be sent to the server along with the Method specified using --method.  --body-data sends string as data, whereas --body-file sends the contents of file. Other than that, they work in exactly the same way. Currently, --body-file is not for transmitting files as a whole. Wget does not currently support \"multipart/form-data\" for transmitting data; only \"application/x-www-form-urlencoded\". In the future, this may be changed so that wget sends the --body-file as a complete file instead of sending its contents to the server. Please be aware that Wget needs to know the contents of BODY Data in advance, and hence the argument to --body-file should be a regular file. See --post-file for a more detailed explanation.  Only one of"
    },
    {
      "flag": "--body-data",
      "description": "and --body-file should be specified. If Wget is redirected after the request is completed, Wget will suspend the current method and send a GET request till the redirection is completed.  This is true for all redirection response codes except 307 Temporary Redirect which is used to explicitly specify that the request method should not change. Another exception is when the method is set to \"POST\", in which case the redirection rules specified under --post-data are followed."
    },
    {
      "flag": "--content-disposition",
      "description": " If this is set to on, experimental (not fully-functional) support for \"Content-Disposition\" headers is enabled. This can currently result in extra round-trips to the server for a \"HEAD\" request, and is known to suffer from a few bugs, which is why it is not currently enabled by default. This option is useful for some file-downloading CGI programs that use \"Content-Disposition\" headers to describe what the name of a downloaded file should be. When combined with --metalink-over-http and --trust-server-names, a Content-Type: application/metalink4+xml file is named using the \"Content-Disposition\" filename field, if available."
    },
    {
      "flag": "--content-on-error",
      "description": " If this is set to on, wget will not skip the content when the server responds with a http status code that indicates error."
    },
    {
      "flag": "--trust-server-names",
      "description": " If this is set, on a redirect, the local file name will be based on the redirection URL.  By default the local file name is based on the original URL.  When doing recursive retrieving this can be helpful because in many web sites redirected URLs correspond to an underlying file structure, while link URLs do not."
    },
    {
      "flag": "--auth-no-challenge",
      "description": " If this option is given, Wget will send Basic HTTP authentication information (plaintext username and password) for all requests, just like Wget 1.10.2 and prior did by default. Use of this option is not recommended, and is intended only to support some few obscure servers, which never send HTTP authentication challenges, but accept unsolicited auth info, say, in addition to form-based authentication."
    },
    {
      "flag": "--retry-on-host-error",
      "description": " Consider host errors, such as \"Temporary failure in name resolution\", as non-fatal, transient errors."
    },
    {
      "flag": "--retry-on-http-error",
      "description": "=code[,code,...] Consider given HTTP response codes as non-fatal, transient errors. Supply a comma-separated list of 3-digit HTTP response codes as argument. Useful to work around special circumstances where retries are required, but the server responds with an error code normally not retried by Wget. Such errors might be 503 (Service Unavailable) and 429 (Too Many Requests). Retries enabled by this option are performed subject to the normal retry timing and retry count limitations of Wget. Using this option is intended to support special use cases only and is generally not recommended, as it can force retries even in cases where the server is actually trying to decrease its load. Please use wisely and only if you know what you are doing. HTTPS (SSL/TLS) Options To support encrypted HTTP (HTTPS) downloads, Wget must be compiled with an external SSL library. The current default is GnuTLS.\tIn addition, Wget also supports HSTS (HTTP Strict Transport Security).  If Wget is compiled without SSL support, none of these options are available."
    },
    {
      "flag": "--secure-protocol",
      "description": "=protocol Choose the secure protocol to be used.  Legal values are auto, SSLv2, SSLv3, TLSv1, TLSv1_1, TLSv1_2, TLSv1_3 and PFS.  If auto is used, the SSL library is given the liberty of choosing the appropriate protocol automatically, which is achieved by sending a TLSv1 greeting. This is the default. Specifying SSLv2, SSLv3, TLSv1, TLSv1_1, TLSv1_2 or TLSv1_3 forces the use of the corresponding protocol.  This is useful when talking to old and buggy SSL server implementations that make it hard for the underlying SSL library to choose the correct protocol version. Fortunately, such servers are quite rare. Specifying PFS enforces the use of the so-called Perfect Forward Security cipher suites. In short, PFS adds security by creating a one-time key for each SSL connection. It has a bit more CPU impact on client and server.  We use known to be secure ciphers (e.g. no MD4) and the TLS protocol. This mode also explicitly excludes non- PFS key exchange methods, such as RSA."
    },
    {
      "flag": "--https-only",
      "description": " When in recursive mode, only HTTPS links are followed."
    },
    {
      "flag": "--ciphers",
      "description": " Set the cipher list string. Typically this string sets the cipher suites and other SSL/TLS options that the user wish should be used, in a set order of preference (GnuTLS calls it 'priority string'). This string will be fed verbatim to the SSL/TLS engine (OpenSSL or GnuTLS) and hence its format and syntax is dependent on that. Wget will not process or manipulate it in any way. Refer to the OpenSSL or GnuTLS documentation for more information."
    },
    {
      "flag": "--no-check-certificate",
      "description": " Don't check the server certificate against the available certificate authorities.  Also don't require the URL host name to match the common name presented by the certificate. As of Wget 1.10, the default is to verify the server's certificate against the recognized certificate authorities, breaking the SSL handshake and aborting the download if the verification fails. Although this provides more secure downloads, it does break interoperability with some sites that worked with previous Wget versions, particularly those using self-signed, expired, or otherwise invalid certificates.  This option forces an \"insecure\" mode of operation that turns the certificate verification errors into warnings and allows you to proceed. If you encounter \"certificate verification\" errors or ones saying that \"common name doesn't match requested host name\", you can use this option to bypass the verification and proceed with the download.  Only use this option if you are otherwise convinced of the site's authenticity, or if you really don't care about the validity of its certificate.  It is almost always a bad idea not to check the certificates when transmitting confidential or important data.  For self-signed/internal certificates, you should download the certificate and verify against that instead of forcing this insecure mode.  If you are really sure of not desiring any certificate verification, you can specify --check-certificate=quiet to tell wget to not print any warning about invalid certificates, albeit in most cases this is the wrong thing to do."
    },
    {
      "flag": "--certificate",
      "description": "=file Use the client certificate stored in file.  This is needed for servers that are configured to require certificates from the clients that connect to them.  Normally a certificate is not required and this switch is optional."
    },
    {
      "flag": "--certificate-type",
      "description": "=type Specify the type of the client certificate.\tLegal values are PEM (assumed by default) and DER, also known as ASN1."
    },
    {
      "flag": "--private-key",
      "description": "=file Read the private key from file.  This allows you to provide the private key in a file separate from the certificate."
    },
    {
      "flag": "--private-key-type",
      "description": "=type Specify the type of the private key.  Accepted values are PEM (the default) and DER."
    },
    {
      "flag": "--ca-certificate",
      "description": "=file Use file as the file with the bundle of certificate authorities (\"CA\") to verify the peers.\tThe certificates must be in PEM format. Without this option Wget looks for CA certificates at the system- specified locations, chosen at OpenSSL installation time."
    },
    {
      "flag": "--ca-directory",
      "description": "=directory Specifies directory containing CA certificates in PEM format.  Each file contains one CA certificate, and the file name is based on a hash value derived from the certificate.  This is achieved by processing a certificate directory with the \"c_rehash\" utility supplied with OpenSSL.  Using --ca-directory is more efficient than"
    },
    {
      "flag": "--ca-certificate",
      "description": "when many certificates are installed because it allows Wget to fetch certificates on demand. Without this option Wget looks for CA certificates at the system- specified locations, chosen at OpenSSL installation time."
    },
    {
      "flag": "--crl-file",
      "description": "=file Specifies a CRL file in file.  This is needed for certificates that have been revocated by the CAs."
    },
    {
      "flag": "--pinnedpubkey",
      "description": "=file/hashes Tells wget to use the specified public key file (or hashes) to verify the peer.  This can be a path to a file which contains a single public key in PEM or DER format, or any number of base64 encoded sha256 hashes preceded by \"sha256//\" and separated by \";\" When negotiating a TLS or SSL connection, the server sends a certificate indicating its identity. A public key is extracted from this certificate and if it does not exactly match the public key(s) provided to this option, wget will abort the connection before sending or receiving any data."
    },
    {
      "flag": "--random-file",
      "description": "=file [OpenSSL and LibreSSL only] Use file as the source of random data for seeding the pseudo-random number generator on systems without /dev/urandom. On such systems the SSL library needs an external source of randomness to initialize.  Randomness may be provided by EGD (see"
    },
    {
      "flag": "--egd-file",
      "description": "below) or read from an external source specified by the user.  If this option is not specified, Wget looks for random data in $RANDFILE or, if that is unset, in $HOME/.rnd. If you're getting the \"Could not seed OpenSSL PRNG; disabling SSL.\" error, you should provide random data using some of the methods described above."
    },
    {
      "flag": "--egd-file",
      "description": "=file [OpenSSL only] Use file as the EGD socket.  EGD stands for Entropy Gathering Daemon, a user-space program that collects data from various unpredictable system sources and makes it available to other programs that might need it.  Encryption software, such as the SSL library, needs sources of non-repeating randomness to seed the random number generator used to produce cryptographically strong keys. OpenSSL allows the user to specify his own source of entropy using the \"RAND_FILE\" environment variable.  If this variable is unset, or if the specified file does not produce enough randomness, OpenSSL will read random data from EGD socket specified using this option. If this option is not specified (and the equivalent startup command is not used), EGD is never contacted.  EGD is not needed on modern Unix systems that support /dev/urandom."
    },
    {
      "flag": "--no-hsts",
      "description": " Wget supports HSTS (HTTP Strict Transport Security, RFC 6797) by default.  Use --no-hsts to make Wget act as a non-HSTS-compliant UA. As a consequence, Wget would ignore all the \"Strict-Transport-Security\" headers, and would not enforce any existing HSTS policy."
    },
    {
      "flag": "--hsts-file",
      "description": "=file By default, Wget stores its HSTS database in ~/.wget-hsts.  You can use --hsts-file to override this. Wget will use the supplied file as the HSTS database. Such file must conform to the correct HSTS database format used by Wget. If Wget cannot parse the provided file, the behaviour is unspecified. The Wget's HSTS database is a plain text file. Each line contains an HSTS entry (ie. a site that has issued a \"Strict-Transport-Security\" header and that therefore has specified a concrete HSTS policy to be applied). Lines starting with a dash (\"#\") are ignored by Wget. Please note that in spite of this convenient human-readability hand-hacking the HSTS database is generally not a good idea. An HSTS entry line consists of several fields separated by one or more whitespace: \"<hostname> SP [<port>] SP <include subdomains> SP <created> SP <max-age>\" The hostname and port fields indicate the hostname and port to which the given HSTS policy applies. The port field may be zero, and it will, in most of the cases. That means that the port number will not be taken into account when deciding whether such HSTS policy should be applied on a given request (only the hostname will be evaluated). When port is different to zero, both the target hostname and the port will be evaluated and the HSTS policy will only be applied if both of them match. This feature has been included for testing/development purposes only.  The Wget testsuite (in testenv/) creates HSTS databases with explicit ports with the purpose of ensuring Wget's correct behaviour. Applying HSTS policies to ports other than the default ones is discouraged by RFC 6797 (see Appendix B \"Differences between HSTS Policy and Same- Origin Policy\"). Thus, this functionality should not be used in production environments and port will typically be zero. The last three fields do what they are expected to. The field include_subdomains can either be 1 or 0 and it signals whether the subdomains of the target domain should be part of the given HSTS policy as well. The created and max-age fields hold the timestamp values of when such entry was created (first seen by Wget) and the HSTS-defined value 'max-age', which states how long should that HSTS policy remain active, measured in seconds elapsed since the timestamp stored in created. Once that time has passed, that HSTS policy will no longer be valid and will eventually be removed from the database. If you supply your own HSTS database via --hsts-file, be aware that Wget may modify the provided file if any change occurs between the HSTS policies requested by the remote servers and those in the file. When Wget exits, it effectively updates the HSTS database by rewriting the database file with the new entries. If the supplied file does not exist, Wget will create one. This file will contain the new HSTS entries. If no HSTS entries were generated (no \"Strict-Transport-Security\" headers were sent by any of the servers) then no file will be created, not even an empty one. This behaviour applies to the default database file (~/.wget-hsts) as well: it will not be created until some server enforces an HSTS policy. Care is taken not to override possible changes made by other Wget processes at the same time over the HSTS database. Before dumping the updated HSTS entries on the file, Wget will re-read it and merge the changes. Using a custom HSTS database and/or modifying an existing one is discouraged.  For more information about the potential security threats arose from such practice, see section 14 \"Security Considerations\" of RFC 6797, specially section 14.9 \"Creative Manipulation of HSTS Policy Store\"."
    },
    {
      "flag": "--warc-file",
      "description": "=file Use file as the destination WARC file."
    },
    {
      "flag": "--warc-header",
      "description": "=string Use string into as the warcinfo record."
    },
    {
      "flag": "--warc-max-size",
      "description": "=size Set the maximum size of the WARC files to size."
    },
    {
      "flag": "--warc-cdx",
      "description": " Write CDX index files."
    },
    {
      "flag": "--warc-dedup",
      "description": "=file Do not store records listed in this CDX file."
    },
    {
      "flag": "--no-warc-compression",
      "description": " Do not compress WARC files with GZIP."
    },
    {
      "flag": "--no-warc-digests",
      "description": " Do not calculate SHA1 digests."
    },
    {
      "flag": "--no-warc-keep-log",
      "description": " Do not store the log file in a WARC record."
    },
    {
      "flag": "--warc-tempdir",
      "description": "=dir Specify the location for temporary files created by the WARC writer. FTP Options"
    },
    {
      "flag": "--ftp-user",
      "description": "=user"
    },
    {
      "flag": "--ftp-password",
      "description": "=password Specify the username user and password password on an FTP server. Without this, or the corresponding startup option, the password defaults to -wget@, normally used for anonymous FTP. Another way to specify username and password is in the URL itself. Either method reveals your password to anyone who bothers to run \"ps\".  To prevent the passwords from being seen, store them in .wgetrc or .netrc, and make sure to protect those files from other users with \"chmod\".\tIf the passwords are really important, do not leave them lying in those files either---edit the files and delete them after Wget has started the download."
    },
    {
      "flag": "--no-remove-listing",
      "description": " Don't remove the temporary .listing files generated by FTP retrievals.\tNormally, these files contain the raw directory listings received from FTP servers.\tNot removing them can be useful for debugging purposes, or when you want to be able to easily check on the contents of remote server directories (e.g. to verify that a mirror you're running is complete). Note that even though Wget writes to a known filename for this file, this is not a security hole in the scenario of a user making .listing a symbolic link to /etc/passwd or something and asking \"root\" to run Wget in his or her directory.\tDepending on the options used, either Wget will refuse to write to .listing, making the globbing/recursion/time-stamping operation fail, or the symbolic link will be deleted and replaced with the actual .listing file, or the listing will be written to a .listing.number file. Even though this situation isn't a problem, though, \"root\" should never run Wget in a non-trusted user's directory.  A user could do something as simple as linking index.html to /etc/passwd and asking \"root\" to run Wget with -N or -r so the file will be overwritten."
    },
    {
      "flag": "--no-glob",
      "description": " Turn off FTP globbing.  Globbing refers to the use of shell-like special characters (wildcards), like *, ?, [ and ] to retrieve more than one file from the same directory at once, like: wget ftp://gnjilux.srk.fer.hr/*.msg By default, globbing will be turned on if the URL contains a globbing character.\tThis option may be used to turn globbing on or off permanently. You may have to quote the URL to protect it from being expanded by your shell.\tGlobbing makes Wget look for a directory listing, which is system-specific.  This is why it currently works only with Unix FTP servers (and the ones emulating Unix \"ls\" output)."
    },
    {
      "flag": "--no-passive-ftp",
      "description": " Disable the use of the passive FTP transfer mode.  Passive FTP mandates that the client connect to the server to establish the data connection rather than the other way around. If the machine is connected to the Internet directly, both passive and active FTP should work equally well.  Behind most firewall and NAT configurations passive FTP has a better chance of working. However, in some rare firewall configurations, active FTP actually works when passive FTP doesn't.  If you suspect this to be the case, use this option, or set \"passive_ftp=off\" in your init file."
    },
    {
      "flag": "--preserve-permissions",
      "description": " Preserve remote file permissions instead of permissions set by umask."
    },
    {
      "flag": "--retr-symlinks",
      "description": " By default, when retrieving FTP directories recursively and a symbolic link is encountered, the symbolic link is traversed and the pointed-to files are retrieved.\tCurrently, Wget does not traverse symbolic links to directories to download them recursively, though this feature may be added in the future. When --retr-symlinks=no is specified, the linked-to file is not downloaded.\tInstead, a matching symbolic link is created on the local file system.  The pointed-to file will not be retrieved unless this recursive retrieval would have encountered it separately and downloaded it anyway.  This option poses a security risk where a malicious FTP Server may cause Wget to write to files outside of the intended directories through a specially crafted .LISTING file. Note that when retrieving a file (not a directory) because it was specified on the command-line, rather than because it was recursed to, this option has no effect.  Symbolic links are always traversed in this case. FTPS Options"
    },
    {
      "flag": "--ftps-implicit",
      "description": " This option tells Wget to use FTPS implicitly. Implicit FTPS consists of initializing SSL/TLS from the very beginning of the control connection. This option does not send an \"AUTH TLS\" command: it assumes the server speaks FTPS and directly starts an SSL/TLS connection. If the attempt is successful, the session continues just like regular FTPS (\"PBSZ\" and \"PROT\" are sent, etc.).  Implicit FTPS is no longer a requirement for FTPS implementations, and thus many servers may not support it. If"
    },
    {
      "flag": "--ftps-implicit",
      "description": "is passed and no explicit port number specified, the default port for implicit FTPS, 990, will be used, instead of the default port for the \"normal\" (explicit) FTPS which is the same as that of FTP, 21."
    },
    {
      "flag": "--no-ftps-resume-ssl",
      "description": " Do not resume the SSL/TLS session in the data channel. When starting a data connection, Wget tries to resume the SSL/TLS session previously started in the control connection.  SSL/TLS session resumption avoids performing an entirely new handshake by reusing the SSL/TLS parameters of a previous session. Typically, the FTPS servers want it that way, so Wget does this by default. Under rare circumstances however, one might want to start an entirely new SSL/TLS session in every data connection.  This is what --no-ftps-resume-ssl is for."
    },
    {
      "flag": "--ftps-clear-data-connection",
      "description": " All the data connections will be in plain text. Only the control connection will be under SSL/TLS. Wget will send a \"PROT C\" command to achieve this, which must be approved by the server."
    },
    {
      "flag": "--ftps-fallback-to-ftp",
      "description": " Fall back to FTP if FTPS is not supported by the target server. For security reasons, this option is not asserted by default. The default behaviour is to exit with an error.\tIf a server does not successfully reply to the initial \"AUTH TLS\" command, or in the case of implicit FTPS, if the initial SSL/TLS connection attempt is rejected, it is considered that such server does not support FTPS. Recursive Retrieval Options"
    },
    {
      "flag": "--recursive",
      "description": " Turn on recursive retrieving.    The default maximum depth is 5.",
      "shortFlag": "-r"
    },
    {
      "flag": "--level",
      "description": "=depth Set the maximum number of subdirectories that Wget will recurse into to depth.  In order to prevent one from accidentally downloading very large websites when using recursion this is limited to a depth of 5 by default, i.e., it will traverse at most 5 directories deep starting from the provided URL. Set -l 0 or -l inf for infinite recursion depth. wget -r -l 0 http://<site>/1.html Ideally, one would expect this to download just 1.html.  but unfortunately this is not the case, because -l 0 is equivalent to",
      "shortFlag": "-l"
    },
    {
      "flag": "--delete-after",
      "description": " This option tells Wget to delete every single file it downloads, after having done so.  It is useful for pre-fetching popular pages through a proxy, e.g.: wget -r -nd --delete-after http://whatever.com/~popular/page/ The -r option is to retrieve recursively, and -nd to not create directories. Note that --delete-after deletes files on the local machine.  It does not issue the DELE command to remote FTP sites, for instance. Also note that when --delete-after is specified, --convert-links is ignored, so .orig files are simply not created in the first place.",
      "shortFlag": "-l"
    },
    {
      "flag": "--convert-links",
      "description": " After the download is complete, convert the links in the document to make them suitable for local viewing.  This affects not only the visible hyperlinks, but any part of the document that links to external content, such as embedded images, links to style sheets, hyperlinks to non-HTML content, etc. Each link will be changed in one of the two ways:    The links to files that have been downloaded by Wget will be changed to refer to the file they point to as a relative link. Example: if the downloaded file /foo/doc.html links to /bar/img.gif, also downloaded, then the link in doc.html will be modified to point to ../bar/img.gif.\tThis kind of transformation works reliably for arbitrary combinations of directories.    The links to files that have not been downloaded by Wget will be changed to include host name and absolute path of the location they point to. Example: if the downloaded file /foo/doc.html links to /bar/img.gif (or to ../bar/img.gif), then the link in doc.html will be modified to point to http://hostname/bar/img.gif. Because of this, local browsing works reliably: if a linked file was downloaded, the link will refer to its local name; if it was not downloaded, the link will refer to its full Internet address rather than presenting a broken link.  The fact that the former links are converted to relative links ensures that you can move the downloaded hierarchy to another directory. Note that only at the end of the download can Wget know which links have been downloaded.  Because of that, the work done by -k will be performed at the end of all the downloads.",
      "shortFlag": "-k"
    },
    {
      "flag": "--convert-file-only",
      "description": " This option converts only the filename part of the URLs, leaving the rest of the URLs untouched. This filename part is sometimes referred to as the \"basename\", although we avoid that term here in order not to cause confusion. It works particularly well in conjunction with --adjust-extension, although this coupling is not enforced. It proves useful to populate Internet caches with files downloaded from different hosts. Example: if some link points to //foo.com/bar.cgi?xyz with"
    },
    {
      "flag": "--adjust-extension",
      "description": "asserted and its local destination is intended to be ./foo.com/bar.cgi?xyz.css, then the link would be converted to //foo.com/bar.cgi?xyz.css. Note that only the filename part has been modified. The rest of the URL has been left untouched, including the net path (\"//\") which would otherwise be processed by Wget and converted to the effective scheme (ie. \"http://\")."
    },
    {
      "flag": "--backup-converted",
      "description": " When converting a file, back up the original version with a .orig suffix.  Affects the behavior of -N.",
      "shortFlag": "-K"
    },
    {
      "flag": "--mirror",
      "description": " Turn on options suitable for mirroring.  This option turns on recursion and time-stamping, sets infinite recursion depth and keeps FTP directory listings.  It is currently equivalent to -r -N",
      "shortFlag": "-m"
    },
    {
      "flag": "-l",
      "description": "inf --no-remove-listing."
    },
    {
      "flag": "--page-requisites",
      "description": " This option causes Wget to download all the files that are necessary to properly display a given HTML page.  This includes such things as inlined images, sounds, and referenced stylesheets. Ordinarily, when downloading a single HTML page, any requisite documents that may be needed to display it properly are not downloaded.\tUsing -r together with -l can help, but since Wget does not ordinarily distinguish between external and inlined documents, one is generally left with \"leaf documents\" that are missing their requisites. For instance, say document 1.html contains an \"<IMG>\" tag referencing 1.gif and an \"<A>\" tag pointing to external document 2.html.  Say that 2.html is similar but that its image is 2.gif and it links to 3.html.\tSay this continues up to some arbitrarily high number. If one executes the command: wget -r -l 2 http://<site>/1.html then 1.html, 1.gif, 2.html, 2.gif, and 3.html will be downloaded. As you can see, 3.html is without its requisite 3.gif because Wget is simply counting the number of hops (up to 2) away from 1.html in order to determine where to stop the recursion.  However, with this command: wget -r -l 2 -p http://<site>/1.html all the above files and 3.html's requisite 3.gif will be downloaded.\tSimilarly, wget -r -l 1 -p http://<site>/1.html will cause 1.html, 1.gif, 2.html, and 2.gif to be downloaded.  One might think that: wget -r -l 0 -p http://<site>/1.html would download just 1.html and 1.gif, but unfortunately this is not the case, because -l 0 is equivalent to -l inf---that is, infinite recursion.  To download a single HTML page (or a handful of them, all specified on the command-line or in a -i URL input file) and its (or their) requisites, simply leave off -r and -l: wget -p http://<site>/1.html Note that Wget will behave as if -r had been specified, but only that single page and its requisites will be downloaded.  Links from that page to external documents will not be followed.  Actually, to download a single page and all its requisites (even if they exist on separate websites), and make sure the lot displays properly locally, this author likes to use a few options in addition to -p: wget -E -H -k -K -p http://<site>/<document> To finish off this topic, it's worth knowing that Wget's idea of an external document link is any URL specified in an \"<A>\" tag, an \"<AREA>\" tag, or a \"<LINK>\" tag other than \"<LINK REL=\"stylesheet\">\".",
      "shortFlag": "-p"
    },
    {
      "flag": "--strict-comments",
      "description": " Turn on strict parsing of HTML comments.  The default is to terminate comments at the first occurrence of -->. According to specifications, HTML comments are expressed as SGML declarations.  Declaration is special markup that begins with <! and ends with >, such as <!DOCTYPE ...>, that may contain comments between a pair of -- delimiters.  HTML comments are \"empty declarations\", SGML declarations without any non-comment text. Therefore, <!--foo--> is a valid comment, and so is <!--one--"
    },
    {
      "flag": "--two--",
      "description": ">, but <!--1--2--> is not. On the other hand, most HTML writers don't perceive comments as anything other than text delimited with <!-- and -->, which is not quite the same.  For example, something like <!------------> works as a valid comment as long as the number of dashes is a multiple of four (!).  If not, the comment technically lasts until the next --, which may be at the other end of the document.  Because of this, many popular browsers completely ignore the specification and implement what users have come to expect: comments delimited with <!-- and -->. Until version 1.9, Wget interpreted comments strictly, which resulted in missing links in many web pages that displayed fine in browsers, but had the misfortune of containing non-compliant comments.  Beginning with version 1.9, Wget has joined the ranks of clients that implements \"naive\" comments, terminating each comment at the first occurrence of -->. If, for whatever reason, you want strict comment parsing, use this option to turn it on. Recursive Accept/Reject Options"
    },
    {
      "flag": "-A",
      "description": "acclist --accept acclist"
    },
    {
      "flag": "--accept-regex",
      "description": "urlregex",
      "shortFlag": "-R"
    },
    {
      "flag": "--reject-regex",
      "description": "urlregex Specify a regular expression to accept or reject the complete URL."
    },
    {
      "flag": "--regex-type",
      "description": "regextype Specify the regular expression type.  Possible types are posix or pcre.  Note that to be able to use pcre type, wget has to be compiled with libpcre support."
    },
    {
      "flag": "--domains",
      "description": "=domain-list Set domains to be followed.\tdomain-list is a comma-separated list of domains.\tNote that it does not turn on -H.",
      "shortFlag": "-D"
    },
    {
      "flag": "--exclude-domains",
      "description": "domain-list Specify the domains that are not to be followed."
    },
    {
      "flag": "--follow-ftp",
      "description": " Follow FTP links from HTML documents.  Without this option, Wget will ignore all the FTP links."
    },
    {
      "flag": "--follow-tags",
      "description": "=list Wget has an internal table of HTML tag / attribute pairs that it considers when looking for linked documents during a recursive retrieval.  If a user wants only a subset of those tags to be considered, however, he or she should be specify such tags in a comma-separated list with this option."
    },
    {
      "flag": "--ignore-tags",
      "description": "=list This is the opposite of the --follow-tags option.  To skip certain HTML tags when recursively looking for documents to download, specify them in a comma-separated list. In the past, this option was the best bet for downloading a single page and its requisites, using a command-line like: wget --ignore-tags=a,area -H -k -K -r http://<site>/<document> However, the author of this option came across a page with tags like \"<LINK REL=\"home\" HREF=\"/\">\" and came to the realization that specifying tags to ignore was not enough.  One can't just tell Wget to ignore \"<LINK>\", because then stylesheets will not be downloaded.\tNow the best bet for downloading a single page and its requisites is the dedicated --page-requisites option."
    },
    {
      "flag": "--ignore-case",
      "description": " Ignore case when matching files and directories.  This influences the behavior of -R, -A, -I, and -X options, as well as globbing implemented when downloading from FTP sites.  For example, with this option, -A \"*.txt\" will match file1.txt, but also file2.TXT, file3.TxT, and so on.  The quotes in the example are to prevent the shell from expanding the pattern."
    },
    {
      "flag": "--span-hosts",
      "description": " Enable spanning across hosts when doing recursive retrieving.",
      "shortFlag": "-H"
    },
    {
      "flag": "--relative",
      "description": " Follow relative links only.\tUseful for retrieving a specific home page without any distractions, not even those from the same hosts.",
      "shortFlag": "-L"
    },
    {
      "flag": "--include-directories",
      "description": "=list Specify a comma-separated list of directories you wish to follow when downloading.  Elements of list may contain wildcards.",
      "shortFlag": "-I"
    },
    {
      "flag": "--exclude-directories",
      "description": "=list Specify a comma-separated list of directories you wish to exclude from download.  Elements of list may contain wildcards.",
      "shortFlag": "-X"
    },
    {
      "flag": "--no-parent",
      "description": " Do not ever ascend to the parent directory when retrieving recursively.  This is a useful option, since it guarantees that only the files below a certain hierarchy will be downloaded.",
      "shortFlag": "-np"
    }
  ],
  "examples": [],
  "relatedCommands": [
    "wget2",
    "non-interactive",
    "network",
    "downloader",
    "wget",
    "option",
    "free",
    "utility",
    "download",
    "supports",
    "protocols",
    "well",
    "retrieval",
    "through",
    "proxies"
  ],
  "seeAlso": [
    {
      "name": "wget2",
      "section": 1
    }
  ],
  "metadata": {
    "author": "suggested blocking at the class C address level to"
  },
  "searchContent": "wget the non-interactive network downloader gnu wget is a free utility for non-interactive download of files from the web wget option url wget non-interactive network downloader free utility download web --version display the version of wget --help print a help message describing all of wget s command-line options --background go to background immediately after startup if no output file is specified via the -o output is redirected to wget-log --execute command execute command as if it were a part of wgetrc a command thus invoked will be executed after the commands in wgetrc thus taking precedence over them if you need to specify more than one wgetrc command use multiple instances of -e logging and input file options --output-file logfile log all messages to logfile the messages are normally reported to standard error --append-output logfile append to logfile this is the same as -o only it appends to logfile instead of overwriting the old log file if logfile does not exist a new file is created --debug turn on debug output meaning various information important to the developers of wget if it does not work properly your system administrator may have chosen to compile wget without debug support in which case -d will not work please note that compiling with debug support is always safe---wget compiled with the debug support will not print any debug info unless requested with -d --quiet turn off wget s output --verbose turn on verbose output with all the available data the default output is verbose --no-verbose turn off verbose without being completely quiet use -q for that which means that error messages and basic information still get printed --report-speed type output bandwidth as type the only accepted value is bits --input-file file read urls from a local or external file if - is specified as file urls are read from the standard input use - to read from a file literally named - if this function is used no urls need be present on the command line if there are urls both on the command line and in an input file those on the command lines will be the first ones to be retrieved if --force-html is not specified then file should consist of a series of urls one per line however if you specify --force-html the document will be regarded as html in that case you may have problems with relative links which you can solve either by adding base href url to the documents or by specifying --base url on the command line if the file is an external one the document will be automatically treated as html if the content-type matches text html furthermore the file s location will be implicitly used as base href if none was specified if the file is a local file on systems that support it it will be opened with the o nonblock flag to allow non-blocking reads from the file wget will attempt to continue reading from the file until eof is reached or it is closed this allows one to stream a list of files for retrieval where the list is dynamically generated during the execution of the process currently this feature is not available on windows platforms --input-metalink file downloads files covered in local metalink file metalink version 3 and 4 are supported --keep-badhash keeps downloaded metalink s files with a bad hash it appends badhash to the name of metalink s files which have a checksum mismatch except without overwriting existing files --metalink-over-http issues http head request instead of get and extracts metalink metadata from response headers then it switches to metalink download if no valid metalink metadata is found it falls back to ordinary http download enables content-type application metalink4 xml files download processing --metalink-index number set the metalink application metalink4 xml metaurl ordinal number from 1 to the total number of application metalink4 xml available specify 0 or inf to choose the first good one metaurls such as those from a --metalink-over-http may have been sorted by priority key s value keep this in mind to choose the right number --preferred-location set preferred location for metalink resources this has effect if multiple resources with same priority are available --xattr enable use of file system s extended attributes to save the original url and the referer http header value if used be aware that the url might contain private information like access tokens or credentials --force-html when input is read from a file force it to be treated as an html file this enables you to retrieve relative links from existing html files on your local disk by adding base href url to html or using the --base command-line option --base url resolves relative links using url as the point of reference when reading links from an html file specified via the -i --input-file option together with --force-html or when the input file was fetched remotely from a server describing it as html this is equivalent to the presence of a base tag in the html input file with url as the value for the href attribute for instance if you specify http foo bar a html for url and wget reads baz b html from the input file it would be resolved to http foo baz b html --config file specify the location of a startup file you wish to use instead of the default one s use --no-config to disable reading of config files if both --config and --no-config are given --no-config is ignored --rejected-log logfile logs all url rejections to logfile as comma separated values the values include the reason of rejection the url and the parent url it was found in download options --bind-address address when making client tcp ip connections bind to address on the local machine address may be specified as a hostname or ip address this option can be useful if your machine is bound to multiple ips --bind-dns-address address libcares only this address overrides the route for dns requests if you ever need to circumvent the standard settings from etc resolv conf this option together with --dns-servers is your friend address must be specified either as ipv4 or ipv6 address wget needs to be built with libcares for this option to be available --dns-servers addresses libcares only the given address es override the standard nameserver addresses e g as configured in etc resolv conf addresses may be specified either as ipv4 or ipv6 addresses comma- separated wget needs to be built with libcares for this option to be available --tries number set number of tries to number specify 0 or inf for infinite retrying the default is to retry 20 times with the exception of fatal errors like connection refused or not found 404 which are not retried --output-document file the documents will not be written to the appropriate files but all will be concatenated together and written to file if - is used as file documents will be printed to standard output disabling link conversion use - to print to a file literally named - use of -o is not intended to mean simply use the name file instead of the one in the url rather it is analogous to shell redirection wget -o file http foo is intended to work like wget -o - http foo file file will be truncated immediately and all downloaded content will be written there for this reason -n for timestamp-checking is not supported in combination with -o since file is always newly created it will always have a very new timestamp a warning will be issued if this combination is used similarly using -r or -p with -o may not work as you expect wget won t just download the first file to file and then download the rest to their normal names all downloaded content will be placed in file this was disabled in version 1 11 but has been reinstated with a warning in 1 11 2 as there are some cases where this behavior can actually have some use a combination with -nc is only accepted if the given output file does not exist note that a combination with -k is only permitted when downloading a single document as in that case it will just convert all relative uris to external ones -k makes no sense for multiple uris when they re all being downloaded to a single file -k can be used only when the output is a regular file --no-clobber if a file is downloaded more than once in the same directory wget s behavior depends on a few options including -nc in certain cases the local file will be clobbered or overwritten upon repeated download in other cases it will be preserved when running wget without -n -nc -r or -p downloading the same file in the same directory will result in the original copy of file being preserved and the second copy being named file 1 if that file is downloaded yet again the third copy will be named file 2 and so on this is also the behavior with -nd even if -r or -p are in effect when -nc is specified this behavior is suppressed and wget will refuse to download newer copies of file therefore no-clobber is actually a misnomer in this mode---it s not clobbering that s prevented as the numeric suffixes were already preventing clobbering but rather the multiple version saving that s prevented when running wget with -r or -p but without -n -nd or -nc re- downloading a file will result in the new copy simply overwriting the old adding -nc will prevent this behavior instead causing the original version to be preserved and any newer copies on the server to be ignored when running wget with -n with or without -r or -p the decision as to whether or not to download a newer copy of a file depends on the local and remote timestamp and size of the file -nc may not be specified at the same time as -n a combination with -o --output-document is only accepted if the given output file does not exist note that when -nc is specified files with the suffixes html or htm will be loaded from the local disk and parsed as if they had been retrieved from the web --backups backups before over writing a file back up an existing file by adding a 1 suffix 1 on vms to the file name such backup files are rotated to 2 3 and so on up to backups and lost beyond that --no-netrc do not try to obtain credentials from netrc file by default netrc file is searched for credentials in case none have been passed on command line and authentication is required --continue continue getting a partially-downloaded file this is useful when you want to finish up a download started by a previous instance of wget or by another program for instance wget -c ftp sunsite doc ic ac uk ls-lr z if there is a file named ls-lr z in the current directory wget will assume that it is the first portion of the remote file and will ask the server to continue the retrieval from an offset equal to the length of the local file note that you don t need to specify this option if you just want the current invocation of wget to retry downloading a file should the connection be lost midway through this is the default behavior -c only affects resumption of downloads started prior to this invocation of wget and whose local files are still sitting around without -c the previous example would just download the remote file to ls-lr z 1 leaving the truncated ls-lr z file alone if you use -c on a non-empty file and the server does not support continued downloading wget will restart the download from scratch and overwrite the existing file entirely beginning with wget 1 7 if you use -c on a file which is of equal size as the one on the server wget will refuse to download the file and print an explanatory message the same happens when the file is smaller on the server than locally presumably because it was changed on the server since your last download attempt ---because continuing is not meaningful no download occurs on the other side of the coin while using -c any file that s bigger on the server than locally will be considered an incomplete download and only length remote - length local bytes will be downloaded and tacked onto the end of the local file this behavior can be desirable in certain cases---for instance you can use wget -c to download just the new portion that s been appended to a data collection or log file however if the file is bigger on the server because it s been changed as opposed to just appended to you ll end up with a garbled file wget has no way of verifying that the local file is really a valid prefix of the remote file you need to be especially careful of this when using -c in conjunction with -r since every file will be considered as an incomplete download candidate another instance where you ll get a garbled file if you try to use --start-pos offset start downloading at zero-based position offset offset may be expressed in bytes kilobytes with the k suffix or megabytes with the m suffix etc --start-pos has higher precedence over --continue when --start-pos and --continue are both specified wget will emit a warning then proceed as if --continue was absent server support for continued download is required otherwise --start-pos cannot help see -c for details --progress type select the type of the progress indicator you wish to use legal indicators are dot and bar the bar indicator is used by default it draws an ascii progress bar graphics a k a thermometer display indicating the status of retrieval if the output is not a tty the dot bar will be used by default use --progress dot to switch to the dot display it traces the retrieval by printing dots on the screen each dot representing a fixed amount of downloaded data the progress type can also take one or more parameters the parameters vary based on the type selected parameters to type are passed by appending them to the type sperated by a colon like this --progress type parameter1 parameter2 when using the dotted retrieval you may set the style by specifying the type as dot style different styles assign different meaning to one dot with the default style each dot represents 1k there are ten dots in a cluster and 50 dots in a line the binary style has a more computer -like orientation---8k dots 16-dots clusters and 48 dots per line which makes for 384k lines the mega style is suitable for downloading large files---each dot represents 64k retrieved there are eight dots in a cluster and 48 dots on each line so each line contains 3m if mega is not enough then you can use the giga style---each dot represents 1m retrieved there are eight dots in a cluster and 32 dots on each line so each line contains 32m with --progress bar there are currently two possible parameters force and noscroll when the output is not a tty the progress bar always falls back to dot even if --progress bar was passed to wget during invocation this behaviour can be overridden and the bar output forced by using the force parameter as --progress bar force by default the bar style progress bar scroll the name of the file from left to right for the file being downloaded if the filename exceeds the maximum length allotted for its display in certain cases such as with --progress bar force one may not want the scrolling filename in the progress bar by passing the noscroll parameter wget can be forced to display as much of the filename as possible without scrolling through it note that you can set the default style using the progress command in wgetrc that setting may be overridden from the command line for example to force the bar output without scrolling use --progress bar force noscroll --show-progress force wget to display the progress bar in any verbosity by default wget only displays the progress bar in verbose mode one may however want wget to display the progress bar on screen in conjunction with any other verbosity modes like --no-verbose or --quiet this is often a desired a property when invoking wget to download several small large files in such a case wget could simply be invoked with this parameter to get a much cleaner output on the screen this option will also force the progress bar to be printed to stderr when used alongside the --output-file option --timestamping turn on time-stamping --no-if-modified-since do not send if-modified-since header in -n mode send preliminary head request instead this has only effect in -n mode --no-use-server-timestamps don t set the local file s timestamp by the one on the server by default when a file is downloaded its timestamps are set to match those from the remote file this allows the use of --timestamping on subsequent invocations of wget however it is sometimes useful to base the local file s timestamp on when it was actually downloaded for that purpose the --no-use-server-timestamps option has been provided --server-response print the headers sent by http servers and responses sent by ftp servers --spider when invoked with this option wget will behave as a web spider which means that it will not download the pages just check that they are there for example you can use wget to check your bookmarks wget --spider --force-html -i bookmarks html this feature needs much more work for wget to get close to the functionality of real web spiders --timeout seconds set the network timeout to seconds seconds this is equivalent to specifying --dns-timeout --connect-timeout and --read-timeout all at the same time when interacting with the network wget can check for timeout and abort the operation if it takes too long this prevents anomalies like hanging reads and infinite connects the only timeout enabled by default is a 900-second read timeout setting a timeout to 0 disables it altogether unless you know what you are doing it is best not to change the default timeout settings all timeout-related options accept decimal values as well as subsecond values for example 0 1 seconds is a legal though unwise choice of timeout subsecond timeouts are useful for checking server response times or for testing network latency --dns-timeout seconds set the dns lookup timeout to seconds seconds dns lookups that don t complete within the specified time will fail by default there is no timeout on dns lookups other than that implemented by system libraries --connect-timeout seconds set the connect timeout to seconds seconds tcp connections that take longer to establish will be aborted by default there is no connect timeout other than that implemented by system libraries --read-timeout seconds set the read and write timeout to seconds seconds the time of this timeout refers to idle time if at any point in the download no data is received for more than the specified number of seconds reading fails and the download is restarted this option does not directly affect the duration of the entire download of course the remote server may choose to terminate the connection sooner than this option requires the default read timeout is 900 seconds --limit-rate amount limit the download speed to amount bytes per second amount may be expressed in bytes kilobytes with the k suffix or megabytes with the m suffix for example --limit-rate 20k will limit the retrieval rate to 20kb s this is useful when for whatever reason you don t want wget to consume the entire available bandwidth this option allows the use of decimal numbers usually in conjunction with power suffixes for example --limit-rate 2 5k is a legal value note that wget implements the limiting by sleeping the appropriate amount of time after a network read that took less time than specified by the rate eventually this strategy causes the tcp transfer to slow down to approximately the specified rate however it may take some time for this balance to be achieved so don t be surprised if limiting the rate doesn t work well with very small files --wait seconds wait the specified number of seconds between the retrievals use of this option is recommended as it lightens the server load by making the requests less frequent instead of in seconds the time can be specified in minutes using the m suffix in hours using h suffix or in days using d suffix specifying a large value for this option is useful if the network or the destination host is down so that wget can wait long enough to reasonably expect the network error to be fixed before the retry the waiting interval specified by this function is influenced by --random-wait which see --waitretry seconds if you don t want wget to wait between every retrieval but only between retries of failed downloads you can use this option wget will use linear backoff waiting 1 second after the first failure on a given file then waiting 2 seconds after the second failure on that file up to the maximum number of seconds you specify by default wget will assume a value of 10 seconds --random-wait some web sites may perform log analysis to identify retrieval programs such as wget by looking for statistically significant similarities in the time between requests this option causes the time between requests to vary between 0 5 and 1 5 wait seconds where wait was specified using the --wait option in order to mask wget s presence from such analysis a 2001 article in a publication devoted to development on a popular consumer platform provided code to perform this analysis on the fly its author suggested blocking at the class c address level to ensure automated retrieval programs were blocked despite changing dhcp-supplied addresses the --random-wait option was inspired by this ill-advised recommendation to block many unrelated users from a web site due to the actions of one --no-proxy don t use proxies even if the appropriate proxy environment variable is defined --quota quota specify download quota for automatic retrievals the value can be specified in bytes default kilobytes with k suffix or megabytes with m suffix note that quota will never affect downloading a single file so if you specify wget -q10k https example com ls-lr gz all of the ls-lr gz will be downloaded the same goes even when several urls are specified on the command-line the quota is checked only at the end of each downloaded file so it will never result in a partially downloaded file thus you may safely type wget -q2m -i sites---download will be aborted after the file that exhausts the quota is completely downloaded setting quota to 0 or to inf unlimits the download quota --no-dns-cache turn off caching of dns lookups normally wget remembers the ip addresses it looked up from dns so it doesn t have to repeatedly contact the dns server for the same typically small set of hosts it retrieves from this cache exists in memory only a new wget run will contact dns again however it has been reported that in some situations it is not desirable to cache host names even for the duration of a short- running application like wget with this option wget issues a new dns lookup more precisely a new call to gethostbyname or getaddrinfo each time it makes a new connection please note that this option will not affect caching that might be performed by the resolving library or by an external caching layer such as nscd if you don t understand exactly what this option does you probably won t need it --restrict-file-names modes change which characters found in remote urls must be escaped during generation of local filenames characters that are restricted by this option are escaped i e replaced with hh where hh is the hexadecimal number that corresponds to the restricted character this option may also be used to force all alphabetical cases to be either lower- or uppercase by default wget escapes the characters that are not valid or safe as part of file names on your operating system as well as control characters that are typically unprintable this option is useful for changing these defaults perhaps because you are downloading to a non-native partition or because you want to disable escaping of the control characters or you want to further restrict characters to only those in the ascii range of values the modes are a comma-separated set of text values the acceptable values are unix windows nocontrol ascii lowercase and uppercase the values unix and windows are mutually exclusive one will override the other as are lowercase and uppercase those last are special cases as they do not change the set of characters that would be escaped but rather force local file paths to be converted either to lower- or uppercase when unix is specified wget escapes the character and the control characters in the ranges 0--31 and 128--159 this is the default on unix-like operating systems when windows is given wget escapes the characters and the control characters in the ranges 0--31 and 128--159 in addition to this wget in windows mode uses instead of to separate host and port in local file names and uses instead of to separate the query portion of the file name from the rest therefore a url that would be saved as www xemacs org 4300 search pl input blah in unix mode would be saved as www xemacs org 4300 search pl input blah in windows mode this mode is the default on windows if you specify nocontrol then the escaping of the control characters is also switched off this option may make sense when you are downloading urls whose names contain utf-8 characters on a system which can save and display filenames in utf-8 some possible byte values used in utf-8 byte sequences fall in the range of values designated by wget as controls the ascii mode is used to specify that any bytes whose values are outside the range of ascii characters that is greater than 127 shall be escaped this can be useful when saving filenames whose encoding does not match the one used locally --inet4-only --inet6-only force connecting to ipv4 or ipv6 addresses with --inet4-only or --prefer-family none ipv4 ipv6 when given a choice of several addresses connect to the addresses with specified address family first the address order returned by dns is used without change by default this avoids spurious errors and connect attempts when accessing hosts that resolve to both ipv6 and ipv4 addresses from ipv4 networks for example www kame net resolves to 2001 200 0 8002 203 47ff fea5 3085 and to 203 178 141 194 when the preferred family is ipv4 the ipv4 address is used first when the preferred family is ipv6 the ipv6 address is used first if the specified value is none the address order returned by dns is used without change unlike -4 and -6 this option doesn t inhibit access to any address family it only changes the order in which the addresses are accessed also note that the reordering performed by this option is stable---it doesn t affect order of addresses of the same family that is the relative order of all ipv4 addresses and of all ipv6 addresses remains intact in all cases --retry-connrefused consider connection refused a transient error and try again normally wget gives up on a url when it is unable to connect to the site because failure to connect is taken as a sign that the server is not running at all and that retries would not help this option is for mirroring unreliable sites whose servers tend to disappear for short periods of time --user user --password password specify the username user and password password for both ftp and http file retrieval these parameters can be overridden using the --ftp-user and --ftp-password options for ftp connections and the --http-user and --http-password options for http connections --ask-password prompt for a password for each connection established cannot be specified when --password is being used because they are mutually exclusive --use-askpass command prompt for a user and password using the specified command if no command is specified then the command in the environment variable wget askpass is used if wget askpass is not set then the command in the environment variable ssh askpass is used you can set the default command for use-askpass in the wgetrc that setting may be overridden from the command line --no-iri turn off internationalized uri iri support use --iri to turn it on iri support is activated by default you can set the default state of iri support using the iri command in wgetrc that setting may be overridden from the command line --local-encoding encoding force wget to use encoding as the default system encoding that affects how wget converts urls specified as arguments from locale to utf-8 for iri support wget use the function nl langinfo and then the charset environment variable to get the locale if it fails ascii is used you can set the default local encoding using the local encoding command in wgetrc that setting may be overridden from the command line --remote-encoding encoding force wget to use encoding as the default remote server encoding that affects how wget converts uris found in files from remote encoding to utf-8 during a recursive fetch this options is only useful for iri support for the interpretation of non-ascii characters for http remote encoding can be found in http content-type header and in html content-type http-equiv meta tag you can set the default encoding using the remoteencoding command in wgetrc that setting may be overridden from the command line --unlink force wget to unlink file instead of clobbering existing file this option is useful for downloading to the directory with hardlinks directory options --no-directories do not create a hierarchy of directories when retrieving recursively with this option turned on all files will get saved to the current directory without clobbering if a name shows up more than once the filenames will get extensions n --force-directories the opposite of -nd---create a hierarchy of directories even if one would not have been created otherwise e g wget -x http fly srk fer hr robots txt will save the downloaded file to fly srk fer hr robots txt --no-host-directories disable generation of host-prefixed directories by default invoking wget with -r http fly srk fer hr will create a structure of directories beginning with fly srk fer hr this option disables such behavior --protocol-directories use the protocol name as a directory component of local file names for example with this option wget -r http host will save to http host rather than just to host --cut-dirs number ignore number directory components this is useful for getting a fine-grained control over the directory where recursive retrieval will be saved take for example the directory at ftp ftp xemacs org pub xemacs if you retrieve it with -r it will be saved locally under ftp xemacs org pub xemacs while the -nh option can remove the ftp xemacs org part you are still stuck with pub xemacs this is where --cut-dirs comes in handy it makes wget not see number remote directory components here are several examples of how --cut-dirs option works no options - ftp xemacs org pub xemacs -nh - pub xemacs -nh --cut-dirs 1 - xemacs --cut-dirs 1 - ftp xemacs org xemacs if you just want to get rid of the directory structure this option is similar to a combination of -nd and -p however unlike -nd --cut-dirs does not lose with subdirectories---for instance with -nh --cut-dirs 1 a beta subdirectory will be placed to xemacs beta as one would expect --directory-prefix prefix set directory prefix to prefix the directory prefix is the directory where all other files and subdirectories will be saved to i e the top of the retrieval tree the default is the current directory http options --default-page name use name as the default file name when it isn t known i e for urls that end in a slash instead of index html --adjust-extension if a file of type application xhtml xml or text html is downloaded and the url does not end with the regexp hh tt mm ll this option will cause the suffix html to be appended to the local filename this is useful for instance when you re mirroring a remote site that uses asp pages but you want the mirrored pages to be viewable on your stock apache server another good use for this is when you re downloading cgi-generated materials a url like http site com article cgi 25 will be saved as article cgi 25 html note that filenames changed in this way will be re-downloaded every time you re-mirror a site because wget can t tell that the local x html file corresponds to remote url x since it doesn t yet know that the url produces output of type text html or application xhtml xml as of version 1 12 wget will also ensure that any downloaded files of type text css end in the suffix css and the option was renamed from --html-extension to better reflect its new behavior the old option name is still acceptable but should now be considered deprecated as of version 1 19 2 wget will also ensure that any downloaded files with a content-encoding of br compress deflate or gzip end in the suffix br z zlib and gz respectively at some point in the future this option may well be expanded to include suffixes for other types of content including content types that are not parsed by wget --http-user user --http-password password specify the username user and password password on an http server according to the type of the challenge wget will encode them using either the basic insecure the digest or the windows ntlm authentication scheme another way to specify username and password is in the url itself either method reveals your password to anyone who bothers to run ps to prevent the passwords from being seen use the --use-askpass or store them in wgetrc or netrc and make sure to protect those files from other users with chmod if the passwords are really important do not leave them lying in those files either---edit the files and delete them after wget has started the download --no-http-keep-alive turn off the keep-alive feature for http downloads normally wget asks the server to keep the connection open so that when you download more than one document from the same server they get transferred over the same tcp connection this saves time and at the same time reduces the load on the server this option is useful when for some reason persistent keep- alive connections don t work for you for example due to a server bug or due to the inability of server-side scripts to cope with the connections --no-cache disable server-side cache in this case wget will send the remote server appropriate directives cache-control no-cache and pragma no-cache to get the file from the remote service rather than returning the cached version this is especially useful for retrieving and flushing out-of-date documents on proxy servers caching is allowed by default --no-cookies disable the use of cookies cookies are a mechanism for maintaining server-side state the server sends the client a cookie using the set-cookie header and the client responds with the same cookie upon further requests since cookies allow the server owners to keep track of visitors and for sites to exchange this information some consider them a breach of privacy the default is to use cookies however storing cookies is not on by default --load-cookies file load cookies from file before the first http retrieval file is a textual file in the format originally used by netscape s cookies txt file you will typically use this option when mirroring sites that require that you be logged in to access some or all of their content the login process typically works by the web server issuing an http cookie upon receiving and verifying your credentials the cookie is then resent by the browser when accessing that part of the site and so proves your identity mirroring such a site requires wget to send the same cookies your browser sends when communicating with the site this is achieved by --load-cookies---simply point wget to the location of the cookies txt file and it will send the same cookies your browser would send in the same situation different browsers keep textual cookie files in different locations netscape 4 x the cookies are in netscape cookies txt mozilla and netscape 6 x mozilla s cookie file is also named cookies txt located somewhere under mozilla in the directory of your profile the full path usually ends up looking somewhat like mozilla default some-weird-string cookies txt internet explorer you can produce a cookie file wget can use by using the file menu import and export export cookies this has been tested with internet explorer 5 it is not guaranteed to work with earlier versions other browsers if you are using a different browser to create your cookies --load-cookies will only work if you can locate or produce a cookie file in the netscape format that wget expects if you cannot use --load-cookies there might still be an alternative if your browser supports a cookie manager you can use it to view the cookies used when accessing the site you re mirroring write down the name and value of the cookie and manually instruct wget to send those cookies bypassing the official cookie support wget --no-cookies --header cookie name value --save-cookies file save cookies to file before exiting this will not save cookies that have expired or that have no expiry time so-called session cookies but also see --keep-session-cookies --keep-session-cookies when specified causes --save-cookies to also save session cookies session cookies are normally not saved because they are meant to be kept in memory and forgotten when you exit the browser saving them is useful on sites that require you to log in or to visit the home page before you can access some pages with this option multiple wget runs are considered a single browser session as far as the site is concerned since the cookie file format does not normally carry session cookies wget marks them with an expiry timestamp of 0 wget s --load-cookies recognizes those as session cookies but it might confuse other browsers also note that cookies so loaded will be treated as other session cookies which means that if you want --save-cookies to preserve them again you must use --keep-session-cookies again --ignore-length unfortunately some http servers cgi programs to be more precise send out bogus content-length headers which makes wget go wild as it thinks not all the document was retrieved you can spot this syndrome if wget retries getting the same document again and again each time claiming that the otherwise normal connection has closed on the very same byte with this option wget will ignore the content-length header---as if it never existed --header header-line send header-line along with the rest of the headers in each http request the supplied header is sent as-is which means it must contain name and value separated by colon and must not contain newlines you may define more than one additional header by specifying --header more than once wget --header accept-charset iso-8859-2 --header accept-language hr http fly srk fer hr specification of an empty string as the header value will clear all previous user-defined headers as of wget 1 10 this option can be used to override headers otherwise generated automatically this example instructs wget to connect to localhost but to specify foo bar in the host header wget --header host foo bar http localhost in versions of wget prior to 1 10 such use of --header caused sending of duplicate headers --compression type choose the type of compression to be used legal values are auto gzip and none if auto or gzip are specified wget asks the server to compress the file using the gzip compression format if the server compresses the file and responds with the content-encoding header field set appropriately the file will be decompressed automatically if none is specified wget will not ask the server to compress the file and will not decompress any server responses this is the default compression support is currently experimental in case it is turned on please report any bugs to bug-wget gnu org --max-redirect number specifies the maximum number of redirections to follow for a resource the default is 20 which is usually far more than necessary however on those occasions where you want to allow more or fewer this is the option to use --proxy-user user --proxy-password password specify the username user and password password for authentication on a proxy server wget will encode them using the basic authentication scheme security considerations similar to those with --http-password pertain here as well --referer url include referer url header in http request useful for retrieving documents with server-side processing that assume they are always being retrieved by interactive web browsers and only come out properly when referer is set to one of the pages that point to them --save-headers save the headers sent by the http server to the file preceding the actual contents with an empty line as the separator --user-agent agent-string identify as agent-string to the http server the http protocol allows the clients to identify themselves using a user-agent header field this enables distinguishing the www software usually for statistical purposes or for tracing of protocol violations wget normally identifies as wget version version being the current version number of wget however some sites have been known to impose the policy of tailoring the output according to the user-agent -supplied information while this is not such a bad idea in theory it has been abused by servers denying information to clients other than historically netscape or more frequently microsoft internet explorer this option allows you to change the user-agent line issued by wget use of this option is discouraged unless you really know what you are doing specifying empty user agent with --user-agent instructs wget not to send the user-agent header in http requests --post-data string --post-file file use post as the method for all http requests and send the specified data in the request body --post-data sends string as data whereas --post-file sends the contents of file other than that they work in exactly the same way in particular they both expect content of the form key1 value1 key2 value2 with percent- encoding for special characters the only difference is that one expects its content as a command-line parameter and the other accepts its content from a file in particular --post-file is not for transmitting files as form attachments those must appear as key value data with appropriate percent-coding just like everything else wget does not currently support multipart form-data for transmitting post data only application x-www-form-urlencoded only one of --post-data and --post-file should be specified please note that wget does not require the content to be of the form key1 value1 key2 value2 and neither does it test for it wget will simply transmit whatever data is provided to it most servers however expect the post data to be in the above format when processing html forms when sending a post request using the --post-file option wget treats the file as a binary file and will send every character in the post request without stripping trailing newline or formfeed characters any other control characters in the text will also be sent as-is in the post request please be aware that wget needs to know the size of the post data in advance therefore the argument to --post-file must be a regular file specifying a fifo or something like dev stdin won t work it s not quite clear how to work around this limitation inherent in http 1 0 although http 1 1 introduces chunked transfer that doesn t require knowing the request length in advance a client can t use chunked unless it knows it s talking to an http 1 1 server and it can t know that until it receives a response which in turn requires the request to have been completed -- a chicken-and-egg problem note as of version 1 15 if wget is redirected after the post request is completed its behaviour will depend on the response code returned by the server in case of a 301 moved permanently 302 moved temporarily or 307 temporary redirect wget will in accordance with rfc2616 continue to send a post request in case a server wants the client to change the request method upon redirection it should send a 303 see other response code this example shows how to log in to a server using post and then proceed to download the desired pages presumably only accessible to authorized users log in to the server this can be done only once wget --save-cookies cookies txt --post-data user foo password bar http example com auth php now grab the page or pages we care about wget --load-cookies cookies txt --save-cookies to force saving of session cookies --method http-method for the purpose of restful scripting wget allows sending of other http methods without the need to explicitly set them using --header header-line wget will use whatever string is passed to it after --method as the http method to the server --body-data data-string --body-file data-file must be set when additional data needs to be sent to the server along with the method specified using --method --body-data sends string as data whereas --body-file sends the contents of file other than that they work in exactly the same way currently --body-file is not for transmitting files as a whole wget does not currently support multipart form-data for transmitting data only application x-www-form-urlencoded in the future this may be changed so that wget sends the --body-file as a complete file instead of sending its contents to the server please be aware that wget needs to know the contents of body data in advance and hence the argument to --body-file should be a regular file see --post-file for a more detailed explanation only one of --body-data and --body-file should be specified if wget is redirected after the request is completed wget will suspend the current method and send a get request till the redirection is completed this is true for all redirection response codes except 307 temporary redirect which is used to explicitly specify that the request method should not change another exception is when the method is set to post in which case the redirection rules specified under --post-data are followed --content-disposition if this is set to on experimental not fully-functional support for content-disposition headers is enabled this can currently result in extra round-trips to the server for a head request and is known to suffer from a few bugs which is why it is not currently enabled by default this option is useful for some file-downloading cgi programs that use content-disposition headers to describe what the name of a downloaded file should be when combined with --metalink-over-http and --trust-server-names a content-type application metalink4 xml file is named using the content-disposition filename field if available --content-on-error if this is set to on wget will not skip the content when the server responds with a http status code that indicates error --trust-server-names if this is set on a redirect the local file name will be based on the redirection url by default the local file name is based on the original url when doing recursive retrieving this can be helpful because in many web sites redirected urls correspond to an underlying file structure while link urls do not --auth-no-challenge if this option is given wget will send basic http authentication information plaintext username and password for all requests just like wget 1 10 2 and prior did by default use of this option is not recommended and is intended only to support some few obscure servers which never send http authentication challenges but accept unsolicited auth info say in addition to form-based authentication --retry-on-host-error consider host errors such as temporary failure in name resolution as non-fatal transient errors --retry-on-http-error code code consider given http response codes as non-fatal transient errors supply a comma-separated list of 3-digit http response codes as argument useful to work around special circumstances where retries are required but the server responds with an error code normally not retried by wget such errors might be 503 service unavailable and 429 too many requests retries enabled by this option are performed subject to the normal retry timing and retry count limitations of wget using this option is intended to support special use cases only and is generally not recommended as it can force retries even in cases where the server is actually trying to decrease its load please use wisely and only if you know what you are doing https ssl tls options to support encrypted http https downloads wget must be compiled with an external ssl library the current default is gnutls in addition wget also supports hsts http strict transport security if wget is compiled without ssl support none of these options are available --secure-protocol protocol choose the secure protocol to be used legal values are auto sslv2 sslv3 tlsv1 tlsv1 1 tlsv1 2 tlsv1 3 and pfs if auto is used the ssl library is given the liberty of choosing the appropriate protocol automatically which is achieved by sending a tlsv1 greeting this is the default specifying sslv2 sslv3 tlsv1 tlsv1 1 tlsv1 2 or tlsv1 3 forces the use of the corresponding protocol this is useful when talking to old and buggy ssl server implementations that make it hard for the underlying ssl library to choose the correct protocol version fortunately such servers are quite rare specifying pfs enforces the use of the so-called perfect forward security cipher suites in short pfs adds security by creating a one-time key for each ssl connection it has a bit more cpu impact on client and server we use known to be secure ciphers e g no md4 and the tls protocol this mode also explicitly excludes non- pfs key exchange methods such as rsa --https-only when in recursive mode only https links are followed --ciphers set the cipher list string typically this string sets the cipher suites and other ssl tls options that the user wish should be used in a set order of preference gnutls calls it priority string this string will be fed verbatim to the ssl tls engine openssl or gnutls and hence its format and syntax is dependent on that wget will not process or manipulate it in any way refer to the openssl or gnutls documentation for more information --no-check-certificate don t check the server certificate against the available certificate authorities also don t require the url host name to match the common name presented by the certificate as of wget 1 10 the default is to verify the server s certificate against the recognized certificate authorities breaking the ssl handshake and aborting the download if the verification fails although this provides more secure downloads it does break interoperability with some sites that worked with previous wget versions particularly those using self-signed expired or otherwise invalid certificates this option forces an insecure mode of operation that turns the certificate verification errors into warnings and allows you to proceed if you encounter certificate verification errors or ones saying that common name doesn t match requested host name you can use this option to bypass the verification and proceed with the download only use this option if you are otherwise convinced of the site s authenticity or if you really don t care about the validity of its certificate it is almost always a bad idea not to check the certificates when transmitting confidential or important data for self-signed internal certificates you should download the certificate and verify against that instead of forcing this insecure mode if you are really sure of not desiring any certificate verification you can specify --check-certificate quiet to tell wget to not print any warning about invalid certificates albeit in most cases this is the wrong thing to do --certificate file use the client certificate stored in file this is needed for servers that are configured to require certificates from the clients that connect to them normally a certificate is not required and this switch is optional --certificate-type type specify the type of the client certificate legal values are pem assumed by default and der also known as asn1 --private-key file read the private key from file this allows you to provide the private key in a file separate from the certificate --private-key-type type specify the type of the private key accepted values are pem the default and der --ca-certificate file use file as the file with the bundle of certificate authorities ca to verify the peers the certificates must be in pem format without this option wget looks for ca certificates at the system- specified locations chosen at openssl installation time --ca-directory directory specifies directory containing ca certificates in pem format each file contains one ca certificate and the file name is based on a hash value derived from the certificate this is achieved by processing a certificate directory with the c rehash utility supplied with openssl using --ca-directory is more efficient than --ca-certificate when many certificates are installed because it allows wget to fetch certificates on demand without this option wget looks for ca certificates at the system- specified locations chosen at openssl installation time --crl-file file specifies a crl file in file this is needed for certificates that have been revocated by the cas --pinnedpubkey file hashes tells wget to use the specified public key file or hashes to verify the peer this can be a path to a file which contains a single public key in pem or der format or any number of base64 encoded sha256 hashes preceded by sha256 and separated by when negotiating a tls or ssl connection the server sends a certificate indicating its identity a public key is extracted from this certificate and if it does not exactly match the public key s provided to this option wget will abort the connection before sending or receiving any data --random-file file openssl and libressl only use file as the source of random data for seeding the pseudo-random number generator on systems without dev urandom on such systems the ssl library needs an external source of randomness to initialize randomness may be provided by egd see --egd-file below or read from an external source specified by the user if this option is not specified wget looks for random data in randfile or if that is unset in home rnd if you re getting the could not seed openssl prng disabling ssl error you should provide random data using some of the methods described above --egd-file file openssl only use file as the egd socket egd stands for entropy gathering daemon a user-space program that collects data from various unpredictable system sources and makes it available to other programs that might need it encryption software such as the ssl library needs sources of non-repeating randomness to seed the random number generator used to produce cryptographically strong keys openssl allows the user to specify his own source of entropy using the rand file environment variable if this variable is unset or if the specified file does not produce enough randomness openssl will read random data from egd socket specified using this option if this option is not specified and the equivalent startup command is not used egd is never contacted egd is not needed on modern unix systems that support dev urandom --no-hsts wget supports hsts http strict transport security rfc 6797 by default use --no-hsts to make wget act as a non-hsts-compliant ua as a consequence wget would ignore all the strict-transport-security headers and would not enforce any existing hsts policy --hsts-file file by default wget stores its hsts database in wget-hsts you can use --hsts-file to override this wget will use the supplied file as the hsts database such file must conform to the correct hsts database format used by wget if wget cannot parse the provided file the behaviour is unspecified the wget s hsts database is a plain text file each line contains an hsts entry ie a site that has issued a strict-transport-security header and that therefore has specified a concrete hsts policy to be applied lines starting with a dash are ignored by wget please note that in spite of this convenient human-readability hand-hacking the hsts database is generally not a good idea an hsts entry line consists of several fields separated by one or more whitespace hostname sp port sp include subdomains sp created sp max-age the hostname and port fields indicate the hostname and port to which the given hsts policy applies the port field may be zero and it will in most of the cases that means that the port number will not be taken into account when deciding whether such hsts policy should be applied on a given request only the hostname will be evaluated when port is different to zero both the target hostname and the port will be evaluated and the hsts policy will only be applied if both of them match this feature has been included for testing development purposes only the wget testsuite in testenv creates hsts databases with explicit ports with the purpose of ensuring wget s correct behaviour applying hsts policies to ports other than the default ones is discouraged by rfc 6797 see appendix b differences between hsts policy and same- origin policy thus this functionality should not be used in production environments and port will typically be zero the last three fields do what they are expected to the field include subdomains can either be 1 or 0 and it signals whether the subdomains of the target domain should be part of the given hsts policy as well the created and max-age fields hold the timestamp values of when such entry was created first seen by wget and the hsts-defined value max-age which states how long should that hsts policy remain active measured in seconds elapsed since the timestamp stored in created once that time has passed that hsts policy will no longer be valid and will eventually be removed from the database if you supply your own hsts database via --hsts-file be aware that wget may modify the provided file if any change occurs between the hsts policies requested by the remote servers and those in the file when wget exits it effectively updates the hsts database by rewriting the database file with the new entries if the supplied file does not exist wget will create one this file will contain the new hsts entries if no hsts entries were generated no strict-transport-security headers were sent by any of the servers then no file will be created not even an empty one this behaviour applies to the default database file wget-hsts as well it will not be created until some server enforces an hsts policy care is taken not to override possible changes made by other wget processes at the same time over the hsts database before dumping the updated hsts entries on the file wget will re-read it and merge the changes using a custom hsts database and or modifying an existing one is discouraged for more information about the potential security threats arose from such practice see section 14 security considerations of rfc 6797 specially section 14 9 creative manipulation of hsts policy store --warc-file file use file as the destination warc file --warc-header string use string into as the warcinfo record --warc-max-size size set the maximum size of the warc files to size --warc-cdx write cdx index files --warc-dedup file do not store records listed in this cdx file --no-warc-compression do not compress warc files with gzip --no-warc-digests do not calculate sha1 digests --no-warc-keep-log do not store the log file in a warc record --warc-tempdir dir specify the location for temporary files created by the warc writer ftp options --ftp-user user --ftp-password password specify the username user and password password on an ftp server without this or the corresponding startup option the password defaults to -wget normally used for anonymous ftp another way to specify username and password is in the url itself either method reveals your password to anyone who bothers to run ps to prevent the passwords from being seen store them in wgetrc or netrc and make sure to protect those files from other users with chmod if the passwords are really important do not leave them lying in those files either---edit the files and delete them after wget has started the download --no-remove-listing don t remove the temporary listing files generated by ftp retrievals normally these files contain the raw directory listings received from ftp servers not removing them can be useful for debugging purposes or when you want to be able to easily check on the contents of remote server directories e g to verify that a mirror you re running is complete note that even though wget writes to a known filename for this file this is not a security hole in the scenario of a user making listing a symbolic link to etc passwd or something and asking root to run wget in his or her directory depending on the options used either wget will refuse to write to listing making the globbing recursion time-stamping operation fail or the symbolic link will be deleted and replaced with the actual listing file or the listing will be written to a listing number file even though this situation isn t a problem though root should never run wget in a non-trusted user s directory a user could do something as simple as linking index html to etc passwd and asking root to run wget with -n or -r so the file will be overwritten --no-glob turn off ftp globbing globbing refers to the use of shell-like special characters wildcards like and to retrieve more than one file from the same directory at once like wget ftp gnjilux srk fer hr msg by default globbing will be turned on if the url contains a globbing character this option may be used to turn globbing on or off permanently you may have to quote the url to protect it from being expanded by your shell globbing makes wget look for a directory listing which is system-specific this is why it currently works only with unix ftp servers and the ones emulating unix ls output --no-passive-ftp disable the use of the passive ftp transfer mode passive ftp mandates that the client connect to the server to establish the data connection rather than the other way around if the machine is connected to the internet directly both passive and active ftp should work equally well behind most firewall and nat configurations passive ftp has a better chance of working however in some rare firewall configurations active ftp actually works when passive ftp doesn t if you suspect this to be the case use this option or set passive ftp off in your init file --preserve-permissions preserve remote file permissions instead of permissions set by umask --retr-symlinks by default when retrieving ftp directories recursively and a symbolic link is encountered the symbolic link is traversed and the pointed-to files are retrieved currently wget does not traverse symbolic links to directories to download them recursively though this feature may be added in the future when --retr-symlinks no is specified the linked-to file is not downloaded instead a matching symbolic link is created on the local file system the pointed-to file will not be retrieved unless this recursive retrieval would have encountered it separately and downloaded it anyway this option poses a security risk where a malicious ftp server may cause wget to write to files outside of the intended directories through a specially crafted listing file note that when retrieving a file not a directory because it was specified on the command-line rather than because it was recursed to this option has no effect symbolic links are always traversed in this case ftps options --ftps-implicit this option tells wget to use ftps implicitly implicit ftps consists of initializing ssl tls from the very beginning of the control connection this option does not send an auth tls command it assumes the server speaks ftps and directly starts an ssl tls connection if the attempt is successful the session continues just like regular ftps pbsz and prot are sent etc implicit ftps is no longer a requirement for ftps implementations and thus many servers may not support it if --ftps-implicit is passed and no explicit port number specified the default port for implicit ftps 990 will be used instead of the default port for the normal explicit ftps which is the same as that of ftp 21 --no-ftps-resume-ssl do not resume the ssl tls session in the data channel when starting a data connection wget tries to resume the ssl tls session previously started in the control connection ssl tls session resumption avoids performing an entirely new handshake by reusing the ssl tls parameters of a previous session typically the ftps servers want it that way so wget does this by default under rare circumstances however one might want to start an entirely new ssl tls session in every data connection this is what --no-ftps-resume-ssl is for --ftps-clear-data-connection all the data connections will be in plain text only the control connection will be under ssl tls wget will send a prot c command to achieve this which must be approved by the server --ftps-fallback-to-ftp fall back to ftp if ftps is not supported by the target server for security reasons this option is not asserted by default the default behaviour is to exit with an error if a server does not successfully reply to the initial auth tls command or in the case of implicit ftps if the initial ssl tls connection attempt is rejected it is considered that such server does not support ftps recursive retrieval options --recursive turn on recursive retrieving the default maximum depth is 5 --level depth set the maximum number of subdirectories that wget will recurse into to depth in order to prevent one from accidentally downloading very large websites when using recursion this is limited to a depth of 5 by default i e it will traverse at most 5 directories deep starting from the provided url set -l 0 or -l inf for infinite recursion depth wget -r -l 0 http site 1 html ideally one would expect this to download just 1 html but unfortunately this is not the case because -l 0 is equivalent to --delete-after this option tells wget to delete every single file it downloads after having done so it is useful for pre-fetching popular pages through a proxy e g wget -r -nd --delete-after http whatever com popular page the -r option is to retrieve recursively and -nd to not create directories note that --delete-after deletes files on the local machine it does not issue the dele command to remote ftp sites for instance also note that when --delete-after is specified --convert-links is ignored so orig files are simply not created in the first place --convert-links after the download is complete convert the links in the document to make them suitable for local viewing this affects not only the visible hyperlinks but any part of the document that links to external content such as embedded images links to style sheets hyperlinks to non-html content etc each link will be changed in one of the two ways the links to files that have been downloaded by wget will be changed to refer to the file they point to as a relative link example if the downloaded file foo doc html links to bar img gif also downloaded then the link in doc html will be modified to point to bar img gif this kind of transformation works reliably for arbitrary combinations of directories the links to files that have not been downloaded by wget will be changed to include host name and absolute path of the location they point to example if the downloaded file foo doc html links to bar img gif or to bar img gif then the link in doc html will be modified to point to http hostname bar img gif because of this local browsing works reliably if a linked file was downloaded the link will refer to its local name if it was not downloaded the link will refer to its full internet address rather than presenting a broken link the fact that the former links are converted to relative links ensures that you can move the downloaded hierarchy to another directory note that only at the end of the download can wget know which links have been downloaded because of that the work done by -k will be performed at the end of all the downloads --convert-file-only this option converts only the filename part of the urls leaving the rest of the urls untouched this filename part is sometimes referred to as the basename although we avoid that term here in order not to cause confusion it works particularly well in conjunction with --adjust-extension although this coupling is not enforced it proves useful to populate internet caches with files downloaded from different hosts example if some link points to foo com bar cgi xyz with --adjust-extension asserted and its local destination is intended to be foo com bar cgi xyz css then the link would be converted to foo com bar cgi xyz css note that only the filename part has been modified the rest of the url has been left untouched including the net path which would otherwise be processed by wget and converted to the effective scheme ie http --backup-converted when converting a file back up the original version with a orig suffix affects the behavior of -n --mirror turn on options suitable for mirroring this option turns on recursion and time-stamping sets infinite recursion depth and keeps ftp directory listings it is currently equivalent to -r -n -l inf --no-remove-listing --page-requisites this option causes wget to download all the files that are necessary to properly display a given html page this includes such things as inlined images sounds and referenced stylesheets ordinarily when downloading a single html page any requisite documents that may be needed to display it properly are not downloaded using -r together with -l can help but since wget does not ordinarily distinguish between external and inlined documents one is generally left with leaf documents that are missing their requisites for instance say document 1 html contains an img tag referencing 1 gif and an a tag pointing to external document 2 html say that 2 html is similar but that its image is 2 gif and it links to 3 html say this continues up to some arbitrarily high number if one executes the command wget -r -l 2 http site 1 html then 1 html 1 gif 2 html 2 gif and 3 html will be downloaded as you can see 3 html is without its requisite 3 gif because wget is simply counting the number of hops up to 2 away from 1 html in order to determine where to stop the recursion however with this command wget -r -l 2 -p http site 1 html all the above files and 3 html s requisite 3 gif will be downloaded similarly wget -r -l 1 -p http site 1 html will cause 1 html 1 gif 2 html and 2 gif to be downloaded one might think that wget -r -l 0 -p http site 1 html would download just 1 html and 1 gif but unfortunately this is not the case because -l 0 is equivalent to -l inf---that is infinite recursion to download a single html page or a handful of them all specified on the command-line or in a -i url input file and its or their requisites simply leave off -r and -l wget -p http site 1 html note that wget will behave as if -r had been specified but only that single page and its requisites will be downloaded links from that page to external documents will not be followed actually to download a single page and all its requisites even if they exist on separate websites and make sure the lot displays properly locally this author likes to use a few options in addition to -p wget -e -h -k -k -p http site document to finish off this topic it s worth knowing that wget s idea of an external document link is any url specified in an a tag an area tag or a link tag other than link rel stylesheet --strict-comments turn on strict parsing of html comments the default is to terminate comments at the first occurrence of -- according to specifications html comments are expressed as sgml declarations declaration is special markup that begins with and ends with such as doctype that may contain comments between a pair of -- delimiters html comments are empty declarations sgml declarations without any non-comment text therefore --foo-- is a valid comment and so is --one-- --two-- but --1--2-- is not on the other hand most html writers don t perceive comments as anything other than text delimited with -- and -- which is not quite the same for example something like ------------ works as a valid comment as long as the number of dashes is a multiple of four if not the comment technically lasts until the next -- which may be at the other end of the document because of this many popular browsers completely ignore the specification and implement what users have come to expect comments delimited with -- and -- until version 1 9 wget interpreted comments strictly which resulted in missing links in many web pages that displayed fine in browsers but had the misfortune of containing non-compliant comments beginning with version 1 9 wget has joined the ranks of clients that implements naive comments terminating each comment at the first occurrence of -- if for whatever reason you want strict comment parsing use this option to turn it on recursive accept reject options -a acclist --accept acclist --accept-regex urlregex --reject-regex urlregex specify a regular expression to accept or reject the complete url --regex-type regextype specify the regular expression type possible types are posix or pcre note that to be able to use pcre type wget has to be compiled with libpcre support --domains domain-list set domains to be followed domain-list is a comma-separated list of domains note that it does not turn on -h --exclude-domains domain-list specify the domains that are not to be followed --follow-ftp follow ftp links from html documents without this option wget will ignore all the ftp links --follow-tags list wget has an internal table of html tag attribute pairs that it considers when looking for linked documents during a recursive retrieval if a user wants only a subset of those tags to be considered however he or she should be specify such tags in a comma-separated list with this option --ignore-tags list this is the opposite of the --follow-tags option to skip certain html tags when recursively looking for documents to download specify them in a comma-separated list in the past this option was the best bet for downloading a single page and its requisites using a command-line like wget --ignore-tags a area -h -k -k -r http site document however the author of this option came across a page with tags like link rel home href and came to the realization that specifying tags to ignore was not enough one can t just tell wget to ignore link because then stylesheets will not be downloaded now the best bet for downloading a single page and its requisites is the dedicated --page-requisites option --ignore-case ignore case when matching files and directories this influences the behavior of -r -a -i and -x options as well as globbing implemented when downloading from ftp sites for example with this option -a txt will match file1 txt but also file2 txt file3 txt and so on the quotes in the example are to prevent the shell from expanding the pattern --span-hosts enable spanning across hosts when doing recursive retrieving --relative follow relative links only useful for retrieving a specific home page without any distractions not even those from the same hosts --include-directories list specify a comma-separated list of directories you wish to follow when downloading elements of list may contain wildcards --exclude-directories list specify a comma-separated list of directories you wish to exclude from download elements of list may contain wildcards --no-parent do not ever ascend to the parent directory when retrieving recursively this is a useful option since it guarantees that only the files below a certain hierarchy will be downloaded name gnu wget 1 25 0 2024-11-10 wget 1",
  "keywords": [
    "wget",
    "non-interactive",
    "network",
    "downloader.",
    "free",
    "utility",
    "download",
    "web."
  ],
  "complexity": "advanced",
  "hash": "6905072ff4074634",
  "parsedAt": "2025-06-17T19:42:02.925Z",
  "parseVersion": "2.0.0",
  "isCommon": false,
  "hasInteractiveExamples": false,
  "hasDiagrams": false
}