{
  "name": "cal",
  "section": 1,
  "title": "cal manual page",
  "description": "The cal utility displays a simple calendar in traditional format and ncal offers an alternative layout, more options and the date of Easter.",
  "synopsis": "cal [-3hjy] [-A number] [-B number] [[month] year] cal [-3hj] [-A number] [-B number] -m month [year] ncal [-3hjJpwy] [-A number] [-B number] [-s country_code] [[month] year] ncal [-3hJeo] [-A number] [-B number] [year] ncal [-CN] [-H yyyy-mm-dd] [-d yyyy-mm]",
  "category": "User Commands",
  "sections": [
    {
      "id": "name",
      "title": "NAME",
      "content": "macOS 15.5\t\t\t March 7, 2019\t\t\t    macOS 15.5",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     cal, ncal – displays a calendar and the date of Easter\n",
        "     cal [-3hjy] [-A number] [-B number] [[month] year]\n     cal [-3hj] [-A number] [-B number] -m month [year]\n     ncal [-3hjJpwy] [-A number] [-B number] [-s country_code] [[month] year]\n     ncal [-3hJeo] [-A number] [-B number] [year]\n     ncal [-CN] [-H yyyy-mm-dd] [-d yyyy-mm]\n",
        "     The cal utility displays a simple calendar in traditional format and ncal\n     offers an alternative layout, more options and the date of Easter.  The\n     new format is a little cramped but it makes a year fit on a 25x80\n     terminal.\tIf arguments are not specified, the current month is\n     displayed.\n\n     The options are as follows:\n\n     -h      Turns off highlighting of today.\n\n     -J      Display Julian Calendar, if combined with the -e option, display\n\t     date of Easter according to the Julian Calendar.\n\n     -e      Display date of Easter (for western churches).\n\n     -j      Display Julian days (days one-based, numbered from January 1).\n\n     -m month\n\t     Display the specified month.  If month is specified as a decimal\n\t     number, it may be followed by the letter ‘f’ or ‘p’ to indicate\n\t     the following or preceding month of that number, respectively.\n\n     -o      Display date of Orthodox Easter (Greek and Russian Orthodox\n\t     Churches).\n\n     -p      Print the country codes and switching days from Julian to\n\t     Gregorian Calendar as they are assumed by ncal.  The country code\n\t     as determined from the local environment is marked with an\n\t     asterisk.\n\n     -s country_code\n\t     Assume the switch from Julian to Gregorian Calendar at the date\n\t     associated with the country_code.\tIf not specified, ncal tries\n\t     to guess the switch date from the local environment or falls back\n\t     to September 2, 1752.  This was when Great Britain and her\n\t     colonies switched to the Gregorian Calendar.\n\n     -w      Print the number of the week below each week column.\n\n     -y      Display a calendar for the specified year.\n\n     -3      Display the previous, current and next month surrounding today.\n\n     -A number\n\t     Display the number of months after the current month.\n\n     -B number\n\t     Display the number of months before the current month.\n\n     -C      Switch to cal mode.\n\n     -N      Switch to ncal mode.\n\n     -d yyyy-mm\n\t     Use yyyy-mm as the current date (for debugging of date\n\t     selection).\n\n     -H yyyy-mm-dd\n\t     Use yyyy-mm-dd as the current date (for debugging of\n\t     highlighting).\n\n     A single parameter specifies the year (1–9999) to be displayed; note the\n     year must be fully specified: “cal 89” will not display a calendar for\n     1989.  Two parameters denote the month and year; the month is either a\n     number between 1 and 12, or a full or abbreviated name as specified by\n     the current locale.  Month and year default to those of the current\n     system clock and time zone (so “cal -m 8” will display a calendar for the\n     month of August in the current year).\n\n     Not all options can be used together.  For example “-3 -A 2 -B 3 -y -m 7”\n     would mean: show me the three months around the seventh month, three\n     before that, two after that and the whole year.  ncal will warn about\n     these combinations.\n\n     A year starts on January 1.\n\n     Highlighting of dates is disabled if stdout is not a tty.\n",
        "     calendar(3), strftime(3)\n",
        "     The cal utility is compliant with the X/Open System Interfaces option of\n     the IEEE Std 1003.1-2008 (“POSIX.1”) specification.\n\n     The flags [-3hyJeopw], as well as the ability to specify a month name as\n     a single argument, are extensions to that specification.\n\n     The week number computed by -w is compliant with the ISO 8601\n     specification.\n",
        "     A cal command appeared in Version 1 AT&T UNIX.  The ncal command appeared\n     in FreeBSD 2.2.6.\n",
        "     The ncal command and manual were written by Wolfgang Helbig\n     <helbig@FreeBSD.org>.\n",
        "     The assignment of Julian–Gregorian switching dates to country codes is\n     historically naive for many countries.\n\n     Not all options are compatible and using them in different orders will\n     give varying results.\n\n     It is not possible to display Monday as the first day of the week with\n     cal.\n"
      ]
    }
  ],
  "flags": [
    {
      "flag": "-h",
      "description": "Turns off highlighting of today."
    },
    {
      "flag": "-J",
      "description": "Display Julian Calendar, if combined with the -e option, display date of Easter according to the Julian Calendar."
    },
    {
      "flag": "-e",
      "description": "Display date of Easter (for western churches)."
    },
    {
      "flag": "-j",
      "description": "Display Julian days (days one-based, numbered from January 1)."
    },
    {
      "flag": "-m",
      "description": " Display the specified month.  If month is specified as a decimal number, it may be followed by the letter ‘f’ or ‘p’ to indicate the following or preceding month of that number, respectively.",
      "optional": false
    },
    {
      "flag": "-o",
      "description": "Display date of Orthodox Easter (Greek and Russian Orthodox Churches)."
    },
    {
      "flag": "-p",
      "description": "Print the country codes and switching days from Julian to Gregorian Calendar as they are assumed by ncal.  The country code as determined from the local environment is marked with an asterisk."
    },
    {
      "flag": "-s",
      "description": " Assume the switch from Julian to Gregorian Calendar at the date associated with the country_code.\tIf not specified, ncal tries to guess the switch date from the local environment or falls back to September 2, 1752.  This was when Great Britain and her colonies switched to the Gregorian Calendar.",
      "optional": true
    },
    {
      "flag": "-w",
      "description": "Print the number of the week below each week column."
    },
    {
      "flag": "-y",
      "description": "Display a calendar for the specified year."
    },
    {
      "flag": "-3",
      "description": "Display the previous, current and next month surrounding today."
    },
    {
      "flag": "-A",
      "description": " Display the number of months after the current month.",
      "optional": true
    },
    {
      "flag": "-B",
      "description": " Display the number of months before the current month.",
      "optional": true
    },
    {
      "flag": "-C",
      "description": "Switch to cal mode."
    },
    {
      "flag": "-N",
      "description": "Switch to ncal mode."
    },
    {
      "flag": "-d",
      "description": " Use yyyy-mm as the current date (for debugging of date selection).",
      "optional": true
    },
    {
      "flag": "-H",
      "description": " Use yyyy-mm-dd as the current date (for debugging of highlighting). A single parameter specifies the year (1–9999) to be displayed; note the year must be fully specified: “cal 89” will not display a calendar for 1989.  Two parameters denote the month and year; the month is either a number between 1 and 12, or a full or abbreviated name as specified by the current locale.  Month and year default to those of the current system clock and time zone (so “cal -m 8” will display a calendar for the month of August in the current year). Not all options can be used together.  For example “-3 -A 2 -B 3 -y -m 7” would mean: show me the three months around the seventh month, three before that, two after that and the whole year.  ncal will warn about these combinations. A year starts on January 1. Highlighting of dates is disabled if stdout is not a tty. SEE ALSO calendar(3), strftime(3)",
      "optional": true
    }
  ],
  "examples": [],
  "relatedCommands": [
    "calendar",
    "strftime",
    "cal",
    "ncal",
    "displays",
    "date",
    "number",
    "month",
    "year",
    "country_code",
    "yyyy-mm-dd",
    "yyyy-mm",
    "utility",
    "simple",
    "traditional"
  ],
  "seeAlso": [
    {
      "name": "calendar",
      "section": 3
    },
    {
      "name": "strftime",
      "section": 3
    }
  ],
  "metadata": {},
  "searchContent": "cal cal manual page the cal utility displays a simple calendar in traditional format and ncal offers an alternative layout more options and the date of easter cal -3hjy -a number -b number month year cal -3hj -a number -b number -m month year ncal -3hjjpwy -a number -b number -s country code month year ncal -3hjeo -a number -b number year ncal -cn -h yyyy-mm-dd -d yyyy-mm cal manual page utility displays simple calendar traditional format ncal offers alternative layout more options date easter -h turns off highlighting of today -j display julian calendar if combined with the -e option display date of easter according to the julian calendar -e display date of easter for western churches -j display julian days days one-based numbered from january 1 -m display the specified month if month is specified as a decimal number it may be followed by the letter f or p to indicate the following or preceding month of that number respectively -o display date of orthodox easter greek and russian orthodox churches -p print the country codes and switching days from julian to gregorian calendar as they are assumed by ncal the country code as determined from the local environment is marked with an asterisk -s assume the switch from julian to gregorian calendar at the date associated with the country code if not specified ncal tries to guess the switch date from the local environment or falls back to september 2 1752 this was when great britain and her colonies switched to the gregorian calendar -w print the number of the week below each week column -y display a calendar for the specified year -3 display the previous current and next month surrounding today -a display the number of months after the current month -b display the number of months before the current month -c switch to cal mode -n switch to ncal mode -d use yyyy-mm as the current date for debugging of date selection -h use yyyy-mm-dd as the current date for debugging of highlighting a single parameter specifies the year 1 9999 to be displayed note the year must be fully specified cal 89 will not display a calendar for 1989 two parameters denote the month and year the month is either a number between 1 and 12 or a full or abbreviated name as specified by the current locale month and year default to those of the current system clock and time zone so cal -m 8 will display a calendar for the month of august in the current year not all options can be used together for example -3 -a 2 -b 3 -y -m 7 would mean show me the three months around the seventh month three before that two after that and the whole year ncal will warn about these combinations a year starts on january 1 highlighting of dates is disabled if stdout is not a tty see also calendar 3 strftime 3 name macos 15 5 march 7 2019 macos 15 5",
  "keywords": [
    "cal",
    "manual",
    "page",
    "utility",
    "displays",
    "simple",
    "calendar",
    "traditional",
    "format",
    "ncal",
    "offers",
    "alternative",
    "layout,",
    "more",
    "options",
    "date",
    "easter."
  ],
  "complexity": "intermediate",
  "hash": "14d6f8e9e0ae7d71",
  "parsedAt": "2025-06-17T19:41:54.053Z",
  "parseVersion": "2.0.0",
  "isCommon": false,
  "hasInteractiveExamples": false,
  "hasDiagrams": false
}