{
  "name": "id",
  "section": 1,
  "title": "id manual page",
  "description": "The id utility displays the user and group names and numeric IDs, of the calling process, to the standard output.",
  "synopsis": "id [user] id -A id -F [user] id -G [-n] [user] id -P [user] id -g [-nr] [user] id -p [user] id -u [-nr] [user]",
  "category": "User Commands",
  "sections": [
    {
      "id": "name",
      "title": "NAME",
      "content": "macOS 15.5\t\t\t March 5, 2011\t\t\t    macOS 15.5",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     id – return user identity\n",
        "     id [user]\n     id -A\n     id -F [user]\n     id -G [-n] [user]\n     id -P [user]\n     id -g [-nr] [user]\n     id -p [user]\n     id -u [-nr] [user]\n",
        "     The id utility displays the user and group names and numeric IDs, of the\n     calling process, to the standard output.  If the real and effective IDs\n     are different, both are displayed, otherwise only the real ID is\n     displayed.\n\n     If a user (login name or user ID) is specified, the user and group IDs of\n     that user are displayed.  In this case, the real and effective IDs are\n     assumed to be the same.\n\n     The options are as follows:\n\n     -A      Display the process audit user ID and other process audit\n\t     properties, which requires privilege.\n\n     -F      Display the full name of the user.\n\n     -G      Display the different group IDs (effective, real and\n\t     supplementary) as white-space separated numbers, in no particular\n\t     order.\n\n     -P      Display the id as a password file entry.\n\n     -a      Ignored for compatibility with other id implementations.\n\n     -g      Display the effective group ID as a number.\n\n     -n      Display the name of the user or group ID for the -G, -g and -u\n\t     options instead of the number.  If any of the ID numbers cannot\n\t     be mapped into names, the number will be displayed as usual.\n\n     -p      Make the output human-readable.  If the user name returned by\n\t     getlogin(2) is different from the login name referenced by the\n\t     user ID, the name returned by getlogin(2) is displayed, preceded\n\t     by the keyword “login”.  The user ID as a name is displayed,\n\t     preceded by the keyword “uid”.  If the effective user ID is\n\t     different from the real user ID, the real user ID is displayed as\n\t     a name, preceded by the keyword “euid”.  If the effective group\n\t     ID is different from the real group ID, the real group ID is\n\t     displayed as a name, preceded by the keyword “rgid”.  The list of\n\t     groups to which the user belongs is then displayed as names,\n\t     preceded by the keyword “groups”.\tEach display is on a separate\n\t     line.\n\n     -r      Display the real ID for the -g and -u options instead of the\n\t     effective ID.\n\n     -u      Display the effective user ID as a number.\n",
        "     The id utility exits 0 on success, and >0 if an error occurs.\n",
        "     Show information for the user ‘bob’ as a password file entry:\n\n\t   $ id -P bob\n\t   bob:*:0:0::0:0:Robert:/bob:/usr/local/bin/bash\n\n     Same output as groups(1) for the root user:\n\n\t   $ id -Gn root\n\t   wheel operator\n\n     Show human readable information about ‘alice’:\n\n\t   $ id -p alice\n\t   uid\t   alice\n\t   groups  alice webcamd vboxusers\n\n     Assuming the user ‘bob’ executed “su -l” to simulate a root login,\n     compare the result of the following commands:\n\n\t   # id -un\n\t   root\n\t   # who am i\n\t   bob\t\tpts/5\t     Dec  4 19:51\n",
        "     groups(1), who(1)\n",
        "     The id function is expected to conform to IEEE Std 1003.2 (“POSIX.2”).\n",
        "     The historic groups(1) command is equivalent to “id -Gn [user]”.\n\n     The historic whoami(1) command is equivalent to “id -un”.\n\n     The id command appeared in 4.4BSD.\n"
      ]
    }
  ],
  "flags": [
    {
      "flag": "-A",
      "description": " properties, which requires privilege.",
      "optional": false
    },
    {
      "flag": "-F",
      "description": "",
      "argument": "user",
      "optional": false
    },
    {
      "flag": "-G",
      "description": " supplementary) as white-space separated numbers, in no particular order.",
      "argument": "-n",
      "optional": false
    },
    {
      "flag": "-P",
      "description": "",
      "argument": "user",
      "optional": false
    },
    {
      "flag": "-a",
      "description": "Ignored for compatibility with other id implementations."
    },
    {
      "flag": "-g",
      "description": "",
      "argument": "-nr",
      "optional": false
    },
    {
      "flag": "-n",
      "description": "Display the name of the user or group ID for the -G, -g and -u options instead of the number.  If any of the ID numbers cannot be mapped into names, the number will be displayed as usual."
    },
    {
      "flag": "-p",
      "description": " getlogin(2) is different from the login name referenced by the user ID, the name returned by getlogin(2) is displayed, preceded by the keyword “login”.  The user ID as a name is displayed, preceded by the keyword “uid”.  If the effective user ID is different from the real user ID, the real user ID is displayed as a name, preceded by the keyword “euid”.  If the effective group ID is different from the real group ID, the real group ID is displayed as a name, preceded by the keyword “rgid”.  The list of groups to which the user belongs is then displayed as names, preceded by the keyword “groups”.\tEach display is on a separate line.",
      "argument": "user",
      "optional": false
    },
    {
      "flag": "-r",
      "description": "Display the real ID for the -g and -u options instead of the effective ID."
    },
    {
      "flag": "-u",
      "description": " EXIT STATUS The id utility exits 0 on success, and >0 if an error occurs.",
      "argument": "-nr",
      "optional": false
    }
  ],
  "examples": [
    {
      "command": "id -P bob",
      "description": "bob:*:0:0::0:0:Robert:/bob:/usr/local/bin/bash",
      "tags": [],
      "output": "\t   bob:*:0:0::0:0:Robert:/bob:/usr/local/bin/bash\n     Same output as groups(1) for the root user:\n"
    },
    {
      "command": "id -Gn root",
      "description": "wheel operator",
      "tags": [],
      "output": "\t   wheel operator\n     Show human readable information about ‘alice’:\n"
    },
    {
      "command": "id -p alice",
      "description": "uid\t   alice",
      "tags": [],
      "output": "\t   uid\t   alice\n\t   groups  alice webcamd vboxusers\n     Assuming the user ‘bob’ executed “su -l” to simulate a root login,\n     compare the result of the following commands:\n\t   # id -un\n\t   root\n\t   # who am i\n\t   bob\t\tpts/5\t     Dec  4 19:51\nSEE ALSO\n     groups(1), who(1)\n"
    }
  ],
  "relatedCommands": [
    "groups",
    "who",
    "return",
    "identity",
    "utility",
    "displays",
    "group",
    "names",
    "numeric",
    "calling",
    "process",
    "standard",
    "output",
    "real",
    "effective"
  ],
  "seeAlso": [
    {
      "name": "groups",
      "section": 1
    },
    {
      "name": "who",
      "section": 1
    }
  ],
  "metadata": {},
  "searchContent": "id id manual page the id utility displays the user and group names and numeric ids of the calling process to the standard output id user id -a id -f user id -g -n user id -p user id -g -nr user id -p user id -u -nr user id manual page utility displays group names numeric ids calling process standard output -a properties which requires privilege -f -g supplementary as white-space separated numbers in no particular order -p -a ignored for compatibility with other id implementations -g -n display the name of the user or group id for the -g -g and -u options instead of the number if any of the id numbers cannot be mapped into names the number will be displayed as usual -p getlogin 2 is different from the login name referenced by the user id the name returned by getlogin 2 is displayed preceded by the keyword login the user id as a name is displayed preceded by the keyword uid if the effective user id is different from the real user id the real user id is displayed as a name preceded by the keyword euid if the effective group id is different from the real group id the real group id is displayed as a name preceded by the keyword rgid the list of groups to which the user belongs is then displayed as names preceded by the keyword groups each display is on a separate line -r display the real id for the -g and -u options instead of the effective id -u exit status the id utility exits 0 on success and 0 if an error occurs id -p bob bob 0 0 0 0 robert bob usr local bin bash id -gn root wheel operator id -p alice uid alice name macos 15 5 march 5 2011 macos 15 5",
  "keywords": [
    "id",
    "manual",
    "page",
    "utility",
    "displays",
    "group",
    "names",
    "numeric",
    "ids,",
    "calling",
    "process,",
    "standard",
    "output."
  ],
  "complexity": "intermediate",
  "hash": "e49ddccfacdef5b3",
  "parsedAt": "2025-06-17T19:42:09.016Z",
  "parseVersion": "2.0.0",
  "isCommon": false,
  "hasInteractiveExamples": true,
  "hasDiagrams": false
}