{
  "name": "rsync",
  "section": 1,
  "title": "rsync manual page",
  "description": "The openrsync utility synchronises files in the destination directory with one or more source files.",
  "synopsis": "openrsync [-0468BCDEFHILOPRSTWVabcdefghiklmnopqrtuvxyz] [-e program] [-f filter] [--address=sourceaddr] [--append] [--backup-dir=directory] [--bwlimit=limit] [--cache | --no-cache] [--checksum-seed=NUM] [--chmod=MODE] [--compare-dest=directory] [--compress-level=NUM] [--contimeout=seconds] [--copy-dest=directory] [--copy-unsafe-links] [--del] [--delay-updates] [--delete-before] [--delete-during] [--delete-delay] [--delete-after] [--delete-excluded] [--exclude pattern] [--exclude-from=file] [--extended-attributes] [--files-from=filespec] [--force] [--ignore-errors] [--ignore-existing] [--ignore-non-existing] [--include pattern] [--include-from=file] [--inplace] [--keep-dirlinks] [--link-dest=directory] [--list-only] [--max-delete=MAX] [--max-size=size] [--min-size=size] [--modify-window=sec] [--no-implied-dirs] [--no-motd] [--numeric-ids] [--partial] [--partial-dir=DIR] [--password-file=pwfile] [--port=service] [--progress=VER] [--protocol] [--read-batch=file] [--remove-source-files] [--rsync-path=program] [--safe-links] [--size-only] [--sockopts=sockopts] [--specials] [--stats] [--suffix=suffix] [--super] [--timeout=seconds] [--only-write-batch=file | --write-batch=file] source ... directory openrsync --daemon [-46hv] [--address=bindaddr] [--bwlimit=bwlimit] [--config=configfile] [--no-detach] [--log-file=logfile] [--port=service] [--sockopts=sockopts]",
  "category": "User Commands",
  "sections": [
    {
      "id": "name",
      "title": "NAME",
      "content": "macOS 15.5\t\t\t June 17, 2025\t\t\t    macOS 15.5",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     openrsync – synchronise local and remote files\n",
        "     openrsync [-0468BCDEFHILOPRSTWVabcdefghiklmnopqrtuvxyz] [-e program]\n\t       [-f filter] [--address=sourceaddr] [--append]\n\t       [--backup-dir=directory] [--bwlimit=limit]\n\t       [--cache | --no-cache] [--checksum-seed=NUM] [--chmod=MODE]\n\t       [--compare-dest=directory] [--compress-level=NUM]\n\t       [--contimeout=seconds] [--copy-dest=directory]\n\t       [--copy-unsafe-links] [--del] [--delay-updates]\n\t       [--delete-before] [--delete-during] [--delete-delay]\n\t       [--delete-after] [--delete-excluded] [--exclude pattern]\n\t       [--exclude-from=file] [--extended-attributes]\n\t       [--files-from=filespec] [--force] [--ignore-errors]\n\t       [--ignore-existing] [--ignore-non-existing] [--include pattern]\n\t       [--include-from=file] [--inplace] [--keep-dirlinks]\n\t       [--link-dest=directory] [--list-only] [--max-delete=MAX]\n\t       [--max-size=size] [--min-size=size] [--modify-window=sec]\n\t       [--no-implied-dirs] [--no-motd] [--numeric-ids] [--partial]\n\t       [--partial-dir=DIR] [--password-file=pwfile] [--port=service]\n\t       [--progress=VER] [--protocol] [--read-batch=file]\n\t       [--remove-source-files] [--rsync-path=program] [--safe-links]\n\t       [--size-only] [--sockopts=sockopts] [--specials] [--stats]\n\t       [--suffix=suffix] [--super] [--timeout=seconds]\n\t       [--only-write-batch=file | --write-batch=file] source ...\n\t       directory\n\n     openrsync --daemon [-46hv] [--address=bindaddr] [--bwlimit=bwlimit]\n\t       [--config=configfile] [--no-detach] [--log-file=logfile]\n\t       [--port=service] [--sockopts=sockopts]\n",
        "     The openrsync utility synchronises files in the destination directory\n     with one or more source files.  Either the source or the destination\n     directory may be remote, but not both.  The arguments are as follows:\n\n     -4, --ipv4\n\t     Use IPv4 when connecting to a remote host, or binding to a local\n\t     address.  If openrsync is configured to use an --rsh program\n\t     named “ssh”, then it will pass -4 to it.\n\n     -6, --ipv6\n\t     Use IPv6 when connecting to a remote host, or binding to a local\n\t     address.  As with the -4 option, openrsync will pass -6 to the\n\t     --rsh program if it is named “ssh”.\n\n     -8, --8-bit-output\n\t     Do not escape high-bit characters in the output (which is\n\t     otherwise the default).\n\n     -a, --archive\n\t     Shorthand for -Dgloprt.\n\n     --address=sourceaddr\n\t     When connecting to an rsync daemon, use sourceaddr as the source\n\t     address for connections, which is useful on machines with\n\t     multiple interfaces.\n\n     --append\n\t     If the destination file exists and is shorter than the source\n\t     file then rsync will append the difference to the destination\n\t     file.  If after the transfer the whole-file checksums do not\n\t     match then the destination file will be updated via the usual\n\t     block-based delta-merge protocol.\tThis option implies --inplace.\n\n     -b, --backup\n\t     Make a backup of changed files with ~ suffix.\n\n     --backup-dir directory\n\t     When combined with the --backup flag, openrsync will store\n\t     backups of files being replaced in the designated backup\n\t     directory on the receiving side.  Can be combined with the\n\t     --suffix flag to name the backup files with a suffix.  The\n\t     default is to not append a suffix.\n\n\t     If specified as a relative path, the backup directory will be\n\t     contained within the copied tree, and may cause conflicts or be\n\t     subject to --delete rules.  It is advised to use an absolute path\n\t     outside of the copied tree, or a relative path such as \"../\".\n\n     -B, --block-size=BLOCKSIZE\n\t     Specify the block size to be used for file transfers.  The upper\n\t     bound is 512M, but it is enforced only if a differential transfer\n\t     is required.\n\n     --blocking-io\n\t     This flag is ignored by openrsync, but is accepted for\n\t     compatibility.\n\n     --bwlimit limit\n\t     Limit transfer speed to limit bytes/sec.  The limit may also\n\t     contain any of the suffixes described in the --max-size\n\t     definition of size.\n\n     --cache\n\t     Use the operating system buffer cache when reading and writing\n\t     files.  This is the default on all operating systems except\n\t     macOS, where openrsync sets F_NOCACHE by default to limit memory\n\t     growth.  Setting this option will enabling caching by not setting\n\t     any flags.\n\n     --no-cache\n\t     Sets O_DIRECT when reading and writing files to avoid using the\n\t     buffer cache.  Setting this option can avoid filling the cache\n\t     with files that will not be read again, such as during a backup.\n\t     This is the default on macOS, where F_NOCACHE is used instead of\n\t     O_DIRECT.\n\n     -c, --checksum\n\t     Use full-file checksums to determine which files have changed and\n\t     should be transferred, rather than the usual file size and\n\t     modification time \"quick check\".\n\n     --checksum-seed=NUM\n\t     Use NUM as the seed for both the 4-byte block and MD4 file\n\t     checksums.  By default, NUM is randomly generated, but if set to\n\t     zero directs openrsync to use time(3) as the checksum seed.\n\n     --chmod=MODE\n\t     Modify the permissions on files that are transferred, overriding\n\t     the original source permissions.  Only has an effect if --perms\n\t     is specified as well.  The MODE string can be a comma separated\n\t     list of literal (755) or relative (g+w) permissions.\n\n\t     openrsync also supports two additional extensions to relative\n\t     permissions, adding a ‘D’ or ‘F’ infront of the relative\n\t     permissions will apply the changes to only directories or files\n\t     respectively.  For example: -chmod=Dg+w,Fo-w\n\n     --compare-dest=directory\n\t     Use directory as an alternate base directory to compare files\n\t     against on the destination machine.  If file in directory is\n\t     found and identical to the sender's file, the file will not be\n\t     transferred.  Multiple --compare-dest directories may be\n\t     provided.\tIf directory is a relative path, it is relative to the\n\t     destination directory.\n\n     -z, --compress\n\t     Compress file data during transfer to reduce the amount of data\n\t     transferred.\n\n     --compress-level=NUM\n\t     Set the compression level used by --compress.\n\n     --contimeout=seconds\n\t     Set the connection timeout in seconds.  Exit if no connection\n\t     established within the specified time.  The default is 0, which\n\t     means no timeout.\n\n     --copy-dest=directory\n\t     Use directory as an alternate base directory to compare files\n\t     against on the destination machine.  If file in directory is\n\t     found and identical to the sender's file, the file will be\n\t     locally copied.  Multiple --copy-dest directories may be\n\t     provided.\tIf directory is a relative path, it is relative to the\n\t     destination directory.\n\n     -L, --copy-links\n\t     Copy targets of symbolic links, rather than the link itself.\n\n     --copy-unsafe-links\n\t     Copy targets of symbolic links that are unsafe (absolute symlinks\n\t     or where the target reaches outside the copied tree).\n\n     -k, --copy-dirlinks\n\t     Copy targets of symbolic links that point to directories only.\n\n     -C, --cvs-exclude\n\t     Exclude a common list of files as CVS would.  The patterns\n\t     deployed are specifically:\n\n\t\t   RCS\t\t  SCCS\t\t  CVS\t   CVS.adm\n\t\t   RCSLOG\t  cvslog.*\t  tags\t   TAGS\n\t\t   .make.state\t  .nse_depinfo\t  *~\t   #*\n\t\t   .#*\t\t  ,*\t\t  _$*\t   *$\n\t\t   *.old\t  *.bak \t  *.BAK    *.orig\n\t\t   *.rej\t  .del-*\t  *.a\t   *.olb\n\t\t   *.o\t\t  *.obj \t  *.so\t   *.exe\n\t\t   *.Z\t\t  *.elc \t  *.ln\t   core\n\t\t   .svn/\n\t     Followed by any patterns included in $HOME/.cvsignore and the\n\t     CVSIGNORE environment variable.\n\n\t     The -C flag also adds a “dir-merge” CVS rule to include per-dir\n\t     .cvsignore files.\tAll of these rules are appended to the end of\n\t     the filter list with the equivalent of specifying -f “-C” -f\n\t     “:C”.\n\n     -D      Also transfer device and special files.  Shorthand for --devices\n\t     --specials.\n\n     --del, --delete\n\t     Delete files in directory not found in source directories.  Only\n\t     applicable with -r.\n\n     --delay-updates\n\t     Delay updates of (only) plain files until all other operations\n\t     are complete.  This is done to be more atomic.  Requires extra\n\t     space in the destination directory up to the amount of the whole\n\t     tree.\n\n     --delete-before\n\t     Execute the above described --delete behavior before the transfer\n\t     begins.  This is the default timing when\n\n     --delete\n\t     is used.  This option is mutually exclusive with --delete-during,\n\t     --delete-delay, and --delete-after.\n\n     --delete-during\n\t     Execute the above described --delete behavior as the transfer\n\t     happens, right before each directory to be transferred is checked\n\t     for updates.  This option is mutually exclusive with\n\t     --delete-before, --delete-delay, and --delete-after.\n\n     --delete-delay\n\t     Execute the above described --delete behavior after the transfer\n\t     happens, but collect the list to be deleted right before each\n\t     directory to be transferred is checked for updates.  This option\n\t     is mutually exclusive with --delete-before, --delete-during, and\n\t     --delete-after.\n\n     --delete-after\n\t     Execute the above described --delete behavior after the transfer\n\t     has completed.  This option is mutually exclusive with\n\t     --delete-before, --delete-during, and --delete-delay.\n\n     --delete-excluded\n\t     When used in combination with any one of the above --delete\n\t     options, supplied --exclude patterns will not prevent a file from\n\t     being deleted.\n\n     -d, --dirs\n\t     Copies directories, which are normally skipped unless --recursive\n\t     is specified.  Directory contents are not copied, unless the path\n\t     specified includes a trailing slash (“dir/”), or is the literal\n\t     “.”.\n\n     --exclude pattern\n\t     Exclude files matching pattern.\n\n     --exclude-from=file\n\t     Load patterns and rules from file.\n\n     --extended-attributes\n\t     Apple specific option to copy extended attributes, resource\n\t     forks, and ACLs.  Requires at least Mac OS X 10.4 or suitably\n\t     patched rsync.\n\n     -E, --executability\n\t     Preserve the executability of regular files (i.e., a file is\n\t     \"executable\" if at least one 'x' mode bit is enabled in its\n\t     permissions).  If the source file is executable, then for each\n\t     'r' mode bit enabled in the destination file's permissions, the\n\t     corresponding 'x' mode bit will be enabled.  If the source file\n\t     is not executable then all ugo 'x' mode bits of the destination\n\t     file will be disabled.  This option has no effect if --perms is\n\t     also specified.\n\n     -0, --from0\n\t     Use a null ('\\0') character, rather than a newline to separate\n\t     filenames read from: --exclude-from, --include-from,\n\t     --files-from, and any merged files specified in --filter rules.\n\t     Does not affect --cvs-exclude.\n\n     --files-from=filespec\n\t     Load list of files to transfer (as opposed to the command line)\n\t     from filespec.  Filespec can be of the form hostname:port:path.\n\n     --force\n\t     Force deletion of non-empty directories about to be replaced by a\n\t     non-directory.  This option has no effect if any of the --delete\n\t     options are present.\n\n     --ignore-errors\n\t     Works in conjunction with --delete to delete files despite I/O\n\t     errors.\n\n     -y, --fuzzy\n\t     Look for files in the destination directory that might be the\n\t     same to use as a basis to avoid copying the entire file.  The\n\t     first file with an identical size and modification time is used\n\t     to try to reduce the total amount of data that has to be\n\t     transferred.\n\n\t     Note that the use of the --delete option might get rid of any\n\t     potential fuzzy-matches, so either use --delete-after or specify\n\t     some exclusions to prevent this.\n\n     --ignore-existing\n\t     Ignore files that already exist.\n\n     --ignore-non-existing, --existing\n\t     Ignore files that do not already exist (do not create them).\n\n     -I, --ignore-times\n\t     Do not skip based on file size and modification time.\n\n     --include pattern\n\t     Include files matching pattern.\n\n     --include-from=file\n\t     Load patterns and rules from file.\n\n     --devices\n\t     Also transfer device files.\n\n     -e program, --rsh=program\n\t     Specify alternative communication program, defaults to ssh(1).\n\t     The RSYNC_RSH environment variable will be used if an -e option\n\t     is not present.  Note that openrsync will generally handle\n\t     quotes, but it makes no attempt to deal with escape sequences.\n\t     In particular, escaped quotation marks will not be escaped.\n\n     -F      Adds a standard .rsync-filter dir-merge filter rule.\n\t     Specifically, -F will add “: /.rsync-filter” the first time it is\n\t     seen, and “- .rsync-filter” the second time it is seen.\n\t     Subsequent uses have no effect.\n\n     -f filter, --filter=filter\n\t     Process filter against the global filter chain.  The specified\n\t     filter may be a rule to include a filter file, or to include a\n\t     per-directory filter file.  Regular filter files are processed\n\t     immediately, while per-directory filter files are processed as\n\t     directories are encountered.  See PATTERNS AND RULES for more\n\t     details about the syntax and capabilities of openrsync filters.\n\n     -g, --group\n\t     Set the group name to match the source.  For example, group\n\t     \"kristaps\" with ID 1000 on a remote server is matched to group\n\t     \"kristaps\" on the local machine with ID 2000.  If --numeric-ids\n\t     is also given or if the remote group name is unknown on the local\n\t     machine, set the numeric group ID to match the source instead.\n\n     -H, --hard-links\n\t     Attempt to preserve hard links within the list of files\n\t     transferred.\n\n     -h, --human-readable\n\t     Display numbers of bytes in human readable units.\tIf specified\n\t     once, uses units of 1000, if specified twice uses units of 1024.\n\n     --help  Print a brief description of all options.\n\n     -l, --links\n\t     Also transfer symbolic links.  The link is transferred as a\n\t     standalone file: if the destination does not exist, it will be\n\t     broken.\n\n     --inplace\n\t     Avoid creating temporary files, instead operating on files\n\t     directly in place in the destination.  This option has some\n\t     notable trade-offs that must be considered prior to using it.\n\t     For example, hardlinks will not be broken even if a file is no\n\t     longer hardlinked in the source directory.\n\n     --keep-dirlinks\n\t     When a directory is sent, and the receiving side has a symlink to\n\t     a directory in that place, follow that symlink and place the\n\t     directory's contents in that symlinked dir.\n\n     --link-dest=directory\n\t     Use directory as an alternate base directory to compare files\n\t     against on the destination machine.  If file in directory is\n\t     found and identical to the sender's file, the file will be\n\t     hardlinked.  Multiple --compare-dest directories may be provided.\n\t     If directory is a relative path, it is relative to the\n\t     destination directory.\n\n     --list-only\n\t     Instead of transferring files, only list them.  This option is\n\t     implied if there is only a single source argument and no\n\t     destination argument.\n\n     --max-delete MAX\n\t     Once MAX files have been deleted, do not delete any more files.\n\n     --max-size size\n\t     Don't transfer any file that is larger than size bytes.\n\t     Alternatively size may instead use a multiplier (such as 0B,\n\t     100B, 1023B, 1K, 1.5K, 5.5M; or any sequence with a case-\n\t     insensitive terminal scale multiplier of B, K, M, G, T, P, or E;\n\t     corresponding to bytes, kilobytes, and so on) to specify the\n\t     size.\n\n     --min-size size\n\t     Don't transfer any file that is smaller than size bytes.  See\n\t     --max-size on the definition of size.\n\n     --modify-window sec\n\t     When comparing file modification times for the purpose of\n\t     speeding up transfers consider offsets of up to sec seconds the\n\t     same.\n\n     -n, --dry-run\n\t     Do not actually modify the destination.  Mainly useful in\n\t     combination with -v.\n\n     --no-motd\n\t     Do not display the Message of the Day.\n\n     --numeric-ids\n\t     Ignore user and group names, use numeric user and group IDs only.\n\t     Has no effect unless -g or -o is also given.\n\n     -O, --omit-dir-times\n\t     Do not perserve the modification times of directories.  This can\n\t     be expensive when the directories reside on NFS.  This option is\n\t     inferred if you use --backup without --backup-dir.\n\n     -o, --owner\n\t     Set the user name to match the source, with similar matching\n\t     logic as for -g.  If --numeric-ids is also given or if the remote\n\t     user name is unknown on the local machine, set the numeric user\n\t     ID to match the source instead.  Only works if run as root.\n\n     -P      Shorthand for --partial --progress.\n\n     -p, --perms\n\t     Set destination file or directory permissions to match the source\n\t     when it is updated.\n\n     --partial\n\t     Do not remove partially transferred files if openrsync is\n\t     interrupted, which opens up the possibility for them to be easily\n\t     resumed later.\n\n     --partial-dir=DIR\n\t     Store all partially transferred files in DIR to allow an\n\t     interrupted transfer to resume without re-transferring files.\n\t     Implies -partial.\n\n     --password-file=pwfile\n\t     Define a file to read the password from when connecting to an\n\t     rsync daemon.  The password should be written on the first line\n\t     of the file, and may have a terminating newline.  The pwfile is\n\t     expected to not be readable by 'other', and to be owned by root\n\t     if openrsync is running as root.\n\n     --port=service\n\t     Specify an alternative TCP port number.  The service can be given\n\t     as a decimal integer or as a name to be looked up in the\n\t     services(5) database.  The default is “rsync”.\n\n     -m, --prune-empty-dirs\n\t     Prune empty directories from the file list on the receiver side.\n\t     Empty directories may be excluded from pruning with an exclude or\n\t     protect filter rule.  A directory wich only contains other empty,\n\t     non-excluded directories, is also considered empty.\n\n     -q, --quiet\n\t     Suppress all non-error related informational messages.\n\n     --progress\n\t     Periodically report file transfer progress.\n\n     --protocol=VER\n\t     Force openrsync to operate using the specified protocol version.\n\t     Normally the protocol version is negotiated automatically, but an\n\t     older protocol version can be forced with this flag.\n\n     -r, --recursive\n\t     If source designates a directory, synchronise the directory and\n\t     the entire subtree connected at that point.  If source ends with\n\t     a slash, only the subtree is synchronised, not the source\n\t     directory itself.\tIf source is a file, this has no effect.\n\n     --read-batch=file\n\t     Read a batch file previously prepared by openrsync from file.\n\t     See the --write-batch option for a description of a batch file.\n\t     When reading a batch file, the source arguments are optional and\n\t     ignored if specified.\n\n     --remove-source-files\n\t     Remove source files as they are transferred into directory.\n\t     Files are only removed once they are confirmed to be fully in\n\t     place.  By default openrsync will delete files as the transfer\n\t     progresses, but given its asynchronous nature there may be a\n\t     noticeable delay between a given file finishing its transfer and\n\t     its subsequent removal.\n\n\t     When combined with --delay-updates, files will be removed in a\n\t     larger batch toward the end of the transfer.\n\n     -R, --relative\n\t     Normally, pathnames on the commandline omit the directory\n\t     components.  This option will include the dir components.\n\n     --no-implied-dirs\n\t     Changes the default behavior of --relative such that implied\n\t     directories do not have their attributes modified, or are created\n\t     with default attributes, rather than the source attributes, if\n\t     they do not exist.  This allows the implied directories to\n\t     differ, including being a symlink on one side and a real\n\t     directory on the other.\n\n     --rsync-path=program\n\t     Run program on the remote host instead of the default rsync.\n\n     --size-only\n\t     Skip files whose sizes match (regardless of timestamp).\n\n     --safe-links\n\t     Skip any symlinks that are unsafe (absolute symlinks or where the\n\t     target is outside the copied tree).\n\n     --sockopts=sockopts\n\t     Set custom sockopts on the socket created to communicate with an\n\t     rsync daemon.  sockopts should be of the form\n\t     “name[=value][,...]”, where name matches an SO_* option described\n\t     in setsockopt(2).\tNote that only the following options are\n\t     currently supported:\n\n\t\t   SO_KEEPALIVE\n\t\t   SO_REUSEADDR\n\t\t   SO_SNDBUF\n\t\t   SO_RCVBUF\n\t\t   SO_SNDLOWAT\n\t\t   SO_RCVLOWAT\n\t\t   SO_SNDTIMEO\n\t\t   SO_RCVTIMEO\n\t\t   SO_REUSEPORT May not be available on all systems.\n\n     -S, --sparse\n\t     Attempt to efficiently handle sparse files.\n\n     --specials\n\t     Also transfer fifo and unix domain socket files.\n\n     --stats\n\t     Print verbose statistics about the transfer at the end of the\n\t     run.  Provides details about how much data transfer was saved by\n\t     openrsync.\n\n     --suffix suffix\n\t     Sets the suffix to be appended to filenames when creating backups\n\t     on the receiver before replacing files.  Defaults to ~ except\n\t     when combined with --backup-dir where the default is an empty\n\t     string.\n\n     --super\n\t     Always attempt traditionally super-user activities.  This flag\n\t     mostly interacts with the --owner, --group, and --devices\n\t     options, which may be permitted to unprivileged users on the\n\t     receiving end in some configurations.  --no-super is also\n\t     supported to avoid them entirely.\n\n     -T, --temp-dir=directory\n\t     Instead of creating temporarily files in the destination\n\t     directory, create them in the specified temporary directory.  If\n\t     this directory is on a different filesystem, that will require\n\t     moving the file rather than renaming it into place, and is\n\t     therefore not atomic.\n\n     --timeout=seconds\n\t     Set the I/O timeout in seconds.  Exit if no data was transferred\n\t     for the specified time.  The default is 0, which means no\n\t     timeout.\n\n     -t, --times\n\t     Set destination file and directory modification time to match the\n\t     source when it is updated or created.\n\n     -u, --update\n\t     Skip existing files on the destination that have a modification\n\t     time newer than the source file.\n\n     -v, --verbose\n\t     Increase verbosity.  Specify once for files being transferred,\n\t     twice for specific status, thrice for per-file transfer\n\t     information, and four times for per-file breakdowns.\n\n     -x, --one-file-system\n\t     Do not cross filesystem boundaries.  If this option is repeated,\n\t     all mount point directories from the copy are omitted.\n\t     Otherwise, it includes an empty directory at each mount point it\n\t     encounters.\n\n     -V, --version\n\t     Print version and exit.\n\n     -W, --whole-file\n\t     Copy the entire file rather than using the rsync incremental\n\t     algorithm.  This option may be faster, especially if the network\n\t     link is faster than the disk.\n\n     --only-write-batch=file\n\t     Prepare a batch file and write it to file.  With this option, the\n\t     batch file is written without updating the destination.  See the\n\t     below --write-batch option for a description of a batch file.\n\n     --write-batch=file\n\t     Prepare a batch file and write it to file.  A batch file is\n\t     composed of a small heading describing the transfer parameters\n\t     negotiated, followed by a raw dump of the data transmitted by the\n\t     sender.  When used with --read-batch on the other side, the\n\t     transfer is simply replayed from the batch file against the\n\t     application's reeceiver, and the destination tree is updated\n\t     accordingly.\n\n\t     Batch files are intended to reproduce an update to a destination\n\t     tree to many other identical trees without needing to establish a\n\t     direct connection between them.  This mechanism also avoids\n\t     having to perform many of the intermediate steps required for a\n\t     transfer, such as receiver-side checksums and blocking.\n\n     A remote source or directory has the syntax host:path for connecting via\n     ssh(1), or rsync://host/path or host::path for connecting to a remote\n     daemon.  Subsequent to the first remote source, the host may be dropped\n     to become just :path or ::path.\n\n     For connecting to a remote daemon with rsync://host or host::path, the\n     first path component is interpreted as a \"module\": host::module/path.\n     This only applies to the first source invocation; subsequent to that, the\n     module should not be specified.\n\n     By default, new destination files and directories are given the current\n     time and the source file permissions.  Updated files retain their\n     existing permissions.  It is an error if updated files have their file\n     types change (e.g., updating a directory with a file).\n\n     At this time, source may only consist of regular files, directories (only\n     with -r), or symbolic links (only with -l).  The destination directory\n     must be a directory and is created if not found.\n\n     openrsync also supports a --daemon mode, which may be run either\n     standalone or may be invoked by, e.g., inetd(8) or similar services that\n     hand a socket off to an external program for handling.\n\n     Daemon options that are shared with the non-daemon mode of openrsync\n     behave as described above.  Options specific to daemon mode are as\n     follows:\n\n     --config=configfile\n\t     Load daemon configuration from the named configfile instead of\n\t     the default location.  By default, openrsync will look for its\n\t     configuration at /etc/rsyncd.conf.  See rsyncd.conf(5) for\n\t     details of the format of this file.\n\n     --no-detach\n\t     Run the openrsync daemon in the foreground, instead of the\n\t     background.\n\n     Note that the openrsync daemon mode will log to syslog(3) by default\n     unless --log-file is specified, regardless of whether --no-detach has\n     been specified to run in the foreground or not.\n",
        "     The -f, --include, --include-from, --exclude, and --exclude-from options\n     may be used to load a filter rule or a set of filter rules.  A single\n     filter rule consists of a type, an optional set of modifiers, and a\n     pattern.  Each type has a short name and a long name.  These will be\n     described in more depth shortly.\n\n     A filter file is a set of rules, one per line.  Comments are accepted,\n     starting with a ‘#’.  Empty lines are ignored.\n\n     Each rule is of the following form:\n\n     <TYPE>[,<MODIFIERS>] <PATTERN>\n\n     If the short name is used, then the comma separating the modifiers from\n     the rule type is optional.  The delimiter between the type/modifiers and\n     the pattern may also be an underbar instead of a space.\n\n     The following rule types are supported:\n\n\t   LONG NAME\tSHORT NAME    DESCRIPTION\n\t   exclude\t-\t      Exclude a file from the transfer\n\t   include\t+\t      Include a file from the transfer\n\t   merge\t.\t      Merge rules in from a file\n\t   dir-merge\t:\t      Merge rules in from a per-directory file\n\t   hide \tH\t      Hide a file from the transfer\n\t   show \tS\t      “not hide a file from the transfer”\n\t   protect\tP\t      Protect a file from deletion\n\t   risk \tR\t      “not protect a file from deletion”\n\t   clear\t!\t      Clear the current filter list\n\n     The following rule modifiers are supported for the “exclude” and\n     “include” rule types:\n\n\t   MODIFIER    DESCRIPTION\n\t   /\t       Match against the absolute pathname of the entry\n\t   !\t       Take effect if the pattern does not match the entry\n\t   C\t       Insert the global CVS exclusions\n\t   s\t       Marks a rule as sender-side only\n\t   r\t       Marks a rule as receiver-side only\n\t   p\t       Marks a rule as perishable (do not prevent removal of a\n\t\t       directory)\n\n     The above modifiers will be ignored if applied to other rule types, with\n     the exception of “merge” and “dir-merge” rules.  See the Merge Rules\n     section for more details of the semantics.\n",
        "     The six basic types of include and exclude rules briefly described above\n     are “exclude”, “include”, “hide”, “show”, “protect”, “risk”.\n\n     The “hide” and “show” types are sender-side versions of the “exclude” and\n     “include” rules, while the “protect” and “risk” types are their receiver-\n     side equivalents.\n\n     Each of these rules take a pattern that is typically matched against the\n     basename of a transfer candidate's name.  A trailing ‘/’ in the pattern\n     indicates that the entry should only match a directory name, while a\n     leading ‘/’ indicates that the pattern is anchored to the beginning of\n     the transfer path.  The beginning of the transfer path is either the root\n     of the transfer, or the directory containing a dir-merge file if the rule\n     in question comes from a dir-merge file.  A ‘/’ at any other position, or\n     a “**” in the pattern, will match against the full path to the transfer\n     entry beginning at the root of the transfer.\n\n     Patterns may contain any of the following wildcards.\n\n\t   WILDCARD    DESCRIPTION\n\t   ?\t       Matches any character, except ‘/’\n\t   *\t       Matches zero or more characters, except ‘/’\n\t   **\t       Matches zero or more characters\n\t   [\t       Character class, as in POSIX regular expressions\n\t   /***        Matches a directory and all of its contents\n\n     Backslashes may be used to escape one of the above wildcard characters,\n     but is ordinary when appearing before any other character.\n\n     Note that exclude rules with the “C” modifier applied do not take a\n     pattern.\n",
        "     The merge rules, “merge” and “dir-merge”, are another way to insert a\n     filter rule file.\t“merge” rules are evaluated once as soon as they are\n     processed, and the rules read in are inserted at the same position as the\n     merge file.  “dir-merge” rules are evaluated as openrsync progresses\n     through the file list, searching each directory encountered for the file\n     named in the rule's pattern.\n\n     If a “dir-merge” rule appears before a “clear” rule, it will not be\n     processed at all.\n\n     “dir-merge” rules are inserted into their own chain of rules, rather than\n     directly into the global ruleset.\t“clear” rules appearing in a dir-\n     merged file do not affect the global ruleset.  As we find dir-merged\n     files in the transfer, their rules are prepended to their dir-merge chain\n     so that a deeper directory's rules take precedence over its parent's\n     rules.\n\n     When one of the above exclude/include modifiers are applied to “merge” or\n     “dir-merge” rule, those modifiers are applied to the exclude/include\n     rules within the file.  The following modifiers may additionally be\n     specified for merge rules:\n\n\t   MODIFIER    DESCRIPTION\n\t   -\t       All rules within are exclude rules\n\t   +\t       All rules within are include rules\n\t   C\t       File processing should assume CVS-compatible parsing\n\t   e\t       Exclude the file's name from the transfer\n\t   n\t       Rules are not inherited by subdirectories\n\t   w\t       Rules are word-split instead of line-split\n\n     The CVS-compatible modifier implies the ‘-’, ‘n’ and ‘w’ modifiers.  If a\n     filename is not supplied with it, then “.cvsignore” is used.\n",
        "     The following environment variables affect execution of openrsync:\n\n     LOGNAME\t     This variable may also hold the username to use when\n\t\t     connecting to an rsync daemon.  If LOGNAME is not set,\n\t\t     then “nobody” will be used.\n\n     USER\t     This variable holds the username to use when connecting\n\t\t     to an rsync daemon.  If USER is not set, then LOGNAME\n\t\t     will be used.\n\n     RSYNC_RSH\t     This variable specifies the remote shell to use for\n\t\t     remote connections.  The default remote shell is ssh(1)\n\t\t     if neither RSYNC_RSH nor --rsh are specified.\n\n     RSYNC_PASSWORD  This variable specifies the password to use when\n\t\t     connecting to an rsync daemon.  It will be ignored if the\n\t\t     --password-file option is specified and passes the mode\n\t\t     and owner check described above in the option's\n\t\t     description.  On many systems, environment variables are\n\t\t     readable by other processes and should be considered\n\t\t     insecure.\tPlease prefer a password file instead.\n",
        "     The openrsync utility exits 0 on success, 1 if an error occurs, or 2 if\n     the remote protocol version is older than the local protocol version.\n",
        "     A common invocation of openrsync is for archiving from a remote host to\n     the local computer:\n\n\t   % openrsync -av --delete remote:rpath /local/path\n\n     This will update the contents of /local/path/rpath with those on the\n     remote server.  Switching remote and local wil update the remote contents\n     instead:\n\n\t   % openrsync -av --delete /local/path remote:rpath\n\n     All examples use -t so that destination files inherit the source time.\n     If not changed, subsequent invocations of openrsync will then consider\n     the file up to date and not transfer block hashes.\n\n     To update the out-of-date remote files host:dest/bar and host:dest/baz\n     with the local ../src/bar and ../src/baz:\n\n\t   % openrsync -t ../src/bar ../src/baz host:dest\n\n     To update the out-of-date local files bar and baz with the remote files\n     host:src/bar and host:src/baz:\n\n\t   % openrsync -t host:src/bar :src/baz .\n\n     To update the out-of-date local files ../dest/bar and ../dest/baz with\n     bar and baz:\n\n\t   % openrsync -t bar baz ../dest\n\n     To update the out-of-date remote files in host:dest on a remote host\n     running openrsync with the local host running rsync(1):\n\n\t   % rsync --rsync-path openrsync -t ../dest/* host:dest\n",
        "     ssh(1), rsync(5), rsyncd(5)\n",
        "     openrsync is compatible with rsync protocol versions 27 - 29 as supported\n     by the samba.org implementation of rsync.\n",
        "     The openrsync utility has been available since OpenBSD 6.5.\n",
        "     The openrsync utility was written by Kristaps Dzonsons <kristaps@bsd.lv>.\n"
      ]
    }
  ],
  "flags": [
    {
      "flag": "--ignore-errors",
      "description": " Works in conjunction with --delete to delete files despite I/O errors.",
      "optional": true
    },
    {
      "flag": "--ignore-existing",
      "description": " Ignore files that already exist.",
      "optional": true,
      "shortFlag": "-y"
    },
    {
      "flag": "--ignore-non-existing",
      "description": " Ignore files that do not already exist (do not create them).",
      "optional": true
    },
    {
      "flag": "--include",
      "description": " Include files matching pattern.",
      "optional": true,
      "shortFlag": "-I"
    },
    {
      "flag": "--include-from",
      "description": " Load patterns and rules from file.",
      "optional": true
    },
    {
      "flag": "--devices",
      "description": " Also transfer device files."
    },
    {
      "flag": "-e",
      "description": " Specify alternative communication program, defaults to ssh(1). The RSYNC_RSH environment variable will be used if an -e option is not present.  Note that openrsync will generally handle quotes, but it makes no attempt to deal with escape sequences. In particular, escaped quotation marks will not be escaped.",
      "optional": true
    },
    {
      "flag": "-F",
      "description": "Adds a standard .rsync-filter dir-merge filter rule. Specifically, -F will add “: /.rsync-filter” the first time it is seen, and “- .rsync-filter” the second time it is seen. Subsequent uses have no effect."
    },
    {
      "flag": "-f",
      "description": " Process filter against the global filter chain.  The specified filter may be a rule to include a filter file, or to include a per-directory filter file.  Regular filter files are processed immediately, while per-directory filter files are processed as directories are encountered.  See PATTERNS AND RULES for more details about the syntax and capabilities of openrsync filters.",
      "optional": true
    },
    {
      "flag": "-g",
      "description": ", --group Set the group name to match the source.  For example, group \"kristaps\" with ID 1000 on a remote server is matched to group \"kristaps\" on the local machine with ID 2000.  If --numeric-ids is also given or if the remote group name is unknown on the local machine, set the numeric group ID to match the source instead."
    },
    {
      "flag": "-H",
      "description": ", --hard-links Attempt to preserve hard links within the list of files transferred."
    },
    {
      "flag": "--help",
      "description": "Print a brief description of all options.",
      "shortFlag": "-h"
    },
    {
      "flag": "--inplace",
      "description": " Avoid creating temporary files, instead operating on files directly in place in the destination.  This option has some notable trade-offs that must be considered prior to using it. For example, hardlinks will not be broken even if a file is no longer hardlinked in the source directory.",
      "optional": true,
      "shortFlag": "-l"
    },
    {
      "flag": "--keep-dirlinks",
      "description": " When a directory is sent, and the receiving side has a symlink to a directory in that place, follow that symlink and place the directory's contents in that symlinked dir.",
      "optional": true
    },
    {
      "flag": "--link-dest",
      "description": " Use directory as an alternate base directory to compare files against on the destination machine.  If file in directory is found and identical to the sender's file, the file will be hardlinked.  Multiple --compare-dest directories may be provided. If directory is a relative path, it is relative to the destination directory.",
      "optional": true
    },
    {
      "flag": "--list-only",
      "description": " Instead of transferring files, only list them.  This option is implied if there is only a single source argument and no destination argument.",
      "optional": true
    },
    {
      "flag": "--max-delete",
      "description": " Once MAX files have been deleted, do not delete any more files.",
      "optional": true
    },
    {
      "flag": "--max-size",
      "description": " Don't transfer any file that is larger than size bytes. Alternatively size may instead use a multiplier (such as 0B, 100B, 1023B, 1K, 1.5K, 5.5M; or any sequence with a case- insensitive terminal scale multiplier of B, K, M, G, T, P, or E; corresponding to bytes, kilobytes, and so on) to specify the size.",
      "optional": true
    },
    {
      "flag": "--min-size",
      "description": " Don't transfer any file that is smaller than size bytes.  See",
      "optional": true
    },
    {
      "flag": "--max-size",
      "description": " Don't transfer any file that is larger than size bytes. Alternatively size may instead use a multiplier (such as 0B, 100B, 1023B, 1K, 1.5K, 5.5M; or any sequence with a case- insensitive terminal scale multiplier of B, K, M, G, T, P, or E; corresponding to bytes, kilobytes, and so on) to specify the size.",
      "optional": true
    },
    {
      "flag": "--modify-window",
      "description": " When comparing file modification times for the purpose of speeding up transfers consider offsets of up to sec seconds the same.",
      "optional": true
    },
    {
      "flag": "--no-motd",
      "description": " Do not display the Message of the Day.",
      "optional": true,
      "shortFlag": "-n"
    },
    {
      "flag": "--numeric-ids",
      "description": " Ignore user and group names, use numeric user and group IDs only. Has no effect unless -g or -o is also given.",
      "optional": true
    },
    {
      "flag": "-O",
      "description": ", --omit-dir-times Do not perserve the modification times of directories.  This can be expensive when the directories reside on NFS.  This option is inferred if you use --backup without --backup-dir."
    },
    {
      "flag": "-o",
      "description": ", --owner Set the user name to match the source, with similar matching logic as for -g.  If --numeric-ids is also given or if the remote user name is unknown on the local machine, set the numeric user ID to match the source instead.  Only works if run as root."
    },
    {
      "flag": "-P",
      "description": "Shorthand for --partial --progress."
    },
    {
      "flag": "--partial",
      "description": " Do not remove partially transferred files if openrsync is interrupted, which opens up the possibility for them to be easily resumed later.",
      "optional": true,
      "shortFlag": "-p"
    },
    {
      "flag": "--partial-dir",
      "description": " Store all partially transferred files in DIR to allow an interrupted transfer to resume without re-transferring files. Implies -partial.",
      "optional": true
    },
    {
      "flag": "--password-file",
      "description": " Define a file to read the password from when connecting to an rsync daemon.  The password should be written on the first line of the file, and may have a terminating newline.  The pwfile is expected to not be readable by 'other', and to be owned by root if openrsync is running as root.",
      "optional": true
    },
    {
      "flag": "--port",
      "description": " Specify an alternative TCP port number.  The service can be given as a decimal integer or as a name to be looked up in the services(5) database.  The default is “rsync”.",
      "optional": true
    },
    {
      "flag": "-m",
      "description": ", --prune-empty-dirs Prune empty directories from the file list on the receiver side. Empty directories may be excluded from pruning with an exclude or protect filter rule.  A directory wich only contains other empty, non-excluded directories, is also considered empty."
    },
    {
      "flag": "--progress",
      "description": " Periodically report file transfer progress.",
      "optional": true,
      "shortFlag": "-q"
    },
    {
      "flag": "--protocol",
      "description": " Force openrsync to operate using the specified protocol version. Normally the protocol version is negotiated automatically, but an older protocol version can be forced with this flag.",
      "optional": true
    },
    {
      "flag": "--read-batch",
      "description": " Read a batch file previously prepared by openrsync from file. See the --write-batch option for a description of a batch file. When reading a batch file, the source arguments are optional and ignored if specified.",
      "optional": true,
      "shortFlag": "-r"
    },
    {
      "flag": "--remove-source-files",
      "description": " Remove source files as they are transferred into directory. Files are only removed once they are confirmed to be fully in place.  By default openrsync will delete files as the transfer progresses, but given its asynchronous nature there may be a noticeable delay between a given file finishing its transfer and its subsequent removal. When combined with --delay-updates, files will be removed in a larger batch toward the end of the transfer.",
      "optional": true
    },
    {
      "flag": "--no-implied-dirs",
      "description": " Changes the default behavior of --relative such that implied directories do not have their attributes modified, or are created with default attributes, rather than the source attributes, if they do not exist.  This allows the implied directories to differ, including being a symlink on one side and a real directory on the other.",
      "optional": true,
      "shortFlag": "-R"
    },
    {
      "flag": "--rsync-path",
      "description": " Run program on the remote host instead of the default rsync.",
      "optional": true
    },
    {
      "flag": "--size-only",
      "description": " Skip files whose sizes match (regardless of timestamp).",
      "optional": true
    },
    {
      "flag": "--safe-links",
      "description": " Skip any symlinks that are unsafe (absolute symlinks or where the target is outside the copied tree).",
      "optional": true
    },
    {
      "flag": "--sockopts",
      "description": " Set custom sockopts on the socket created to communicate with an rsync daemon.  sockopts should be of the form “name[=value][,...]”, where name matches an SO_* option described in setsockopt(2).\tNote that only the following options are currently supported: SO_KEEPALIVE SO_REUSEADDR SO_SNDBUF SO_RCVBUF SO_SNDLOWAT SO_RCVLOWAT SO_SNDTIMEO SO_RCVTIMEO SO_REUSEPORT May not be available on all systems.",
      "optional": true
    },
    {
      "flag": "--specials",
      "description": " Also transfer fifo and unix domain socket files.",
      "optional": true,
      "shortFlag": "-S"
    },
    {
      "flag": "--stats",
      "description": " Print verbose statistics about the transfer at the end of the run.  Provides details about how much data transfer was saved by openrsync.",
      "optional": true
    },
    {
      "flag": "--suffix",
      "description": " Sets the suffix to be appended to filenames when creating backups on the receiver before replacing files.  Defaults to ~ except when combined with --backup-dir where the default is an empty string.",
      "optional": true
    },
    {
      "flag": "--super",
      "description": " Always attempt traditionally super-user activities.  This flag mostly interacts with the --owner, --group, and --devices options, which may be permitted to unprivileged users on the receiving end in some configurations.  --no-super is also supported to avoid them entirely.",
      "optional": true
    },
    {
      "flag": "--timeout",
      "description": " Set the I/O timeout in seconds.  Exit if no data was transferred for the specified time.  The default is 0, which means no timeout.",
      "optional": true,
      "shortFlag": "-T"
    },
    {
      "flag": "-t",
      "description": ", --times Set destination file and directory modification time to match the source when it is updated or created."
    },
    {
      "flag": "-u",
      "description": ", --update Skip existing files on the destination that have a modification time newer than the source file."
    },
    {
      "flag": "-v",
      "description": ", --verbose Increase verbosity.  Specify once for files being transferred, twice for specific status, thrice for per-file transfer information, and four times for per-file breakdowns."
    },
    {
      "flag": "-x",
      "description": ", --one-file-system Do not cross filesystem boundaries.  If this option is repeated, all mount point directories from the copy are omitted. Otherwise, it includes an empty directory at each mount point it encounters."
    },
    {
      "flag": "-V",
      "description": ", --version Print version and exit."
    },
    {
      "flag": "--only-write-batch",
      "description": " Prepare a batch file and write it to file.  With this option, the batch file is written without updating the destination.  See the below --write-batch option for a description of a batch file.",
      "optional": true,
      "shortFlag": "-W"
    },
    {
      "flag": "--write-batch",
      "description": " Prepare a batch file and write it to file.  A batch file is composed of a small heading describing the transfer parameters negotiated, followed by a raw dump of the data transmitted by the sender.  When used with --read-batch on the other side, the transfer is simply replayed from the batch file against the application's reeceiver, and the destination tree is updated accordingly. Batch files are intended to reproduce an update to a destination tree to many other identical trees without needing to establish a direct connection between them.  This mechanism also avoids having to perform many of the intermediate steps required for a transfer, such as receiver-side checksums and blocking. A remote source or directory has the syntax host:path for connecting via ssh(1), or rsync://host/path or host::path for connecting to a remote daemon.  Subsequent to the first remote source, the host may be dropped to become just :path or ::path. For connecting to a remote daemon with rsync://host or host::path, the first path component is interpreted as a \"module\": host::module/path. This only applies to the first source invocation; subsequent to that, the module should not be specified. By default, new destination files and directories are given the current time and the source file permissions.  Updated files retain their existing permissions.  It is an error if updated files have their file types change (e.g., updating a directory with a file). At this time, source may only consist of regular files, directories (only with -r), or symbolic links (only with -l).  The destination directory must be a directory and is created if not found. openrsync also supports a --daemon mode, which may be run either standalone or may be invoked by, e.g., inetd(8) or similar services that hand a socket off to an external program for handling. Daemon options that are shared with the non-daemon mode of openrsync behave as described above.  Options specific to daemon mode are as follows:",
      "optional": false
    },
    {
      "flag": "--config",
      "description": " Load daemon configuration from the named configfile instead of the default location.  By default, openrsync will look for its configuration at /etc/rsyncd.conf.  See rsyncd.conf(5) for details of the format of this file.",
      "optional": true
    },
    {
      "flag": "--no-detach",
      "description": " Run the openrsync daemon in the foreground, instead of the background. Note that the openrsync daemon mode will log to syslog(3) by default unless --log-file is specified, regardless of whether --no-detach has been specified to run in the foreground or not. PATTERNS AND RULES The -f, --include, --include-from, --exclude, and --exclude-from options may be used to load a filter rule or a set of filter rules.  A single filter rule consists of a type, an optional set of modifiers, and a pattern.  Each type has a short name and a long name.  These will be described in more depth shortly. A filter file is a set of rules, one per line.  Comments are accepted, starting with a ‘#’.  Empty lines are ignored. Each rule is of the following form: <TYPE>[,<MODIFIERS>] <PATTERN> If the short name is used, then the comma separating the modifiers from the rule type is optional.  The delimiter between the type/modifiers and the pattern may also be an underbar instead of a space. The following rule types are supported: LONG NAME\tSHORT NAME    DESCRIPTION exclude\t-\t      Exclude a file from the transfer include\t+\t      Include a file from the transfer merge\t.\t      Merge rules in from a file dir-merge\t:\t      Merge rules in from a per-directory file hide \tH\t      Hide a file from the transfer show \tS\t      “not hide a file from the transfer” protect\tP\t      Protect a file from deletion risk \tR\t      “not protect a file from deletion” clear\t!\t      Clear the current filter list The following rule modifiers are supported for the “exclude” and “include” rule types: MODIFIER    DESCRIPTION /\t       Match against the absolute pathname of the entry !\t       Take effect if the pattern does not match the entry C\t       Insert the global CVS exclusions s\t       Marks a rule as sender-side only r\t       Marks a rule as receiver-side only p\t       Marks a rule as perishable (do not prevent removal of a directory) The above modifiers will be ignored if applied to other rule types, with the exception of “merge” and “dir-merge” rules.  See the Merge Rules section for more details of the semantics. Include and Exclude Rules The six basic types of include and exclude rules briefly described above are “exclude”, “include”, “hide”, “show”, “protect”, “risk”. The “hide” and “show” types are sender-side versions of the “exclude” and “include” rules, while the “protect” and “risk” types are their receiver- side equivalents. Each of these rules take a pattern that is typically matched against the basename of a transfer candidate's name.  A trailing ‘/’ in the pattern indicates that the entry should only match a directory name, while a leading ‘/’ indicates that the pattern is anchored to the beginning of the transfer path.  The beginning of the transfer path is either the root of the transfer, or the directory containing a dir-merge file if the rule in question comes from a dir-merge file.  A ‘/’ at any other position, or a “**” in the pattern, will match against the full path to the transfer entry beginning at the root of the transfer. Patterns may contain any of the following wildcards. WILDCARD    DESCRIPTION ?\t       Matches any character, except ‘/’ *\t       Matches zero or more characters, except ‘/’ **\t       Matches zero or more characters [\t       Character class, as in POSIX regular expressions /***        Matches a directory and all of its contents Backslashes may be used to escape one of the above wildcard characters, but is ordinary when appearing before any other character. Note that exclude rules with the “C” modifier applied do not take a pattern. Merge Rules The merge rules, “merge” and “dir-merge”, are another way to insert a filter rule file.\t“merge” rules are evaluated once as soon as they are processed, and the rules read in are inserted at the same position as the merge file.  “dir-merge” rules are evaluated as openrsync progresses through the file list, searching each directory encountered for the file named in the rule's pattern. If a “dir-merge” rule appears before a “clear” rule, it will not be processed at all. “dir-merge” rules are inserted into their own chain of rules, rather than directly into the global ruleset.\t“clear” rules appearing in a dir- merged file do not affect the global ruleset.  As we find dir-merged files in the transfer, their rules are prepended to their dir-merge chain so that a deeper directory's rules take precedence over its parent's rules. When one of the above exclude/include modifiers are applied to “merge” or “dir-merge” rule, those modifiers are applied to the exclude/include rules within the file.  The following modifiers may additionally be specified for merge rules: MODIFIER    DESCRIPTION -\t       All rules within are exclude rules +\t       All rules within are include rules C\t       File processing should assume CVS-compatible parsing e\t       Exclude the file's name from the transfer n\t       Rules are not inherited by subdirectories w\t       Rules are word-split instead of line-split The CVS-compatible modifier implies the ‘-’, ‘n’ and ‘w’ modifiers.  If a filename is not supplied with it, then “.cvsignore” is used.",
      "optional": true
    }
  ],
  "examples": [],
  "relatedCommands": [
    "ssh",
    "rsync",
    "rsyncd",
    "openrsync",
    "synchronise",
    "local",
    "remote",
    "program",
    "filter",
    "address",
    "sourceaddr",
    "append",
    "backup-dir",
    "directory",
    "bwlimit"
  ],
  "seeAlso": [
    {
      "name": "ssh",
      "section": 1
    },
    {
      "name": "rsync",
      "section": 5
    },
    {
      "name": "rsyncd",
      "section": 5
    }
  ],
  "metadata": {},
  "searchContent": "rsync rsync manual page the openrsync utility synchronises files in the destination directory with one or more source files openrsync -0468bcdefhiloprstwvabcdefghiklmnopqrtuvxyz -e program -f filter --address sourceaddr --append --backup-dir directory --bwlimit limit --cache --no-cache --checksum-seed num --chmod mode --compare-dest directory --compress-level num --contimeout seconds --copy-dest directory --copy-unsafe-links --del --delay-updates --delete-before --delete-during --delete-delay --delete-after --delete-excluded --exclude pattern --exclude-from file --extended-attributes --files-from filespec --force --ignore-errors --ignore-existing --ignore-non-existing --include pattern --include-from file --inplace --keep-dirlinks --link-dest directory --list-only --max-delete max --max-size size --min-size size --modify-window sec --no-implied-dirs --no-motd --numeric-ids --partial --partial-dir dir --password-file pwfile --port service --progress ver --protocol --read-batch file --remove-source-files --rsync-path program --safe-links --size-only --sockopts sockopts --specials --stats --suffix suffix --super --timeout seconds --only-write-batch file --write-batch file source directory openrsync --daemon -46hv --address bindaddr --bwlimit bwlimit --config configfile --no-detach --log-file logfile --port service --sockopts sockopts rsync manual page openrsync utility synchronises destination directory more source files --ignore-errors works in conjunction with --delete to delete files despite i o errors --ignore-existing ignore files that already exist --ignore-non-existing ignore files that do not already exist do not create them --include include files matching pattern --include-from load patterns and rules from file --devices also transfer device files -e specify alternative communication program defaults to ssh 1 the rsync rsh environment variable will be used if an -e option is not present note that openrsync will generally handle quotes but it makes no attempt to deal with escape sequences in particular escaped quotation marks will not be escaped -f adds a standard rsync-filter dir-merge filter rule specifically -f will add rsync-filter the first time it is seen and - rsync-filter the second time it is seen subsequent uses have no effect -f process filter against the global filter chain the specified filter may be a rule to include a filter file or to include a per-directory filter file regular filter files are processed immediately while per-directory filter files are processed as directories are encountered see patterns and rules for more details about the syntax and capabilities of openrsync filters -g --group set the group name to match the source for example group kristaps with id 1000 on a remote server is matched to group kristaps on the local machine with id 2000 if --numeric-ids is also given or if the remote group name is unknown on the local machine set the numeric group id to match the source instead -h --hard-links attempt to preserve hard links within the list of files transferred --help print a brief description of all options --inplace avoid creating temporary files instead operating on files directly in place in the destination this option has some notable trade-offs that must be considered prior to using it for example hardlinks will not be broken even if a file is no longer hardlinked in the source directory --keep-dirlinks when a directory is sent and the receiving side has a symlink to a directory in that place follow that symlink and place the directory s contents in that symlinked dir --link-dest use directory as an alternate base directory to compare files against on the destination machine if file in directory is found and identical to the sender s file the file will be hardlinked multiple --compare-dest directories may be provided if directory is a relative path it is relative to the destination directory --list-only instead of transferring files only list them this option is implied if there is only a single source argument and no destination argument --max-delete once max files have been deleted do not delete any more files --max-size don t transfer any file that is larger than size bytes alternatively size may instead use a multiplier such as 0b 100b 1023b 1k 1 5k 5 5m or any sequence with a case- insensitive terminal scale multiplier of b k m g t p or e corresponding to bytes kilobytes and so on to specify the size --min-size don t transfer any file that is smaller than size bytes see --max-size don t transfer any file that is larger than size bytes alternatively size may instead use a multiplier such as 0b 100b 1023b 1k 1 5k 5 5m or any sequence with a case- insensitive terminal scale multiplier of b k m g t p or e corresponding to bytes kilobytes and so on to specify the size --modify-window when comparing file modification times for the purpose of speeding up transfers consider offsets of up to sec seconds the same --no-motd do not display the message of the day --numeric-ids ignore user and group names use numeric user and group ids only has no effect unless -g or -o is also given -o --omit-dir-times do not perserve the modification times of directories this can be expensive when the directories reside on nfs this option is inferred if you use --backup without --backup-dir -o --owner set the user name to match the source with similar matching logic as for -g if --numeric-ids is also given or if the remote user name is unknown on the local machine set the numeric user id to match the source instead only works if run as root -p shorthand for --partial --progress --partial do not remove partially transferred files if openrsync is interrupted which opens up the possibility for them to be easily resumed later --partial-dir store all partially transferred files in dir to allow an interrupted transfer to resume without re-transferring files implies -partial --password-file define a file to read the password from when connecting to an rsync daemon the password should be written on the first line of the file and may have a terminating newline the pwfile is expected to not be readable by other and to be owned by root if openrsync is running as root --port specify an alternative tcp port number the service can be given as a decimal integer or as a name to be looked up in the services 5 database the default is rsync -m --prune-empty-dirs prune empty directories from the file list on the receiver side empty directories may be excluded from pruning with an exclude or protect filter rule a directory wich only contains other empty non-excluded directories is also considered empty --progress periodically report file transfer progress --protocol force openrsync to operate using the specified protocol version normally the protocol version is negotiated automatically but an older protocol version can be forced with this flag --read-batch read a batch file previously prepared by openrsync from file see the --write-batch option for a description of a batch file when reading a batch file the source arguments are optional and ignored if specified --remove-source-files remove source files as they are transferred into directory files are only removed once they are confirmed to be fully in place by default openrsync will delete files as the transfer progresses but given its asynchronous nature there may be a noticeable delay between a given file finishing its transfer and its subsequent removal when combined with --delay-updates files will be removed in a larger batch toward the end of the transfer --no-implied-dirs changes the default behavior of --relative such that implied directories do not have their attributes modified or are created with default attributes rather than the source attributes if they do not exist this allows the implied directories to differ including being a symlink on one side and a real directory on the other --rsync-path run program on the remote host instead of the default rsync --size-only skip files whose sizes match regardless of timestamp --safe-links skip any symlinks that are unsafe absolute symlinks or where the target is outside the copied tree --sockopts set custom sockopts on the socket created to communicate with an rsync daemon sockopts should be of the form name value where name matches an so option described in setsockopt 2 note that only the following options are currently supported so keepalive so reuseaddr so sndbuf so rcvbuf so sndlowat so rcvlowat so sndtimeo so rcvtimeo so reuseport may not be available on all systems --specials also transfer fifo and unix domain socket files --stats print verbose statistics about the transfer at the end of the run provides details about how much data transfer was saved by openrsync --suffix sets the suffix to be appended to filenames when creating backups on the receiver before replacing files defaults to except when combined with --backup-dir where the default is an empty string --super always attempt traditionally super-user activities this flag mostly interacts with the --owner --group and --devices options which may be permitted to unprivileged users on the receiving end in some configurations --no-super is also supported to avoid them entirely --timeout set the i o timeout in seconds exit if no data was transferred for the specified time the default is 0 which means no timeout -t --times set destination file and directory modification time to match the source when it is updated or created -u --update skip existing files on the destination that have a modification time newer than the source file -v --verbose increase verbosity specify once for files being transferred twice for specific status thrice for per-file transfer information and four times for per-file breakdowns -x --one-file-system do not cross filesystem boundaries if this option is repeated all mount point directories from the copy are omitted otherwise it includes an empty directory at each mount point it encounters -v --version print version and exit --only-write-batch prepare a batch file and write it to file with this option the batch file is written without updating the destination see the below --write-batch option for a description of a batch file --write-batch prepare a batch file and write it to file a batch file is composed of a small heading describing the transfer parameters negotiated followed by a raw dump of the data transmitted by the sender when used with --read-batch on the other side the transfer is simply replayed from the batch file against the application s reeceiver and the destination tree is updated accordingly batch files are intended to reproduce an update to a destination tree to many other identical trees without needing to establish a direct connection between them this mechanism also avoids having to perform many of the intermediate steps required for a transfer such as receiver-side checksums and blocking a remote source or directory has the syntax host path for connecting via ssh 1 or rsync host path or host path for connecting to a remote daemon subsequent to the first remote source the host may be dropped to become just path or path for connecting to a remote daemon with rsync host or host path the first path component is interpreted as a module host module path this only applies to the first source invocation subsequent to that the module should not be specified by default new destination files and directories are given the current time and the source file permissions updated files retain their existing permissions it is an error if updated files have their file types change e g updating a directory with a file at this time source may only consist of regular files directories only with -r or symbolic links only with -l the destination directory must be a directory and is created if not found openrsync also supports a --daemon mode which may be run either standalone or may be invoked by e g inetd 8 or similar services that hand a socket off to an external program for handling daemon options that are shared with the non-daemon mode of openrsync behave as described above options specific to daemon mode are as follows --config load daemon configuration from the named configfile instead of the default location by default openrsync will look for its configuration at etc rsyncd conf see rsyncd conf 5 for details of the format of this file --no-detach run the openrsync daemon in the foreground instead of the background note that the openrsync daemon mode will log to syslog 3 by default unless --log-file is specified regardless of whether --no-detach has been specified to run in the foreground or not patterns and rules the -f --include --include-from --exclude and --exclude-from options may be used to load a filter rule or a set of filter rules a single filter rule consists of a type an optional set of modifiers and a pattern each type has a short name and a long name these will be described in more depth shortly a filter file is a set of rules one per line comments are accepted starting with a empty lines are ignored each rule is of the following form type modifiers pattern if the short name is used then the comma separating the modifiers from the rule type is optional the delimiter between the type modifiers and the pattern may also be an underbar instead of a space the following rule types are supported long name short name description exclude - exclude a file from the transfer include include a file from the transfer merge merge rules in from a file dir-merge merge rules in from a per-directory file hide h hide a file from the transfer show s not hide a file from the transfer protect p protect a file from deletion risk r not protect a file from deletion clear clear the current filter list the following rule modifiers are supported for the exclude and include rule types modifier description match against the absolute pathname of the entry take effect if the pattern does not match the entry c insert the global cvs exclusions s marks a rule as sender-side only r marks a rule as receiver-side only p marks a rule as perishable do not prevent removal of a directory the above modifiers will be ignored if applied to other rule types with the exception of merge and dir-merge rules see the merge rules section for more details of the semantics include and exclude rules the six basic types of include and exclude rules briefly described above are exclude include hide show protect risk the hide and show types are sender-side versions of the exclude and include rules while the protect and risk types are their receiver- side equivalents each of these rules take a pattern that is typically matched against the basename of a transfer candidate s name a trailing in the pattern indicates that the entry should only match a directory name while a leading indicates that the pattern is anchored to the beginning of the transfer path the beginning of the transfer path is either the root of the transfer or the directory containing a dir-merge file if the rule in question comes from a dir-merge file a at any other position or a in the pattern will match against the full path to the transfer entry beginning at the root of the transfer patterns may contain any of the following wildcards wildcard description matches any character except matches zero or more characters except matches zero or more characters character class as in posix regular expressions matches a directory and all of its contents backslashes may be used to escape one of the above wildcard characters but is ordinary when appearing before any other character note that exclude rules with the c modifier applied do not take a pattern merge rules the merge rules merge and dir-merge are another way to insert a filter rule file merge rules are evaluated once as soon as they are processed and the rules read in are inserted at the same position as the merge file dir-merge rules are evaluated as openrsync progresses through the file list searching each directory encountered for the file named in the rule s pattern if a dir-merge rule appears before a clear rule it will not be processed at all dir-merge rules are inserted into their own chain of rules rather than directly into the global ruleset clear rules appearing in a dir- merged file do not affect the global ruleset as we find dir-merged files in the transfer their rules are prepended to their dir-merge chain so that a deeper directory s rules take precedence over its parent s rules when one of the above exclude include modifiers are applied to merge or dir-merge rule those modifiers are applied to the exclude include rules within the file the following modifiers may additionally be specified for merge rules modifier description - all rules within are exclude rules all rules within are include rules c file processing should assume cvs-compatible parsing e exclude the file s name from the transfer n rules are not inherited by subdirectories w rules are word-split instead of line-split the cvs-compatible modifier implies the - n and w modifiers if a filename is not supplied with it then cvsignore is used name macos 15 5 june 17 2025 macos 15 5",
  "keywords": [
    "rsync",
    "manual",
    "page",
    "openrsync",
    "utility",
    "synchronises",
    "destination",
    "directory",
    "more",
    "source",
    "files."
  ],
  "complexity": "advanced",
  "hash": "e39d98adbd8039a2",
  "parsedAt": "2025-06-17T19:42:03.277Z",
  "parseVersion": "2.0.0",
  "isCommon": false,
  "hasInteractiveExamples": false,
  "hasDiagrams": false
}