{
  "name": "chown",
  "section": 8,
  "title": "chown manual page",
  "description": "The chown utility changes the user ID and/or the group ID of the specified files.",
  "synopsis": "chown [-fhnvx] [-R [-H | -L | -P]] owner[:group] file ... chown [-fhnvx] [-R [-H | -L | -P]] :group file ...",
  "category": "System Administration",
  "sections": [
    {
      "id": "name",
      "title": "NAME",
      "content": "macOS 15.5\t\t\tAugust 24, 2022 \t\t    macOS 15.5",
      "level": 1,
      "subsections": [],
      "codeBlocks": [
        "     chown – change file owner and group\n",
        "     chown [-fhnvx] [-R [-H | -L | -P]] owner[:group] file ...\n     chown [-fhnvx] [-R [-H | -L | -P]] :group file ...\n",
        "     The chown utility changes the user ID and/or the group ID of the\n     specified files.  Symbolic links named by arguments are silently left\n     unchanged unless -h is used.\n\n     The options are as follows:\n\n     -H      If the -R option is specified, symbolic links on the command line\n\t     are followed and hence unaffected by the command.\t(Symbolic\n\t     links encountered during traversal are not followed.)\n\n     -L      If the -R option is specified, all symbolic links are followed.\n\n     -P      If the -R option is specified, no symbolic links are followed.\n\t     Instead, the user and/or group ID of the link itself are\n\t     modified.\tThis is the default.  For matching behavior when using\n\t     chown without the -R option, the -h option should be used\n\t     instead.\n\n     -R      Change the user ID and/or the group ID of the file hierarchies\n\t     rooted in the files, instead of just the files themselves.\n\t     Beware of unintentionally matching the “..” hard link to the\n\t     parent directory when using wildcards like “.*”.\n\n     -f      Do not report any failure to change file owner or group, nor\n\t     modify the exit status to reflect such failures.\n\n     -h      If the file is a symbolic link, change the user ID and/or the\n\t     group ID of the link itself.\n\n     -n      Interpret user ID and group ID as numeric, avoiding name lookups.\n\n     -v      Cause chown to be verbose, showing files as the owner is\n\t     modified.\tIf the -v flag is specified more than once, chown will\n\t     print the filename, followed by the old and new numeric\n\t     user/group ID.\n\n     -x      File system mount points are not traversed.\n\n     The -H, -L and -P options are ignored unless the -R option is specified.\n     In addition, these options override each other and the command's actions\n     are determined by the last one specified.\n\n     The owner and group operands are both optional, however, one must be\n     specified.  If the group operand is specified, it must be preceded by a\n     colon (``:'') character.\n\n     The owner may be either a numeric user ID or a user name.\tIf a user name\n     is also a numeric user ID, the operand is used as a user name.  The group\n     may be either a numeric group ID or a group name.\tIf a group name is\n     also a numeric group ID, the operand is used as a group name.\n\n     The ownership of a file may only be altered by a super-user for obvious\n     security reasons.\tSimilarly, only a member of a group can change a\n     file's group ID to that group.\n\n     If chown receives a SIGINFO signal (see the status argument for stty(1)),\n     then the current filename as well as the old and new file owner and group\n     are displayed.\n",
        "     The chown utility exits 0 on success, and >0 if an error occurs.\n",
        "     Previous versions of the chown utility used the dot (``.'') character to\n     distinguish the group name.  This has been changed to be a colon (``:'')\n     character so that user and group names may contain the dot character.\n\n     On previous versions of this system, symbolic links did not have owners.\n\n     The -v and -x options are non-standard and their use in scripts is not\n     recommended.\n",
        "     In legacy mode, the -R and -RP options do not change the user ID or the\n     group ID of symbolic links.\n",
        "     chgrp(1), chmod(1), find(1), chown(2), fts(3), compat(5), symlink(7)\n",
        "     The chown utility is expected to be IEEE Std 1003.2 (“POSIX.2”)\n     compliant.\n",
        "     A chown utility appeared in Version 1 AT&T UNIX.\n"
      ]
    }
  ],
  "flags": [
    {
      "flag": "-H",
      "description": "If the -R option is specified, symbolic links on the command line are followed and hence unaffected by the command.\t(Symbolic links encountered during traversal are not followed.)"
    },
    {
      "flag": "-L",
      "description": "If the -R option is specified, all symbolic links are followed."
    },
    {
      "flag": "-P",
      "description": "If the -R option is specified, no symbolic links are followed. Instead, the user and/or group ID of the link itself are modified.\tThis is the default.  For matching behavior when using chown without the -R option, the -h option should be used instead."
    },
    {
      "flag": "-R",
      "description": " rooted in the files, instead of just the files themselves. Beware of unintentionally matching the “..” hard link to the parent directory when using wildcards like “.*”.",
      "argument": "-H | -L | -P",
      "optional": true
    },
    {
      "flag": "-f",
      "description": "Do not report any failure to change file owner or group, nor modify the exit status to reflect such failures."
    },
    {
      "flag": "-h",
      "description": "If the file is a symbolic link, change the user ID and/or the group ID of the link itself."
    },
    {
      "flag": "-n",
      "description": "Interpret user ID and group ID as numeric, avoiding name lookups."
    },
    {
      "flag": "-v",
      "description": "Cause chown to be verbose, showing files as the owner is modified.\tIf the -v flag is specified more than once, chown will print the filename, followed by the old and new numeric user/group ID."
    },
    {
      "flag": "-x",
      "description": "File system mount points are not traversed. The -H, -L and -P options are ignored unless the -R option is specified. In addition, these options override each other and the command's actions are determined by the last one specified. The owner and group operands are both optional, however, one must be specified.  If the group operand is specified, it must be preceded by a colon (``:'') character. The owner may be either a numeric user ID or a user name.\tIf a user name is also a numeric user ID, the operand is used as a user name.  The group may be either a numeric group ID or a group name.\tIf a group name is also a numeric group ID, the operand is used as a group name. The ownership of a file may only be altered by a super-user for obvious security reasons.\tSimilarly, only a member of a group can change a file's group ID to that group. If chown receives a SIGINFO signal (see the status argument for stty(1)), then the current filename as well as the old and new file owner and group are displayed. EXIT STATUS The chown utility exits 0 on success, and >0 if an error occurs."
    }
  ],
  "examples": [],
  "relatedCommands": [
    "chgrp",
    "chmod",
    "find",
    "chown",
    "fts",
    "compat",
    "symlink",
    "change",
    "owner",
    "group",
    "fhnvx",
    "utility",
    "changes",
    "specified",
    "links"
  ],
  "seeAlso": [
    {
      "name": "chgrp",
      "section": 1
    },
    {
      "name": "chmod",
      "section": 1
    },
    {
      "name": "find",
      "section": 1
    },
    {
      "name": "chown",
      "section": 2
    },
    {
      "name": "fts",
      "section": 3
    },
    {
      "name": "compat",
      "section": 5
    },
    {
      "name": "symlink",
      "section": 7
    }
  ],
  "metadata": {},
  "searchContent": "chown chown manual page the chown utility changes the user id and or the group id of the specified files chown -fhnvx -r -h -l -p owner group file chown -fhnvx -r -h -l -p group file chown manual page utility changes and or group specified files -h if the -r option is specified symbolic links on the command line are followed and hence unaffected by the command symbolic links encountered during traversal are not followed -l if the -r option is specified all symbolic links are followed -p if the -r option is specified no symbolic links are followed instead the user and or group id of the link itself are modified this is the default for matching behavior when using chown without the -r option the -h option should be used instead -r rooted in the files instead of just the files themselves beware of unintentionally matching the hard link to the parent directory when using wildcards like -f do not report any failure to change file owner or group nor modify the exit status to reflect such failures -h if the file is a symbolic link change the user id and or the group id of the link itself -n interpret user id and group id as numeric avoiding name lookups -v cause chown to be verbose showing files as the owner is modified if the -v flag is specified more than once chown will print the filename followed by the old and new numeric user group id -x file system mount points are not traversed the -h -l and -p options are ignored unless the -r option is specified in addition these options override each other and the command s actions are determined by the last one specified the owner and group operands are both optional however one must be specified if the group operand is specified it must be preceded by a colon character the owner may be either a numeric user id or a user name if a user name is also a numeric user id the operand is used as a user name the group may be either a numeric group id or a group name if a group name is also a numeric group id the operand is used as a group name the ownership of a file may only be altered by a super-user for obvious security reasons similarly only a member of a group can change a file s group id to that group if chown receives a siginfo signal see the status argument for stty 1 then the current filename as well as the old and new file owner and group are displayed exit status the chown utility exits 0 on success and 0 if an error occurs name macos 15 5 august 24 2022 macos 15 5",
  "keywords": [
    "chown",
    "manual",
    "page",
    "utility",
    "changes",
    "and/or",
    "group",
    "specified",
    "files."
  ],
  "complexity": "intermediate",
  "hash": "2bd98193059b9351",
  "parsedAt": "2025-06-17T19:31:49.914Z",
  "parseVersion": "2.0.0",
  "isCommon": false,
  "hasInteractiveExamples": false,
  "hasDiagrams": false
}